# coding: utf-8
PUB_KEY = """-----BEGIN PUBLIC KEY-----
MIIBIDANBgkqhkiG9w0BAQEFAAOCAQ0AMIIBCAKCAQEArmbpVdz4ogwOH4KQ/ELrPro3uva8oloUkTUSYl0+2yLpfaH2JppoO1C9h+zcRtfC2eNtZykJ7zmULgSglnaeHt88eCb+dMUHj59fMrfAenJMrp5GmhuNjvbHn5FtskUyu2joguT6QPjXeQ3+x7NoheWQw6kMdu+ncrRp+w1LwO2zyutd8i1s6ZzeiPCl/APreEsatxNsXm9Uni4SLGq0jBM4BJUi+15+C5CfKK4St0IkyDDK0WCbYJlV2Jeg6OODf0qMQ6QcPkWyCtA2qOcIm94jWDx7A2nEtCfPfVGXPfcQ+DLw+sZw4I6aXhBRVeq7nFl3XPAHeGkqUJaGYnSE9QIBEQ==
-----END PUBLIC KEY-----"""
PRI_KEY = """-----BEGIN RSA PRIVATE KEY-----
MIIEogIBAAKCAQEA5YXZJW3/iGhQFk1Kb+32vrIh9vxTNc5TTRlRzR/Vqq4M+S610eLhzHMKOxw0X5Kc3a8mnyJcYGeW2k2zLcPrabMJ/ZmCcNRSw3Ox9FsGxBKFYN3c6IYqXBU9UEO63oXjG8uy0kycalfuc/kfklT/sWaV4A4Nms6FJa12fib05dInghXl8PPOg7RfFdwatwDt280NXw9XkgcAZItF1Bj3ns1INwSaaUuYKOSoEeEgsyQaOP1zCtZe1BrKq+ZED3BwLmflus20GFYdcqNkkg9aeEfHgnXpHgbugPWZKQowyHzydwDc+kZqUvrfdbi/2C5UnFDnYa8bMdMomPq+nLlc3wIBEQKCAQEAlIPIvd3DdmGdO5tsZorq89yskMFjBLKuXxBiG1DVjI69GbTQAEeDC9H3j6jWmDGwy62Rdgcsttmd2IyhHZzjnr8klQj6DMWe9vCCNLNeuxsLAnFw0rEqd9GCBsJp20eS894oafVWJrFeDs5fuQnSn/cVrxgm67LOn+i2FWSAWHeyolENwOL7wJOyfZ3y12DH9JekHdY+CbiXHqXTBaPTwjPvcLremLOV0W7KJn+civK3dyv693JFXHBU0p5ipUReOJb+xQO+PAB1KqyZJEI4TeojuXxplnU9tV6ZkFa4API86/iyX7YJr8BSPAZUj8AgQQa5uagyxBbV8O4rx/SS8QKBgQD3KAT5Xqi9fECPjfF/Tmq2tZk2eqxWHRLRMvTDrhmS1OnxXEEmJwVpFDzv+bEiHzcFXDpEEMJJVR9woWYhPwr5NDJfA+iV7mGFaBdO2upsIrrLO7VaTXSaRNHFmEapEDJVduRDEKcO5K/3w/OQdxooXrKNy16lUpd4nMrhC/Lp3wKBgQDtvE3XUOxGI6bS9FOYeNIZZmDB/BfnZe4uX1BqkaUdhnvNiaKn4erTLhPFf5lSd16zga3CZGN7wZORIhb+ubX8osCInbDJnq4RgscpCr6XUYA5bekC6AuvDJGga+BrWbz5B8rMD+Md6lA6Dy/D90hXfAhR1HsQJIzCcJE80B3tAQKBgHRPEWZKqcKU0xZg6h3KjJI3VyiyMvtY+cvbvnozz8ygbhc6eQLlL7j6dweEj5eWOAKFwRD40+ZGLOm1XTzSX4RUzGjyx84V04oS3crBX0HyOckNCgxgr1en6j7eP16eNc3dmJgH1iUgUs7yzPiwhMe0F8pBlfNyKSmzMkvJY0DhAoGARewW5Pmu53PlxZMnpVC2Q7SzC+C7vIdkK8GuPXYhgSeN0wpdBDNjLw2NWDSWgaqjYfj23tI7YKJYlBkV0nLbLC/eRkx/SlvY1/lJoqjOpPnaaz5xtY+K9z/umJgy8mWwDQJKtH0krnIXmJsODHXoGbsRgXq6yIM4dWxm88S9gfECgYEAmq1Db6gHxdfXNbq7RGfG+ZUHBW9WDSYOOWNKrkqFPd3yXOKgosjmHTc4IkNSXxaamEVOL1NnhJRzebRHatV0LEUBXB2RIewjP1ALwlM3z3mwkr4/YOpgFZc0Q1nqAv3ZnxkWJ+hNOgOqHHgPjEOZ5VJMFKYWlZ1i+NlTy7xt8gY=
-----END RSA PRIVATE KEY-----
"""
#签到
SEALS = [
    # 签到表
    {  # 星期一
       'awards': {'gold': 0, 'rock': 10, 'feat': 0, 'prods': {}}},
    {  # 星期二
       'awards': {'gold': 0, 'rock': 15, 'feat': 0, 'prods': {}}},
    {  # 星期三
       'awards': {'gold': 0, 'rock': 20, 'feat': 0, 'prods': {}}},
    {  # 星期四
       'awards': {'gold': 0, 'rock': 25, 'feat': 0, 'prods': {}}},
    {  # 星期五
       'awards': {'gold': 0, 'rock': 30, 'feat': 0, 'prods': {}}},
    {  # 星期六
       'awards': {'gold': 0, 'rock': 35, 'feat': 0, 'prods': {}}},
    {  # 星期日
       'awards': {'gold': 0, 'rock': 100, 'feat': 0, 'prods': {}}}
]
#初始化用户数据 内测用
USERINIT = {
  "avat": "1",
  "xp": 0,
  "gold": 0,
  "rock": 0,
  "feat": 0,
  "book": 0,
  "vrock": 0,
  "jextra": "{\"guide\": 0}",
  "jbatts": "{}",
  "jheros": "{\"01001\": {\"equips\": [0, 0, 0, 0, 0, 0], \"star\": 0, \"color\": 0, \"skills\": [0, 0, 0, 0], \"hid\": \"01001\", \"xp\": 0, \"hp\": 100},\
              \"01002\": {\"equips\": [0, 0, 0, 0, 0, 0], \"star\": 0, \"color\": 0, \"skills\": [0, 0, 0, 0], \"hid\": \"01002\", \"xp\": 0, \"hp\": 100}}",
  "jprods": "{}",
  "jtasks": "{\"01001\": {\"_\": 0, \"tags\": {\"*\": [1, 0]}},\
              \"02001\": {\"_\": 0, \"tags\": {\"*\": [1, 0]}}}",
  "jseals": "[0, 0]",
  "jworks": "{\"01021\": {\"_\": 0, \"tags\": {\"EQUIP\": [1, 0]}},\
              \"01020\": {\"_\": 0, \"tags\": {\"STORE\": [1, 0]}},\
              \"01019\": {\"_\": 0, \"tags\": {\"FEAT\": [1, 0]}},\
              \"01018\": {\"_\": 0, \"tags\": {\"HUNT\": [1, 0]}},\
              \"01017\": {\"_\": 0, \"tags\": {\"MINE\": [1, 0]}},\
              \"01016\": {\"_\": 0, \"tags\": {\"WORSHIP\": [1, 0]}},\
              \"01015\": {\"_\": 0, \"tags\": {\"BEAUTY\": [1, 0]}},\
              \"01014\": {\"_\": 0, \"tags\": {\"CALL\": [3, 0]}},\
              \"01013\": {\"_\": 0, \"tags\": {\"GOLD\": [1, 0]}},\
              \"01012\": {\"_\": 0, \"tags\": {\"INST3\": [2, 0]}},\
              \"01011\": {\"_\": 0, \"tags\": {\"DINNER\": [1, 0]}},\
              \"01010\": {\"_\": 0, \"tags\": {\"LUNCH\": [1, 0]}},\
              \"01009\": {\"_\": 0, \"tags\": {\"BREAKFAST\": [1, 0]}},\
              \"01008\": {\"_\": 0, \"tags\": {\"ARENA\": [3, 0]}},\
              \"01007\": {\"_\": 0, \"tags\": {\"CARD\": [1, 0]}},\
              \"01006\": {\"_\": 0, \"tags\": {\"SKILLUP\": [3, 0]}},\
              \"01004\": {\"_\": 0, \"tags\": {\"INST1\": [2, 0]}},\
              \"01005\": {\"_\": 0, \"tags\": {\"INST2\": [3, 0]}},\
              \"01002\": {\"_\": 0, \"tags\": {\"BATT\": [10, 0]}},\
              \"01003\": {\"_\": 0, \"tags\": {\"HARDBATT\": [3, 0]}},\
              \"01001\": {\"_\": 0, \"tags\": {\"TAX\": [1, 0]}}}",

  "jmails": "{}",
  "jdoors": "{}",
  "jbeautys": "{}",
  "jactivities": "{}",
  "jrecharge": "{}",
  "jinsts": "{}",
  "nickname": ""
}
# #初始化用户数据
# USERINIT = {
#   "avat": "1",
#   "xp": 0,
#   "gold": 0,
#   "rock": 0,
#   "feat": 0,
#   "book": 0,
#   "vrock": 0,
#   "jextra": "{\"guide\": 0}",
#   "jbatts": "{}",
#   "jheros": "{\"01001\": {\"equips\": [0, 0, 0, 0, 0, 0], \"star\": 0, \"color\": 0, \"skills\": [0, 0, 0, 0], \"hid\": \"01001\", \"xp\": 0, \"hp\": 100},\
#               \"01002\": {\"equips\": [0, 0, 0, 0, 0, 0], \"star\": 0, \"color\": 0, \"skills\": [0, 0, 0, 0], \"hid\": \"01002\", \"xp\": 0, \"hp\": 100}}",
#   "jprods": "{}",
#   "jtasks": "{\"01001\": {\"_\": 0, \"tags\": {\"*\": [1, 0]}},\
#               \"02001\": {\"_\": 0, \"tags\": {\"*\": [1, 0]}}}",
#   "jseals": "[0, 0]",
#   "jworks": "{\"01021\": {\"_\": 0, \"tags\": {\"EQUIP\": [1, 0]}},\
#               \"01020\": {\"_\": 0, \"tags\": {\"STORE\": [1, 0]}},\
#               \"01019\": {\"_\": 0, \"tags\": {\"FEAT\": [1, 0]}},\
#               \"01018\": {\"_\": 0, \"tags\": {\"HUNT\": [1, 0]}},\
#               \"01017\": {\"_\": 0, \"tags\": {\"MINE\": [1, 0]}},\
#               \"01016\": {\"_\": 0, \"tags\": {\"WORSHIP\": [1, 0]}},\
#               \"01015\": {\"_\": 0, \"tags\": {\"BEAUTY\": [1, 0]}},\
#               \"01014\": {\"_\": 0, \"tags\": {\"CALL\": [3, 0]}},\
#               \"01013\": {\"_\": 0, \"tags\": {\"GOLD\": [1, 0]}},\
#               \"01012\": {\"_\": 0, \"tags\": {\"INST3\": [2, 0]}},\
#               \"01011\": {\"_\": 0, \"tags\": {\"DINNER\": [1, 0]}},\
#               \"01010\": {\"_\": 0, \"tags\": {\"LUNCH\": [1, 0]}},\
#               \"01009\": {\"_\": 0, \"tags\": {\"BREAKFAST\": [1, 0]}},\
#               \"01008\": {\"_\": 0, \"tags\": {\"ARENA\": [3, 0]}},\
#               \"01007\": {\"_\": 0, \"tags\": {\"CARD\": [1, 0]}},\
#               \"01006\": {\"_\": 0, \"tags\": {\"SKILLUP\": [3, 0]}},\
#               \"01004\": {\"_\": 0, \"tags\": {\"INST1\": [2, 0]}},\
#               \"01005\": {\"_\": 0, \"tags\": {\"INST2\": [3, 0]}},\
#               \"01002\": {\"_\": 0, \"tags\": {\"BATT\": [10, 0]}},\
#               \"01003\": {\"_\": 0, \"tags\": {\"HARDBATT\": [3, 0]}},\
#               \"01001\": {\"_\": 0, \"tags\": {\"TAX\": [1, 0]}}}",
#
#   "jmails": "{}",
#   "jdoors": "{}",
#   "jbeautys": "{}",
#   "jactivities": "{}",
#   "jrecharge": "{}",
#   "jinsts": "{}",
#   "nickname": ""
# }
USERARENA = {
  "jpositions": "{\"01001\": \"-1\",\
                  \"01002\": \"-1\"}",
}
#\"01009\": {\"_\": 0, \"tags\": {\"TAX\": [1, 0]}},\
ARENAMAIL = {
  "sender": "若柳",
  "title": "帝国争霸最高排名奖励",
  "content": "指挥官，你刚刚又刷新了帝国争霸里的最好成绩！"
             "现在你的最高排名是%s"
             "比之前提升了%s"
             "我们获得了以下奖励："
}
TOPMAIL = {
  "sender": "若柳",
  "title": "帝国争霸每日排名奖励",
  "content": "指挥官，如果您是帝国争霸的第一名，每日就可获得550钻石、10W金币、1.8W功勋、800争霸币。"
             "截止今日21:00时，你在帝国争霸中排名为"
             "%s名"
             "你获得了以下奖励(在附件中显示)："
}
PAYMAIL = {
  "sender": "若柳",
  "title": "首冲大礼包",
  "content": "指挥官:"
             "  第一次总是最好的。"
             "  您已完成充值，为您额外献上：100钻石。",
  "jawards": {'rock': 100, 'gold': 50000, 'feat':2000, 'prods':{'03025': 80, '04002': 10}}
}
#新手礼包
TRIOMAIL = {
  "sender": "若柳",
  "title": "新手礼包",
  "content": "指挥官，这是人民为您募集的，请您检阅。",
  # "jawards": {'rock': 30, 'gold': 5000, 'feat': 100, 'prods':{'03019': 10}}
  "jawards": {'rock': 30, 'gold': 5000, 'feat': 100, 'prods':{'03011': 10}}
}
#膜拜奖励
WORSHIPMAIL = {
  "sender": "若柳",
  "title": "膜拜奖励",
  "content": "指挥官:"
             "  您今天收到膜拜次数%s，为您额外献上：%s金币。",
}
#七日礼包
HEBDOMAIL1 = {
  "sender": "若柳",
  "title": "七日礼包",
  "content": "尊敬的指挥官大人:\n"
             "  若柳来发本日的登陆奖励啦，请领取哦！",
  "jawards": {'rock': 10, 'feat': 0, 'gold': 2000, 'prods':{'01001': 5, '03003': 3}}
}
HEBDOMAIL2 = {
  "sender": "若柳",
  "title": "七日礼包",
  "content": "尊敬的指挥官大人:\n"
             "  若柳来发本日的登陆奖励啦，请领取哦！",
  "jawards": {'rock': 20, 'feat': 0, 'gold': 5000, 'prods':{'01002': 5, '03002': 5, '03003': 2}}
}
HEBDOMAIL3 = {
  "sender": "若柳",
  "title": "七日礼包",
  "content": "尊敬的指挥官大人:\n"
             "  若柳来发本日的登陆奖励啦，请领取哦！",
  "jawards": {'rock': 50, 'feat': 0, 'gold': 8000, 'prods':{'01003': 5, '04002': 5}}
}
HEBDOMAIL4 = {
  "sender": "若柳",
  "title": "七日礼包",
  "content": "尊敬的指挥官大人:\n"
             "  若柳来发本日的登陆奖励啦，请领取哦！",
  "jawards": {'rock': 40, 'feat': 0, 'gold': 10000, 'prods':{'01003': 5, '03024': 5}}
}
HEBDOMAIL5 = {
  "sender": "若柳",
  "title": "七日礼包",
  "content": "尊敬的指挥官大人:\n"
             "  若柳来发本日的登陆奖励啦，请领取哦！",
  "jawards": {'rock': 50, 'feat': 0, 'gold': 15000, 'prods':{'01004': 5, '03024': 5}}
}
HEBDOMAIL6 = {
  "sender": "若柳",
  "title": "七日礼包",
  "content": "尊敬的指挥官大人:\n"
             "  若柳来发本日的登陆奖励啦，请领取哦！",
  "jawards": {'rock': 60, 'feat': 0, 'gold': 20000, 'prods':{'01004': 5}}
}
HEBDOMAIL7 = {
  "sender": "若柳",
  "title": "七日礼包",
  "content": "尊敬的指挥官大人:\n"
             "  若柳来发本日的登陆奖励啦，请领取哦！",
  "jawards": {'rock': 100, 'feat': 1000, 'gold': 30000, 'prods':{'01005': 5, '01005': 5}}
}

#冲级拿豪礼
HAOLIMAIL = {
  "sender": "若柳",
  "title": "冲级拿豪礼",
  "content": "尊敬的指挥官大人:\n"
             "  鉴于您勇猛的表现，在活动时间内冲击至30级，若柳在此送上奖励，望指挥官继续努力哦~ ",
  "jawards": {'rock': 100, 'gold': 20000, 'feat': 1000, 'prods':{}}
}
VERSUSMAIL = {
  "sender": "若柳",
  "title": "帝国争霸最高排名奖励",
  "content": "指挥官，你刚刚又刷新了帝国争霸里的最好成绩！"
             "现在你的最高排名是%s"
             "比之前提升了%s"
             "我们获得了以下奖励："
}

#hunt record 
DEFENCE_SUCCESS = u'%s:%s:%s:%s:%s:%s偷袭你，被你打了回去。'
DEFENCE_FAILED = u'%s:%s:%s:%s:%s:%s成功偷袭了你。'

#lott by first
LOTT_BY_FIRST = {'03024': 10}
LOTT_BY_GOLD_FIRST = {'03021': 3}
# get_economy start==========
#体力
LEVELHP = [
  120, 
  121, 
  122, 
  123, 
  124, 
  125, 
  126, 
  127, 
  128, 
  129, 
  130, 
  131, 
  132, 
  133, 
  134, 
  135, 
  136, 
  137, 
  138, 
  139, 
  140, 
  141, 
  142, 
  143, 
  144, 
  145, 
  146, 
  147, 
  148, 
  149, 
  150, 
  151, 
  152, 
  153, 
  154, 
  155, 
  156, 
  157, 
  158, 
  159, 
  160, 
  161, 
  162, 
  163, 
  164, 
  165, 
  166, 
  167, 
  168, 
  169, 
  170, 
  171, 
  172, 
  173, 
  174, 
  175, 
  176, 
  177, 
  178, 
  179, 
  180, 
  181, 
  182, 
  183, 
  184, 
  185, 
  186, 
  187, 
  188, 
  189, 
  190, 
  191, 
  192, 
  193, 
  194, 
  195, 
  196, 
  197, 
  198, 
  199, 
  200, 
  201, 
  202, 
  203, 
  204, 
  205, 
  206, 
  207, 
  208, 
  209, 
]
#等级经验
LEVELXP = [
  0, 0, 
  5, 5, 
  10, 5, 
  15, 5, 
  26, 11, 
  37, 11, 
  48, 11, 
  59, 11, 
  70, 11, 
  83, 13, 
  96, 13, 
  109, 13, 
  122, 13, 
  135, 13, 
  185, 50, 
  285, 100, 
  435, 150, 
  585, 150, 
  745, 160, 
  905, 160, 
  1075, 170, 
  1245, 170, 
  1435, 190, 
  1635, 200, 
  1855, 220, 
  2155, 300, 
  2475, 320, 
  2815, 340, 
  3175, 360, 
  3555, 380, 
  3955, 400, 
  4405, 450, 
  4855, 450, 
  5355, 500, 
  5965, 610, 
  6685, 720, 
  7515, 830, 
  8615, 1100, 
  9815, 1200, 
  11015, 1200, 
  12515, 1500, 
  14015, 1500, 
  15715, 1700, 
  17415, 1700, 
  19115, 1700, 
  20915, 1800, 
  22915, 2000, 
  24915, 2000, 
  27115, 2200, 
  29315, 2200, 
  31615, 2300, 
  33915, 2300, 
  36215, 2300, 
  38715, 2500, 
  41415, 2700, 
  44115, 2700, 
  46915, 2800, 
  49915, 3000, 
  53115, 3200, 
  56415, 3300, 
  59715, 3300, 
  63015, 3300, 
  66515, 3500, 
  70015, 3500, 
  73715, 3700, 
  77515, 3800, 
  81515, 4000, 
  85715, 4200, 
  90015, 4300, 
  94515, 4500, 
  99215, 4700, 
  103915, 4700, 
  108615, 4700, 
  113315, 4700, 
  118015, 4700, 
  122715, 4700, 
  127415, 4700, 
  132115, 4700, 
  136815, 4700, 
  141615, 4800, 
  146515, 4900, 
  151515, 5000, 
  156615, 5100, 
  161815, 5200, 
  167115, 5300, 
  172515, 5400, 
  178015, 5500, 
  183615, 5600, 
  189315, 5700, 
  195115, 5800, 
  201015, 5900, 
  207015, 6000, 
  213115, 6100, 
  219315, 6200, 
  225615, 6300, 
  232015, 6400, 
  238515, 6500, 
  245115, 6600, 
  251815, 6700, 
  258615, 6800, 
]
#武将等级经验
LEVELHXP = [
  0, 0, 
  25, 25, 
  55, 30, 
  95, 40, 
  155, 60, 
  235, 80, 
  335, 100, 
  465, 130, 
  615, 150, 
  795, 180, 
  975, 180, 
  1185, 210, 
  1405, 220, 
  1625, 220, 
  1855, 230, 
  2095, 240, 
  2365, 270, 
  2645, 280, 
  2935, 290, 
  3225, 290, 
  3525, 300, 
  3835, 310, 
  4155, 320, 
  4485, 330, 
  4825, 340, 
  5175, 350, 
  5535, 360, 
  5905, 370, 
  6285, 380, 
  6675, 390, 
  7075, 400, 
  7605, 530, 
  8285, 680, 
  9115, 830, 
  10095, 980, 
  11195, 1100, 
  12595, 1400, 
  14295, 1700, 
  16295, 2000, 
  18595, 2300, 
  21195, 2600, 
  24195, 3000, 
  27495, 3300, 
  31195, 3700, 
  35295, 4100, 
  39795, 4500, 
  44795, 5000, 
  50195, 5400, 
  56095, 5900, 
  62495, 6400, 
  69495, 7000, 
  76995, 7500, 
  85095, 8100, 
  93795, 8700, 
  103095, 9300, 
  113095, 10000, 
  124095, 11000, 
  135095, 11000, 
  147095, 12000, 
  160095, 13000, 
  174095, 14000, 
  189095, 15000, 
  204095, 15000, 
  220095, 16000, 
  237095, 17000, 
  255095, 18000, 
  275095, 20000, 
  296095, 21000, 
  318095, 22000, 
  341095, 23000, 
  365095, 24000, 
  391095, 26000, 
  418095, 27000, 
  446095, 28000, 
  476095, 30000, 
  507095, 31000, 
  540095, 33000, 
  575095, 35000, 
  611095, 36000, 
  649095, 38000, 
  687095, 40000, 
]
LEVELFEAT = [
  20, 20, 
  24, 24, 
  32, 32, 
  48, 48, 
  64, 64, 
  80, 80, 
  104, 104, 
  120, 120, 
  144, 144, 
  144, 144, 
  168, 168, 
  176, 176, 
  176, 176, 
  184, 184, 
  192, 192, 
  216, 216, 
  224, 224, 
  232, 232, 
  232, 232, 
  240, 240, 
  248, 248, 
  256, 256, 
  264, 264, 
  272, 272, 
  280, 280, 
  288, 288, 
  296, 296, 
  304, 304, 
  312, 312, 
  320, 320, 
  424, 424, 
  544, 544, 
  664, 664, 
  784, 784, 
  880, 880, 
  1120, 1120, 
  1360, 1360, 
  1600, 1600, 
  1840, 1840, 
  2080, 2080, 
  2400, 2400, 
  2640, 2640, 
  2960, 2960, 
  3280, 3280, 
  3600, 3600, 
  4000, 4000, 
  4320, 4320, 
  4720, 4720, 
  5120, 5120, 
  5600, 5600, 
  6000, 6000, 
  6480, 6480, 
  6960, 6960, 
  7440, 7440, 
  8000, 8000, 
  8800, 8800, 
  8800, 8800, 
  9600, 9600, 
  10400, 10400, 
  11200, 11200, 
  12000, 12000, 
  12000, 12000, 
  12800, 12800, 
  13600, 13600, 
  14400, 14400, 
  16000, 16000, 
  16800, 16800, 
  17600, 17600, 
  18400, 18400, 
  19200, 19200, 
  20800, 20800, 
  21600, 21600, 
  22400, 22400, 
  24000, 24000, 
  24800, 24800, 
  26400, 26400, 
  28000, 28000, 
  28800, 28800, 
  30400, 30400, 
  35000, 35000, 
  38000, 38000, 
]
LEVELIMIT = [
  0, 9, 
  1, 10, 
  2, 10, 
  3, 11, 
  4, 11, 
  5, 12, 
  6, 12, 
  7, 13, 
  8, 13, 
  9, 14, 
  10, 14, 
  11, 15, 
  12, 15, 
  13, 16, 
  14, 16, 
  15, 17, 
  16, 17, 
  17, 18, 
  18, 18, 
  19, 19, 
  20, 20, 
  21, 21, 
  22, 22, 
  23, 23, 
  24, 24, 
  25, 25, 
  26, 26, 
  27, 27, 
  28, 28, 
  29, 29, 
  30, 30, 
  31, 31, 
  32, 32, 
  33, 33, 
  34, 34, 
  35, 35, 
  36, 36, 
  37, 37, 
  38, 38, 
  39, 39, 
  40, 40, 
  41, 41, 
  42, 42, 
  43, 43, 
  44, 44, 
  45, 45, 
  46, 46, 
  47, 47, 
  48, 48, 
  49, 49, 
  50, 50, 
  51, 51, 
  52, 52, 
  53, 53, 
  54, 54, 
  55, 55, 
  56, 56, 
  57, 57, 
  58, 58, 
  59, 59, 
  60, 60, 
  61, 61, 
  62, 62, 
  63, 63, 
  64, 64, 
  65, 65, 
  66, 66, 
  67, 67, 
  68, 68, 
  69, 69, 
  70, 70, 
  71, 71, 
  72, 72, 
  73, 73, 
  74, 74, 
  75, 75, 
  76, 76, 
  77, 77, 
  78, 78, 
  79, 79, 
  80, 80, 
  81, 81, 
  82, 82, 
  83, 83, 
  84, 84, 
  85, 85, 
  86, 86, 
  87, 87, 
  88, 88, 
  89, 89, 
  90, 90, 
  91, 91, 
  92, 92, 
  93, 93, 
  94, 94, 
  95, 95, 
  96, 96, 
  97, 97, 
  98, 98, 
  99, 99, 
]
HEROSKILL = [
  [
    {
      "gold": 0,
      "prods": {},
      "xp": 0
    },
    {
      "gold": 100,
      "prods": {},
      "xp": 100000
    },
    {
      "gold": 500,
      "prods": {},
      "xp": 200000
    },
    {
      "gold": 1000,
      "prods": {},
      "xp": 300000
    },
    {
      "gold": 1500,
      "prods": {},
      "xp": 400000
    },
    {
      "gold": 2000,
      "prods": {},
      "xp": 500000
    },
    {
      "gold": 2500,
      "prods": {},
      "xp": 600000
    },
    {
      "gold": 3000,
      "prods": {},
      "xp": 700000
    },
    {
      "gold": 3500,
      "prods": {},
      "xp": 800000
    },
    {
      "gold": 4000,
      "prods": {},
      "xp": 900000
    },
    {
      "gold": 4500,
      "prods": {},
      "xp": 1000000
    },
    {
      "gold": 5000,
      "prods": {},
      "xp": 1100000
    },
    {
      "gold": 5500,
      "prods": {},
      "xp": 1200000
    },
    {
      "gold": 6000,
      "prods": {},
      "xp": 1300000
    },
    {
      "gold": 6500,
      "prods": {},
      "xp": 1400000
    },
    {
      "gold": 7000,
      "prods": {},
      "xp": 1500000
    },
    {
      "gold": 7500,
      "prods": {},
      "xp": 1600000
    },
    {
      "gold": 8000,
      "prods": {},
      "xp": 1700000
    },
    {
      "gold": 8500,
      "prods": {},
      "xp": 1800000
    },
    {
      "gold": 9000,
      "prods": {},
      "xp": 1900000
    },
    {
      "gold": 9500,
      "prods": {},
      "xp": 2000000
    },
    {
      "gold": 10000,
      "prods": {},
      "xp": 2100000
    },
    {
      "gold": 10500,
      "prods": {},
      "xp": 2200000
    },
    {
      "gold": 11000,
      "prods": {},
      "xp": 2300000
    },
    {
      "gold": 11500,
      "prods": {},
      "xp": 2400000
    },
    {
      "gold": 12000,
      "prods": {},
      "xp": 2500000
    },
    {
      "gold": 12500,
      "prods": {},
      "xp": 2600000
    },
    {
      "gold": 13000,
      "prods": {},
      "xp": 2700000
    },
    {
      "gold": 13500,
      "prods": {},
      "xp": 2800000
    },
    {
      "gold": 14000,
      "prods": {},
      "xp": 2900000
    },
    {
      "gold": 14500,
      "prods": {},
      "xp": 3000000
    },
    {
      "gold": 15000,
      "prods": {},
      "xp": 3100000
    },
    {
      "gold": 15500,
      "prods": {},
      "xp": 3200000
    },
    {
      "gold": 16000,
      "prods": {},
      "xp": 3300000
    },
    {
      "gold": 16500,
      "prods": {},
      "xp": 3400000
    },
    {
      "gold": 17000,
      "prods": {},
      "xp": 3500000
    },
    {
      "gold": 17500,
      "prods": {},
      "xp": 3600000
    },
    {
      "gold": 18000,
      "prods": {},
      "xp": 3700000
    },
    {
      "gold": 18500,
      "prods": {},
      "xp": 3800000
    },
    {
      "gold": 19000,
      "prods": {},
      "xp": 3900000
    },
    {
      "gold": 19500,
      "prods": {},
      "xp": 4000000
    },
    {
      "gold": 20000,
      "prods": {},
      "xp": 4100000
    },
    {
      "gold": 16490,
      "prods": {},
      "xp": 4200000
    },
    {
      "gold": 22000,
      "prods": {},
      "xp": 4300000
    },
    {
      "gold": 23000,
      "prods": {},
      "xp": 4400000
    },
    {
      "gold": 24000,
      "prods": {},
      "xp": 4500000
    },
    {
      "gold": 25000,
      "prods": {},
      "xp": 4600000
    },
    {
      "gold": 26000,
      "prods": {},
      "xp": 4700000
    },
    {
      "gold": 27000,
      "prods": {},
      "xp": 4800000
    },
    {
      "gold": 28000,
      "prods": {},
      "xp": 4900000
    },
    {
      "gold": 29000,
      "prods": {},
      "xp": 5000000
    },
    {
      "gold": 30000,
      "prods": {},
      "xp": 5100000
    },
    {
      "gold": 31000,
      "prods": {},
      "xp": 5200000
    },
    {
      "gold": 32000,
      "prods": {},
      "xp": 5300000
    },
    {
      "gold": 33000,
      "prods": {},
      "xp": 5400000
    },
    {
      "gold": 34000,
      "prods": {},
      "xp": 5500000
    },
    {
      "gold": 35000,
      "prods": {},
      "xp": 5600000
    },
    {
      "gold": 36000,
      "prods": {},
      "xp": 5700000
    },
    {
      "gold": 37000,
      "prods": {},
      "xp": 5800000
    },
    {
      "gold": 38000,
      "prods": {},
      "xp": 5900000
    },
    {
      "gold": 39000,
      "prods": {},
      "xp": 6000000
    },
    {
      "gold": 40000,
      "prods": {},
      "xp": 6100000
    },
    {
      "gold": 41000,
      "prods": {},
      "xp": 6200000
    },
    {
      "gold": 42000,
      "prods": {},
      "xp": 6300000
    },
    {
      "gold": 43000,
      "prods": {},
      "xp": 6400000
    },
    {
      "gold": 44000,
      "prods": {},
      "xp": 6500000
    },
    {
      "gold": 45000,
      "prods": {},
      "xp": 6600000
    },
    {
      "gold": 46000,
      "prods": {},
      "xp": 6700000
    },
    {
      "gold": 47000,
      "prods": {},
      "xp": 6800000
    },
    {
      "gold": 48000,
      "prods": {},
      "xp": 6900000
    },
    {
      "gold": 49000,
      "prods": {},
      "xp": 7000000
    },
    {
      "gold": 50000,
      "prods": {},
      "xp": 7100000
    },
    {
      "gold": 51000,
      "prods": {},
      "xp": 7200000
    },
    {
      "gold": 52000,
      "prods": {},
      "xp": 7300000
    },
    {
      "gold": 53000,
      "prods": {},
      "xp": 7400000
    },
    {
      "gold": 54000,
      "prods": {},
      "xp": 7500000
    },
    {
      "gold": 55000,
      "prods": {},
      "xp": 7600000
    },
    {
      "gold": 56000,
      "prods": {},
      "xp": 7700000
    },
    {
      "gold": 57000,
      "prods": {},
      "xp": 7800000
    },
    {
      "gold": 59000,
      "prods": {},
      "xp": 7900000
    },
    {
      "gold": 59000,
      "prods": {},
      "xp": 7900000
    }
  ],
  [
    {
      "gold": 0,
      "prods": {},
      "xp": 0
    },
    {
      "gold": 100,
      "prods": {},
      "xp": 100000
    },
    {
      "gold": 500,
      "prods": {},
      "xp": 200000
    },
    {
      "gold": 1000,
      "prods": {},
      "xp": 300000
    },
    {
      "gold": 1500,
      "prods": {},
      "xp": 400000
    },
    {
      "gold": 2000,
      "prods": {},
      "xp": 500000
    },
    {
      "gold": 2500,
      "prods": {},
      "xp": 600000
    },
    {
      "gold": 3000,
      "prods": {},
      "xp": 700000
    },
    {
      "gold": 3500,
      "prods": {},
      "xp": 800000
    },
    {
      "gold": 4000,
      "prods": {},
      "xp": 900000
    },
    {
      "gold": 4500,
      "prods": {},
      "xp": 1000000
    },
    {
      "gold": 5000,
      "prods": {},
      "xp": 1100000
    },
    {
      "gold": 5500,
      "prods": {},
      "xp": 1200000
    },
    {
      "gold": 6000,
      "prods": {},
      "xp": 1300000
    },
    {
      "gold": 6500,
      "prods": {},
      "xp": 1400000
    },
    {
      "gold": 7000,
      "prods": {},
      "xp": 1500000
    },
    {
      "gold": 7500,
      "prods": {},
      "xp": 1600000
    },
    {
      "gold": 8000,
      "prods": {},
      "xp": 1700000
    },
    {
      "gold": 8500,
      "prods": {},
      "xp": 1800000
    },
    {
      "gold": 9000,
      "prods": {},
      "xp": 1900000
    },
    {
      "gold": 9500,
      "prods": {},
      "xp": 2000000
    },
    {
      "gold": 10000,
      "prods": {},
      "xp": 2100000
    },
    {
      "gold": 10500,
      "prods": {},
      "xp": 2200000
    },
    {
      "gold": 11000,
      "prods": {},
      "xp": 2300000
    },
    {
      "gold": 11500,
      "prods": {},
      "xp": 2400000
    },
    {
      "gold": 12000,
      "prods": {},
      "xp": 2500000
    },
    {
      "gold": 12500,
      "prods": {},
      "xp": 2600000
    },
    {
      "gold": 13000,
      "prods": {},
      "xp": 2700000
    },
    {
      "gold": 13500,
      "prods": {},
      "xp": 2800000
    },
    {
      "gold": 14000,
      "prods": {},
      "xp": 2900000
    },
    {
      "gold": 14500,
      "prods": {},
      "xp": 3000000
    },
    {
      "gold": 15000,
      "prods": {},
      "xp": 3100000
    },
    {
      "gold": 15500,
      "prods": {},
      "xp": 3200000
    },
    {
      "gold": 16000,
      "prods": {},
      "xp": 3300000
    },
    {
      "gold": 16500,
      "prods": {},
      "xp": 3400000
    },
    {
      "gold": 17000,
      "prods": {},
      "xp": 3500000
    },
    {
      "gold": 17500,
      "prods": {},
      "xp": 3600000
    },
    {
      "gold": 18000,
      "prods": {},
      "xp": 3700000
    },
    {
      "gold": 18500,
      "prods": {},
      "xp": 3800000
    },
    {
      "gold": 19000,
      "prods": {},
      "xp": 3900000
    },
    {
      "gold": 19500,
      "prods": {},
      "xp": 4000000
    },
    {
      "gold": 20000,
      "prods": {},
      "xp": 4100000
    },
    {
      "gold": 21000,
      "prods": {},
      "xp": 4200000
    },
    {
      "gold": 22000,
      "prods": {},
      "xp": 4300000
    },
    {
      "gold": 23000,
      "prods": {},
      "xp": 4400000
    },
    {
      "gold": 24000,
      "prods": {},
      "xp": 4500000
    },
    {
      "gold": 25000,
      "prods": {},
      "xp": 4600000
    },
    {
      "gold": 26000,
      "prods": {},
      "xp": 4700000
    },
    {
      "gold": 27000,
      "prods": {},
      "xp": 4800000
    },
    {
      "gold": 28000,
      "prods": {},
      "xp": 4900000
    },
    {
      "gold": 29000,
      "prods": {},
      "xp": 5000000
    },
    {
      "gold": 30000,
      "prods": {},
      "xp": 5100000
    },
    {
      "gold": 31000,
      "prods": {},
      "xp": 5200000
    },
    {
      "gold": 32000,
      "prods": {},
      "xp": 5300000
    },
    {
      "gold": 33000,
      "prods": {},
      "xp": 5400000
    },
    {
      "gold": 34000,
      "prods": {},
      "xp": 5500000
    },
    {
      "gold": 35000,
      "prods": {},
      "xp": 5600000
    },
    {
      "gold": 36000,
      "prods": {},
      "xp": 5700000
    },
    {
      "gold": 37000,
      "prods": {},
      "xp": 5800000
    },
    {
      "gold": 38000,
      "prods": {},
      "xp": 5900000
    },
    {
      "gold": 39000,
      "prods": {},
      "xp": 6000000
    },
    {
      "gold": 40000,
      "prods": {},
      "xp": 6100000
    },
    {
      "gold": 41000,
      "prods": {},
      "xp": 6200000
    },
    {
      "gold": 42000,
      "prods": {},
      "xp": 6300000
    },
    {
      "gold": 43000,
      "prods": {},
      "xp": 6400000
    },
    {
      "gold": 44000,
      "prods": {},
      "xp": 6500000
    },
    {
      "gold": 45000,
      "prods": {},
      "xp": 6600000
    },
    {
      "gold": 46000,
      "prods": {},
      "xp": 6700000
    },
    {
      "gold": 47000,
      "prods": {},
      "xp": 6800000
    },
    {
      "gold": 48000,
      "prods": {},
      "xp": 6900000
    },
    {
      "gold": 49000,
      "prods": {},
      "xp": 7000000
    },
    {
      "gold": 50000,
      "prods": {},
      "xp": 7100000
    },
    {
      "gold": 51000,
      "prods": {},
      "xp": 7200000
    },
    {
      "gold": 52000,
      "prods": {},
      "xp": 7300000
    },
    {
      "gold": 53000,
      "prods": {},
      "xp": 7400000
    },
    {
      "gold": 54000,
      "prods": {},
      "xp": 7500000
    },
    {
      "gold": 55000,
      "prods": {},
      "xp": 7600000
    },
    {
      "gold": 56000,
      "prods": {},
      "xp": 7700000
    },
    {
      "gold": 57000,
      "prods": {},
      "xp": 7800000
    },
    {
      "gold": 59000,
      "prods": {},
      "xp": 7900000
    },
    {
      "gold": 59000,
      "prods": {},
      "xp": 7900000
    }
  ],
  [
    {
      "gold": 0,
      "prods": {},
      "xp": 0
    },
    {
      "gold": 10000,
      "prods": {},
      "xp": 1000000
    },
    {
      "gold": 10500,
      "prods": {},
      "xp": 1100000
    },
    {
      "gold": 11000,
      "prods": {},
      "xp": 1200000
    },
    {
      "gold": 11500,
      "prods": {},
      "xp": 1300000
    },
    {
      "gold": 12000,
      "prods": {},
      "xp": 1400000
    },
    {
      "gold": 12500,
      "prods": {},
      "xp": 1500000
    },
    {
      "gold": 13000,
      "prods": {},
      "xp": 1600000
    },
    {
      "gold": 13500,
      "prods": {},
      "xp": 1700000
    },
    {
      "gold": 14000,
      "prods": {},
      "xp": 1800000
    },
    {
      "gold": 14500,
      "prods": {},
      "xp": 1900000
    },
    {
      "gold": 15000,
      "prods": {},
      "xp": 2000000
    },
    {
      "gold": 15500,
      "prods": {},
      "xp": 2100000
    },
    {
      "gold": 16000,
      "prods": {},
      "xp": 2200000
    },
    {
      "gold": 16500,
      "prods": {},
      "xp": 2300000
    },
    {
      "gold": 17000,
      "prods": {},
      "xp": 2400000
    },
    {
      "gold": 17500,
      "prods": {},
      "xp": 2500000
    },
    {
      "gold": 18000,
      "prods": {},
      "xp": 2600000
    },
    {
      "gold": 18500,
      "prods": {},
      "xp": 2700000
    },
    {
      "gold": 19000,
      "prods": {},
      "xp": 2800000
    },
    {
      "gold": 19500,
      "prods": {},
      "xp": 2900000
    },
    {
      "gold": 20000,
      "prods": {},
      "xp": 3000000
    },
    {
      "gold": 21000,
      "prods": {},
      "xp": 3100000
    },
    {
      "gold": 22000,
      "prods": {},
      "xp": 3200000
    },
    {
      "gold": 23000,
      "prods": {},
      "xp": 3300000
    },
    {
      "gold": 24000,
      "prods": {},
      "xp": 3400000
    },
    {
      "gold": 25000,
      "prods": {},
      "xp": 3500000
    },
    {
      "gold": 26000,
      "prods": {},
      "xp": 3600000
    },
    {
      "gold": 27000,
      "prods": {},
      "xp": 3700000
    },
    {
      "gold": 28000,
      "prods": {},
      "xp": 3800000
    },
    {
      "gold": 29000,
      "prods": {},
      "xp": 3900000
    },
    {
      "gold": 30000,
      "prods": {},
      "xp": 4000000
    },
    {
      "gold": 31000,
      "prods": {},
      "xp": 4100000
    },
    {
      "gold": 32000,
      "prods": {},
      "xp": 4200000
    },
    {
      "gold": 33000,
      "prods": {},
      "xp": 4300000
    },
    {
      "gold": 34000,
      "prods": {},
      "xp": 4400000
    },
    {
      "gold": 35000,
      "prods": {},
      "xp": 4500000
    },
    {
      "gold": 36000,
      "prods": {},
      "xp": 4600000
    },
    {
      "gold": 37000,
      "prods": {},
      "xp": 4700000
    },
    {
      "gold": 38000,
      "prods": {},
      "xp": 4800000
    },
    {
      "gold": 39000,
      "prods": {},
      "xp": 4900000
    },
    {
      "gold": 40000,
      "prods": {},
      "xp": 5000000
    },
    {
      "gold": 41000,
      "prods": {},
      "xp": 5100000
    },
    {
      "gold": 42000,
      "prods": {},
      "xp": 5200000
    },
    {
      "gold": 43000,
      "prods": {},
      "xp": 5300000
    },
    {
      "gold": 44000,
      "prods": {},
      "xp": 5400000
    },
    {
      "gold": 45000,
      "prods": {},
      "xp": 5500000
    },
    {
      "gold": 46000,
      "prods": {},
      "xp": 5600000
    },
    {
      "gold": 47000,
      "prods": {},
      "xp": 5700000
    },
    {
      "gold": 48000,
      "prods": {},
      "xp": 5800000
    },
    {
      "gold": 49000,
      "prods": {},
      "xp": 5900000
    },
    {
      "gold": 50000,
      "prods": {},
      "xp": 6000000
    },
    {
      "gold": 51000,
      "prods": {},
      "xp": 6100000
    },
    {
      "gold": 52000,
      "prods": {},
      "xp": 6200000
    },
    {
      "gold": 53000,
      "prods": {},
      "xp": 6300000
    },
    {
      "gold": 54000,
      "prods": {},
      "xp": 6400000
    },
    {
      "gold": 55000,
      "prods": {},
      "xp": 6500000
    },
    {
      "gold": 56000,
      "prods": {},
      "xp": 6600000
    },
    {
      "gold": 57000,
      "prods": {},
      "xp": 6700000
    },
    {
      "gold": 58000,
      "prods": {},
      "xp": 6800000
    },
    {
      "gold": 59000,
      "prods": {},
      "xp": 6900000
    },
    {
      "gold": 60000,
      "prods": {},
      "xp": 7000000
    },
    {
      "gold": 61000,
      "prods": {},
      "xp": 7100000
    },
    {
      "gold": 62000,
      "prods": {},
      "xp": 7200000
    },
    {
      "gold": 63000,
      "prods": {},
      "xp": 7300000
    },
    {
      "gold": 64000,
      "prods": {},
      "xp": 7400000
    },
    {
      "gold": 65000,
      "prods": {},
      "xp": 7500000
    },
    {
      "gold": 66000,
      "prods": {},
      "xp": 7600000
    },
    {
      "gold": 67000,
      "prods": {},
      "xp": 7700000
    },
    {
      "gold": 68000,
      "prods": {},
      "xp": 7800000
    },
    {
      "gold": 69000,
      "prods": {},
      "xp": 7900000
    },
    {
      "gold": 70000,
      "prods": {},
      "xp": 8000000
    },
    {
      "gold": 71000,
      "prods": {},
      "xp": 8100000
    },
    {
      "gold": 72000,
      "prods": {},
      "xp": 8200000
    },
    {
      "gold": 73000,
      "prods": {},
      "xp": 8300000
    },
    {
      "gold": 74000,
      "prods": {},
      "xp": 8400000
    },
    {
      "gold": 75000,
      "prods": {},
      "xp": 8500000
    },
    {
      "gold": 76000,
      "prods": {},
      "xp": 8600000
    },
    {
      "gold": 77000,
      "prods": {},
      "xp": 8700000
    },
    {
      "gold": 78000,
      "prods": {},
      "xp": 8800000
    },
    {
      "gold": 78000,
      "prods": {},
      "xp": 8800000
    }
  ],
  [
    {
      "gold": 0,
      "prods": {},
      "xp": 0
    },
    {
      "gold": 21000,
      "prods": {},
      "xp": 1000000
    },
    {
      "gold": 22000,
      "prods": {},
      "xp": 1100000
    },
    {
      "gold": 23000,
      "prods": {},
      "xp": 1200000
    },
    {
      "gold": 24000,
      "prods": {},
      "xp": 1300000
    },
    {
      "gold": 25000,
      "prods": {},
      "xp": 1400000
    },
    {
      "gold": 26000,
      "prods": {},
      "xp": 1500000
    },
    {
      "gold": 27000,
      "prods": {},
      "xp": 1600000
    },
    {
      "gold": 28000,
      "prods": {},
      "xp": 1700000
    },
    {
      "gold": 29000,
      "prods": {},
      "xp": 1800000
    },
    {
      "gold": 30000,
      "prods": {},
      "xp": 1900000
    },
    {
      "gold": 31000,
      "prods": {},
      "xp": 2000000
    },
    {
      "gold": 32000,
      "prods": {},
      "xp": 2100000
    },
    {
      "gold": 33000,
      "prods": {},
      "xp": 2200000
    },
    {
      "gold": 34000,
      "prods": {},
      "xp": 2300000
    },
    {
      "gold": 35000,
      "prods": {},
      "xp": 2400000
    },
    {
      "gold": 36000,
      "prods": {},
      "xp": 2500000
    },
    {
      "gold": 37000,
      "prods": {},
      "xp": 2600000
    },
    {
      "gold": 38000,
      "prods": {},
      "xp": 2700000
    },
    {
      "gold": 39000,
      "prods": {},
      "xp": 2800000
    },
    {
      "gold": 40000,
      "prods": {},
      "xp": 2900000
    },
    {
      "gold": 41000,
      "prods": {},
      "xp": 3000000
    },
    {
      "gold": 42000,
      "prods": {},
      "xp": 3100000
    },
    {
      "gold": 43000,
      "prods": {},
      "xp": 3200000
    },
    {
      "gold": 44000,
      "prods": {},
      "xp": 3300000
    },
    {
      "gold": 45000,
      "prods": {},
      "xp": 3400000
    },
    {
      "gold": 46000,
      "prods": {},
      "xp": 3500000
    },
    {
      "gold": 47000,
      "prods": {},
      "xp": 3600000
    },
    {
      "gold": 48000,
      "prods": {},
      "xp": 3700000
    },
    {
      "gold": 49000,
      "prods": {},
      "xp": 3800000
    },
    {
      "gold": 50000,
      "prods": {},
      "xp": 3900000
    },
    {
      "gold": 51000,
      "prods": {},
      "xp": 4000000
    },
    {
      "gold": 52000,
      "prods": {},
      "xp": 4100000
    },
    {
      "gold": 53000,
      "prods": {},
      "xp": 4200000
    },
    {
      "gold": 54000,
      "prods": {},
      "xp": 4300000
    },
    {
      "gold": 55000,
      "prods": {},
      "xp": 4400000
    },
    {
      "gold": 56000,
      "prods": {},
      "xp": 4500000
    },
    {
      "gold": 57000,
      "prods": {},
      "xp": 4600000
    },
    {
      "gold": 58000,
      "prods": {},
      "xp": 4700000
    },
    {
      "gold": 59000,
      "prods": {},
      "xp": 4800000
    },
    {
      "gold": 60000,
      "prods": {},
      "xp": 4900000
    },
    {
      "gold": 61000,
      "prods": {},
      "xp": 5000000
    },
    {
      "gold": 62000,
      "prods": {},
      "xp": 5100000
    },
    {
      "gold": 63000,
      "prods": {},
      "xp": 5200000
    },
    {
      "gold": 64000,
      "prods": {},
      "xp": 5300000
    },
    {
      "gold": 65000,
      "prods": {},
      "xp": 5400000
    },
    {
      "gold": 66000,
      "prods": {},
      "xp": 5500000
    },
    {
      "gold": 67000,
      "prods": {},
      "xp": 5600000
    },
    {
      "gold": 68000,
      "prods": {},
      "xp": 5700000
    },
    {
      "gold": 69000,
      "prods": {},
      "xp": 5800000
    },
    {
      "gold": 70000,
      "prods": {},
      "xp": 5900000
    },
    {
      "gold": 71000,
      "prods": {},
      "xp": 6000000
    },
    {
      "gold": 72000,
      "prods": {},
      "xp": 6100000
    },
    {
      "gold": 73000,
      "prods": {},
      "xp": 6200000
    },
    {
      "gold": 74000,
      "prods": {},
      "xp": 6300000
    },
    {
      "gold": 75000,
      "prods": {},
      "xp": 6400000
    },
    {
      "gold": 76000,
      "prods": {},
      "xp": 6500000
    },
    {
      "gold": 77000,
      "prods": {},
      "xp": 6600000
    },
    {
      "gold": 78000,
      "prods": {},
      "xp": 6700000
    },
    {
      "gold": 79000,
      "prods": {},
      "xp": 6800000
    },
    {
      "gold": 80000,
      "prods": {},
      "xp": 6900000
    },
    {
      "gold": 81000,
      "prods": {},
      "xp": 7000000
    },
    {
      "gold": 82000,
      "prods": {},
      "xp": 7100000
    },
    {
      "gold": 83000,
      "prods": {},
      "xp": 7200000
    },
    {
      "gold": 84000,
      "prods": {},
      "xp": 7300000
    },
    {
      "gold": 85000,
      "prods": {},
      "xp": 7400000
    },
    {
      "gold": 86000,
      "prods": {},
      "xp": 7500000
    },
    {
      "gold": 87000,
      "prods": {},
      "xp": 7600000
    },
    {
      "gold": 88000,
      "prods": {},
      "xp": 7700000
    },
    {
      "gold": 89000,
      "prods": {},
      "xp": 7800000
    },
    {
      "gold": 90000,
      "prods": {},
      "xp": 7900000
    },
    {
      "gold": 91000,
      "prods": {},
      "xp": 8000000
    },
    {
      "gold": 92000,
      "prods": {},
      "xp": 8100000
    },
    {
      "gold": 93000,
      "prods": {},
      "xp": 8200000
    },
    {
      "gold": 94000,
      "prods": {},
      "xp": 8300000
    },
    {
      "gold": 95000,
      "prods": {},
      "xp": 8400000
    },
    {
      "gold": 96000,
      "prods": {},
      "xp": 8500000
    },
    {
      "gold": 97000,
      "prods": {},
      "xp": 8600000
    },
    {
      "gold": 98000,
      "prods": {},
      "xp": 8700000
    },
    {
      "gold": 99000,
      "prods": {},
      "xp": 8800000
    },
    {
      "gold": 99000,
      "prods": {},
      "xp": 8800000
    }
  ]
]
#任务 成长任务
TASK = {
  "01001": {
    "awards": {
      "gold": 0,
      "xp": 6,
      "prods": {
        "03001": 1
      },
      "rock": 0
    },
    "cat": "01",
    "progress": lambda user: 1 if user['xp']/100000 >= 1 else 0,
    "tags": {'*': 1}
  },
  "01002": {
    "awards": {
      "gold": 0,
      "xp": 6,
      "prods": {
        "03001": 1
      },
      "rock": 0
    },
    "cat": "01",
    "progress": lambda user: 1 if user['xp']/100000 >= 2 else 0,
    "revdep": ["01001"],
    "open": ["03001"], 
    "tags": {'*': 1}
  },
  "01003": {
    "awards": {
      "gold": 0,
      "xp": 6,
      "prods": {
        "03001": 1
      },
      "rock": 0
    },
    "cat": "01",
    "progress": lambda user: 1 if user['xp']/100000 >= 4 else 0,
    "revdep": ["01002"],
    "tags": {'*': 1}
  },
  "01004": {
    "awards": {
      "gold": 0,
      "xp": 6,
      "prods": {},
      "rock": 5
    },
    "cat": "01",
    "progress": lambda user: 1 if user['xp']/100000 >= 6 else 0,
    "revdep": ["01003"],
    "tags": {'*': 1}
  },
  "01005": {
    "awards": {
      "gold": 0,
      "xp": 6,
      "prods": {},
      "rock": 7
    },
    "cat": "01",
    "progress": lambda user: 1 if user['xp']/100000 >= 8 else 0,
    "revdep": ["01004"],
    "open": ["03002"], 
    "tags": {'*': 1}
  },
  "01006": {
    "awards": {
      "gold": 0,
      "xp": 6,
      "prods": {},
      "rock": 9
    },
    "cat": "01",
    "progress": lambda user: 1 if user['xp']/100000 >= 9 else 0,
    "revdep": ["01005"],
    "open": ["03003"], 
    "tags": {'*': 1}
  },
  "01007": {
    "awards": {
      "gold": 0,
      "xp": 6,
      "prods": {},
      "rock": 11
    },
    "cat": "01",
    "progress": lambda user: 1 if user['xp']/100000 >= 14 else 0,
    "revdep": ["01006"],
    "open": ["03004"], 
    "tags": {'*': 1},
  },
  "01008": {
    "awards": {
      "gold": 0,
      "xp": 6,
      "prods": {},
      "rock": 13
    },
    "cat": "01",
    "progress": lambda user: 1 if user['xp']/100000 >= 19 else 0,
    "revdep": ["01007"],
    "open": ["03005"], 
    "tags": {'*': 1}
  },
  "01009": {
    "awards": {
      "gold": 0,
      "xp": 6,
      "prods": {},
      "rock": 15
    },
    "cat": "01",
    "progress": lambda user: 1 if user['xp']/100000 >= 24 else 0,
    "revdep": ["01008"],
    "open": ["03006"], 
    "tags": {'*': 1}
  },
  "01010": {
    "awards": {
      "gold": 0,
      "xp": 6,
      "prods": {},
      "rock": 17
    },
    "cat": "01",
    "progress": lambda user: 1 if user['xp']/100000 >= 29 else 0,
    "revdep": ["01009"],
    "open": ["03007"], 
    "tags": {'*': 1}
  },
  "01011": {
    "awards": {
      "gold": 0,
      "xp": 6,
      "prods": {},
      "rock": 19
    },
    "cat": "01",
    "progress": lambda user: 1 if user['xp']/100000 >= 34 else 0,
    "revdep": ["01010"],
    "open": ["03008"], 
    "tags": {'*': 1},
  },
  "01012": {
    "awards": {
      "gold": 0,
      "xp": 6,
      "prods": {},
      "rock": 21
    },
    "cat": "01",
    "progress": lambda user: 1 if user['xp']/100000 >= 39 else 0,
    "revdep": ["01011"],
    "open": ["03009"], 
    "tags": {'*': 1},
  },
  "01013": {
    "awards": {
      "gold": 0,
      "xp": 6,
      "prods": {},
      "rock": 23
    },
    "cat": "01",
    "progress": lambda user: 1 if user['xp']/100000 >= 44 else 0,
    "revdep": ["01012"],
    "open": ["03010"], 
    "tags": {'*': 1},
  },
  "01014": {
    "awards": {
      "gold": 0,
      "prods": {},
      "rock": 25
    },
    "cat": "01",
    "progress": lambda user: 1 if user['xp']/100000 >= 49 else 0,
    "revdep": ["01013"],
    "tags": {'*': 1},
  },
  "01015": {
    "awards": {
      "gold": 0,
      "xp": 6,
      "prods": {},
      "rock": 27
    },
    "cat": "01",
    "progress": lambda user: 1 if user['xp']/100000 >= 54 else 0,
    "revdep": ["01014"],
    "tags": {'*': 1},
  },
  "01016": {
    "awards": {
      "gold": 0,
      "prods": {},
      "rock": 29
    },
    "cat": "01",
    "progress": lambda user: 1 if user['xp']/100000 >= 59 else 0,
    "revdep": ["01015"],
    "tags": {'*': 1},
  },
  "01017": {
    "awards": {
      "gold": 0,
      "prods": {},
      "rock": 31
    },
    "cat": "01",
    "progress": lambda user: 1 if user['xp']/100000 >= 64 else 0,
    "revdep": ["01016"],
    "tags": {'*': 1},
  },
  "01018": {
    "awards": {
      "gold": 0,
      "prods": {},
      "rock": 33
    },
    "cat": "01",
    "progress": lambda user: 1 if user['xp']/100000 >= 69 else 0,
    "revdep": ["01017"],
    "tags": {'*': 1},
  },
  "01019": {
    "awards": {
      "gold": 0,
      "prods": {},
      "rock": 35
    },
    "cat": "01",
    "progress": lambda user: 1 if user['xp']/100000 >= 74 else 0,
    "revdep": ["01018"],
    "tags": {'*': 1},
  },
  "01020": {
    "awards": {
      "gold": 0,
      "prods": {},
      "rock": 37
    },
    "cat": "01",
    "progress": lambda user: 1 if user['xp']/100000 >= 79 else 0,
    "revdep": ["01019"],
    "tags": {'*': 1},
  },
  "02001": {
    "awards": {
      "gold": 1000,
      "xp": 6,
      "prods": {},
      "rock": 0
    },
    "cat": "02",
    "progress": lambda user: 1 if '010101' in user['batts'] else 0,
    "tags": {'*': 1}
  },
  "02002": {
    "awards": {
      "gold": 2000,
      "xp": 6,
      "prods": {
        "03001": 10,
        },
      "rock": 0
    },
    "cat": "02",
    "progress": lambda user: 1 if '010105' in user['batts'] else 0,
    "revdep": ["02001"],
    "tags": {'*': 1},
  },
  "02003": {
    "awards": {
      "gold": 35000,
      "xp": 6,
      "prods": {
        "03001": 10,
      },
      "rock": 0
    },
    "cat": "02",
    "progress": lambda user: 1 if '010107' in user['batts'] else 0,
    "revdep": ["02002"],
    "tags": {'*': 1}
  },
  "02004": {
    "awards": {
      "gold": 5000,
      "xp": 6,
      "prods": {
        "03003": 10
      },
      "rock": 0
    },
    "cat": "02",
    "progress": lambda user: 1 if '010203' in user['batts'] else 0,
    "revdep": ["02003"],
    "tags": {'*': 1}
  },
  "02005": {
    "awards": {
      "gold": 0,
      "xp": 6,
      "prods": {
        "03003": 2
      },
      "rock": 0
    },
    "cat": "02",
    "progress": lambda user: 1 if '010307' in user['batts'] else 0,
    "revdep": ["02004"],
    "tags": {'*': 1}
  },
  "02006": {
    "awards": {
      "gold": 0,
      "xp": 6,
      "prods": {
        "03003": 2
      },
      "rock": 0
    },
    "cat": "02",
    "progress": lambda user: 1 if '010407' in user['batts'] else 0,
    "revdep": ["02005"],
    "tags": {'*': 1},
  },
  "02007": {
    "awards": {
      "gold": 0,
      "xp": 6,
      "prods": {
        "03003": 2
      },
      "rock": 0
    },
    "cat": "02",
    "progress": lambda user: 1 if '010507' in user['batts'] else 0,
    "revdep": ["02006"],
    "tags": {'*': 1},
  },
  "02008": {
    "awards": {
      "gold": 0,
      "xp": 6,
      "prods": {},
      "rock": 29
    },
    "cat": "02",
    "progress": lambda user: 1 if '010607' in user['batts'] else 0,
    "revdep": ["02007"],
    "tags": {'*': 1},
  },
  "02009": {
    "awards": {
      "gold": 0,
      "xp": 6,
      "prods": {},
      "rock": 31
    },
    "cat": "02",
    "progress": lambda user: 1 if '010707' in user['batts'] else 0,
    "revdep": ["02008"],
    "tags": {'*': 1}
  },
  "02010": {
    "awards": {
      "gold": 0,
      "xp": 6,
      "prods": {},
      "rock": 33
    },
    "cat": "02",
    "progress": lambda user: 1 if '010807' in user['batts'] else 0,
    "revdep": ["02009"],
    "tags": {'*': 1},
  },
  "02011": {
    "awards": {
      "gold": 0,
      "prods": {},
      "rock": 35
    },
    "cat": "02",
    "progress": lambda user: 1 if '010907' in user['batts'] else 0,
    "revdep": ["02010"],
    "tags": {'*': 1}
  },
  "02012": {
    "awards": {
      "gold": 0,
      "prods": {},
      "rock": 37
    },
    "cat": "02",
    "progress": lambda user: 1 if '011007' in user['batts'] else 0,
    "revdep": ["02011"],
    "tags": {'*': 1},
  },
  "03001": {
    "awards": {
      "gold": 500,
      "xp": 6,
      "prods": {},
      "rock": 0
    },
    "cat": "03",
    "progress": lambda user: 1 if any(h['color'] > 0 for h in user['heros'].values()) else 0,
    "revdep": ["01002"],
    "tags": {'*': 1},
  },
  "03002": {
    "awards": {
      "gold": 1000,
      "xp": 6,
      "prods": {},
      "rock": 0
    },
    "cat": "03",
    # "progress": lambda user: 2 if any(h['color'] > 0 for h in user['heros'].values()) else 0,
    "progress": lambda user: 1 if len([h['color'] for h in user['heros'].values() if h['color']>0]) > 1 else 0,
    "revdep": ["01005"],
    "tags": {'*': 1},
  },
  "03003": {
    "awards": {
      "gold": 1500,
      "xp": 6,
      "prods": {},
      "rock": 0
    },
    "cat": "03",
    "progress": lambda user: 1 if any(h['star'] > 0 for h in user['heros'].values()) else 0,
    "revdep": ["01006"],
    "tags": {'*': 1},
  },
  "03004": {
    "awards": {
      "gold": 2000,
      "xp": 6,
      "prods": {},
      "rock": 0
    },
    "cat": "03",
    "progress": lambda user: 1 if len([h['star'] for h in user['heros'].values() if h['star']>0]) > 1 else 0,
    "revdep": ["01007"],
    "tags": {'*': 1},
  },
  "03005": {
    "awards": {
      "gold": 2500,
      "xp": 6,
      "prods": {},
      "rock": 0
    },
    "cat": "03",
    "progress": lambda user: 1 if len(user['heros'].keys()) >= 5 else 0,
    "revdep": ["01008"],
    "tags": {'*': 1},
  },
  "03006": {
    "awards": {
      "gold": 3000,
      "xp": 6,
      "prods": {},
      "rock": 0
    },
    "cat": "03",
    "progress": lambda user: 1 if len([h for h in user['heros'].values() if h['xp'] / 100000 >= 29]) >= 1 else 0,
    "revdep": ["01009"],
    "tags": {'*': 1},
  },
  "03007": {
    "awards": {
      "gold": 3500,
      "xp": 6,
      "prods": {},
      "rock": 0
    },
    "cat": "03",
    "progress": lambda user: 1 if len([h for h in user['heros'].values() if h['xp'] / 100000 >= 34]) >= 2 else 0,
    "revdep": ["01010"],
    "tags": {'*': 1},
  },
  "03008": {
    "awards": {
      "gold": 4000,
      "xp": 6,
      "prods": {},
      "rock": 0
    },
    "cat": "03",
    "progress": lambda user: 1 if len([h for h in user['heros'].values() if h['xp'] / 100000 >= 39]) >= 3 else 0,
    "revdep": ["01011"],
    "tags": {'*': 1},
  },
  "03009": {
    "awards": {
      "gold": 4500,
      "xp": 6,
      "prods": {},
      "rock": 0
    },
    "cat": "03",
    "progress": lambda user: 1 if len([h for h in user['heros'].values() if h['xp'] / 100000 >= 44]) >= 4 else 0,
    "revdep": ["01012"],
    "tags": {'*': 1},
  },
  "03010": {
    "awards": {
      "gold": 5000,
      "prods": {},
      "rock": 0
    },
    "cat": "03",
    "progress": lambda user: 1 if len([h for h in user['heros'].values() if h['xp'] / 100000 >= 49]) >= 5 else 0,
    "revdep": ["01013"],
    "tags": {'*': 1},
  }
}
TASKCAT = {
  "01": [
    "01001",
    "01002",
    "01003",
    "01004",
    "01005",
    "01006",
    "01007",
    "01008",
    "01009",
    "01010",
    "01011",
    "01012",
    "01013",
    "01014",
    "01015",
    "01016",
    "01017",
    "01018",
    "01019",
    "01020"
  ],
  "02": [
    "02001",
    "02002",
    "02003",
    "02004",
    "02005",
    "02006",
    "02007",
    "02008",
    "02009",
    "02010",
    "02011",
    "02012"
  ],
  "03": [
    "03001",
    "03002",
    "03003",
    "03004",
    "03005",
    "03006",
    "03007",
    "03008",
    "03009",
    "03010"
  ]
}
HEROCOLOR = [
  {
    "gold": 0
  },
  {
    "gold": 0
  },
  {
    "gold": 0
  },
  {
    "gold": 0
  },
  {
    "gold": 0
  },
  {
    "gold": 0
  },
  {
    "gold": 0
  },
  {
    "gold": 0
  },
  {
    "gold": 0
  },
  {
    "gold": 0
  }
]
HPBUY = [
  0, 50, 120, 
  1, 50, 120, 
  2, 100, 120, 
  3, 100, 120, 
  4, 100, 120, 
  5, 100, 120, 
  6, 150, 120, 
  7, 150, 120, 
  8, 150, 120, 
  9, 150, 120, 
  10, 150, 120, 
  11, 150, 120, 
  12, 150, 120, 
  13, 150, 120, 
  14, 150, 120, 
  15, 200, 120, 
  16, 200, 120, 
  17, 200, 120, 
  18, 200, 120, 
  19, 200, 120, 
  20, 200, 120, 
  21, 300, 120, 
  22, 300, 120, 
  23, 300, 120, 
  24, 300, 120, 
  25, 300, 120, 
  26, 300, 120, 
  27, 300, 120, 
  28, 300, 120, 
  29, 300, 120, 
  30, 500, 120, 
  31, 500, 120, 
  32, 500, 120, 
  33, 500, 120, 
  34, 500, 120, 
  35, 500, 120, 
  36, 500, 120, 
  37, 500, 120, 
  38, 500, 120, 
  39, 500, 120, 
  40, 500, 120, 
  41, 500, 120, 
  42, 500, 120, 
  43, 500, 120, 
  44, 500, 120, 
  45, 500, 120, 
  46, 500, 120, 
  47, 500, 120, 
  48, 500, 120, 
  49, 500, 120, 
  50, 800, 120, 
  51, 800, 120, 
  52, 800, 120, 
  53, 800, 120, 
  54, 800, 120, 
  55, 800, 120, 
  56, 800, 120, 
  57, 800, 120, 
  58, 800, 120, 
  59, 800, 120, 
  60, 800, 120, 
  61, 800, 120, 
  62, 800, 120, 
  63, 800, 120, 
  64, 800, 120, 
  65, 800, 120, 
  66, 800, 120, 
  67, 800, 120, 
  68, 800, 120, 
  69, 800, 120, 
  70, 800, 120, 
  71, 800, 120, 
  72, 800, 120, 
  73, 800, 120, 
  74, 800, 120, 
  75, 800, 120, 
  76, 800, 120, 
  77, 800, 120, 
  78, 800, 120, 
  79, 800, 120, 
  80, 800, 120, 
  81, 800, 120, 
  82, 800, 120, 
  83, 800, 120, 
  84, 800, 120, 
  85, 800, 120, 
  86, 800, 120, 
  87, 800, 120, 
  88, 800, 120, 
  89, 800, 120, 
  90, 800, 120, 
  91, 800, 120, 
  92, 800, 120, 
  93, 800, 120, 
  94, 800, 120, 
  95, 800, 120, 
  96, 800, 120, 
  97, 800, 120, 
  98, 800, 120, 
  99, 800, 120, 
  100, 1000, 120, 
  101, 1000, 120, 
  102, 1000, 120, 
  103, 1000, 120, 
  104, 1000, 120, 
  105, 1000, 120, 
  106, 1000, 120, 
  107, 1000, 120, 
  108, 1000, 120, 
  109, 1000, 120, 
  110, 1000, 120, 
  111, 1000, 120, 
  112, 1000, 120, 
  113, 1000, 120, 
  114, 1000, 120, 
  115, 1000, 120, 
  116, 1000, 120, 
  117, 1000, 120, 
  118, 1000, 120, 
  119, 1000, 120, 
  120, 1000, 120, 
  121, 1000, 120, 
  122, 1000, 120, 
  123, 1000, 120, 
  124, 1000, 120, 
  125, 1000, 120, 
  126, 1000, 120, 
  127, 1000, 120, 
  128, 1000, 120, 
  129, 1000, 120, 
  130, 1000, 120, 
  131, 1000, 120, 
  132, 1000, 120, 
  133, 1000, 120, 
  134, 1000, 120, 
  135, 1000, 120, 
  136, 1000, 120, 
  137, 1000, 120, 
  138, 1000, 120, 
  139, 1000, 120, 
  140, 1000, 120, 
  141, 1000, 120, 
  142, 1000, 120, 
  143, 1000, 120, 
  144, 1000, 120, 
  145, 1000, 120, 
  146, 1000, 120, 
  147, 1000, 120, 
  148, 1000, 120, 
  149, 1000, 120, 
  150, 1000, 120, 
]
GOLDBUY = [
  0, 20, 23850, 
  1, 20, 23760, 
  2, 20, 23980, 
  3, 20, 24000, 
  4, 20, 24150, 
  5, 40, 26120, 
  6, 40, 26130, 
  7, 40, 26140, 
  8, 40, 26150, 
  9, 40, 26160, 
  10, 40, 26170, 
  11, 40, 26180, 
  12, 40, 26190, 
  13, 40, 26200, 
  14, 40, 26210, 
  15, 40, 26220, 
  16, 40, 26230, 
  17, 40, 26240, 
  18, 40, 26250, 
  19, 40, 26260, 
  20, 40, 26270, 
  21, 60, 31030, 
  22, 60, 31040, 
  23, 60, 31050, 
  24, 60, 31060, 
  25, 60, 31070, 
  26, 60, 31080, 
  27, 60, 31090, 
  28, 60, 31100, 
  29, 60, 31110, 
  30, 60, 31120, 
  31, 80, 35320, 
  32, 80, 35330, 
  33, 80, 35340, 
  34, 80, 35350, 
  35, 80, 35360, 
  36, 80, 35370, 
  37, 80, 35380, 
  38, 80, 35390, 
  39, 80, 35400, 
  40, 80, 35410, 
  41, 80, 35420, 
  42, 80, 35430, 
  43, 80, 35440, 
  44, 80, 35450, 
  45, 80, 35460, 
  46, 80, 35470, 
  47, 80, 35480, 
  48, 80, 35490, 
  49, 80, 35500, 
  50, 80, 35510, 
  51, 100, 38130, 
  52, 100, 38140, 
  53, 100, 38150, 
  54, 100, 38160, 
  55, 100, 38170, 
  56, 100, 38180, 
  57, 100, 38190, 
  58, 100, 38200, 
  59, 100, 38210, 
  60, 100, 38220, 
  61, 100, 38230, 
  62, 100, 38240, 
  63, 100, 38250, 
  64, 100, 38260, 
  65, 100, 38270, 
  66, 100, 38280, 
  67, 100, 38290, 
  68, 100, 38300, 
  69, 100, 38310, 
  70, 100, 38320, 
  71, 100, 38330, 
  72, 100, 38340, 
  73, 100, 38350, 
  74, 100, 38360, 
  75, 100, 38370, 
  76, 100, 38380, 
  77, 100, 38390, 
  78, 100, 38400, 
  79, 100, 38410, 
  80, 100, 38420, 
  81, 100, 38430, 
  82, 100, 38440, 
  83, 100, 38450, 
  84, 100, 38460, 
  85, 100, 38470, 
  86, 100, 38480, 
  87, 100, 38490, 
  88, 100, 38500, 
  89, 100, 38510, 
  90, 100, 38520, 
  91, 110, 39110, 
  92, 110, 39120, 
  93, 110, 39130, 
  94, 110, 39140, 
  95, 110, 39150, 
  96, 110, 39160, 
  97, 110, 39170, 
  98, 110, 39180, 
  99, 110, 39190, 
  100, 120, 39888, 
]
BOOKBUY = [
  0, 20, 50, 
  1, 20, 50, 
  2, 50, 50, 
  3, 50, 50, 
  4, 50, 50, 
  5, 50, 50, 
  6, 50, 50, 
  7, 50, 50, 
  8, 50, 50, 
  9, 50, 50, 
  10, 50, 50, 
  11, 70, 50, 
  12, 70, 50, 
  13, 70, 50, 
  14, 70, 50, 
  15, 70, 50, 
  16, 70, 50, 
  17, 90, 50, 
  18, 90, 50, 
  19, 90, 50, 
  20, 100, 50, 
]
SPBUY = [
  0, 10, 10,
  1, 20, 10,
  2, 20, 10,
  3, 40, 10,
  4, 40, 10,
  5, 100, 10,
  6, 100, 10,
  7, 100, 10,
  8, 100, 10,
  9, 100, 10,
  10, 100, 10,
  11, 100, 10,
  12, 100, 10,
  13, 100, 10,
  14, 100, 10,
  15, 100, 10,
  16, 100, 10,
  17, 90, 10,
  18, 90, 10,
  19, 90, 10,
  20, 100, 10,
]
PEARLBUY = [
  0, 50, 10, 
  1, 50, 10, 
  2, 100, 10, 
  3, 150, 10, 
  4, 200, 10, 
  5, 250, 10, 
  6, 300, 10, 
  7, 350, 10, 
  8, 400, 10, 
  9, 450, 10, 
  10, 500, 10, 
  11, 550, 10, 
  12, 600, 10, 
  13, 650, 10, 
  14, 700, 10, 
  15, 750, 10, 
  16, 800, 10, 
  17, 850, 10, 
  18, 900, 10, 
  19, 950, 10, 
  20, 1000, 10, 
]
BATTBUY = [
  0, 20, 3, 
  1, 50, 3, 
  2, 70, 3, 
  3, 70, 3, 
  4, 70, 3, 
  5, 70, 3, 
  6, 70, 3, 
  7, 70, 3, 
  8, 90, 3, 
  9, 90, 3, 
  10, 90, 3, 
  11, 100, 3, 
  12, 100, 3, 
  13, 100, 3, 
  14, 100, 3, 
  15, 100, 3, 
  16, 100, 3, 
  17, 100, 3, 
  18, 100, 3, 
  19, 100, 3, 
  20, 100, 3, 
]
TAX = [
  10101, 300, 3000, 
  10102, 400, 3500, 
  10103, 500, 4000, 
  10104, 600, 4500, 
  10105, 700, 5000, 
  10106, 800, 5500, 
  10107, 900, 6000, 
  10108, 1000, 6500, 
  10109, 1100, 7000, 
  10110, 1200, 7500, 
  10111, 1300, 8000, 
  10112, 1400, 8500, 
  10113, 1500, 9000, 
  10114, 1600, 9500, 
  10115, 1700, 10000, 
  10116, 1800, 10500, 
  10201, 1900, 11000, 
  10202, 2000, 11500, 
  10203, 2100, 12000, 
  10204, 2200, 12500, 
  10205, 2300, 13000, 
  10206, 2400, 13500, 
  10207, 2500, 14000, 
  10208, 2600, 14500, 
  10209, 2700, 15000, 
  10210, 2800, 15500, 
  10211, 2900, 16000, 
  10212, 3000, 16500, 
  10213, 3100, 17000, 
  10214, 3200, 17500, 
  10215, 3300, 18000, 
  10216, 3400, 18500, 
  10301, 3500, 19000, 
  10302, 3600, 19500, 
  10303, 3700, 20000, 
  10304, 3800, 20500, 
  10305, 3900, 21000, 
  10306, 4000, 21500, 
  10307, 4100, 22000, 
  10308, 4200, 22500, 
  10309, 4300, 23000, 
  10310, 4400, 23500, 
  10311, 4500, 24000, 
  10312, 4600, 24500, 
  10313, 4700, 25000, 
  10314, 4800, 25500, 
  10315, 4900, 26000, 
  10316, 5000, 26500, 
  10401, 5100, 27000, 
  10402, 5200, 27500, 
  10403, 5300, 28000, 
  10404, 5400, 28500, 
  10405, 5500, 29000, 
  10406, 5600, 29500, 
  10407, 5700, 30000, 
  10408, 5800, 30500, 
  10409, 5900, 31000, 
  10410, 6000, 31500, 
  10411, 6100, 32000, 
  10412, 6200, 32500, 
  10413, 6300, 33000, 
  10414, 6400, 33500, 
  10415, 6500, 34000, 
  10416, 6600, 34500, 
  10501, 6700, 35000, 
  10502, 6800, 35500, 
  10503, 6900, 36000, 
  10504, 7000, 36500, 
  10505, 7100, 37000, 
  10506, 7200, 37500, 
  10507, 7300, 38000, 
  10508, 7400, 38500, 
  10509, 7500, 39000, 
  10510, 7600, 39500, 
  10511, 7700, 40000, 
  10512, 7800, 40500, 
  10513, 7900, 41000, 
  10514, 8000, 41500, 
  10515, 8100, 42000, 
  10516, 8200, 42500, 
  10601, 8300, 43000, 
  10602, 8400, 43500, 
  10603, 8500, 44000, 
  10604, 8600, 44500, 
  10605, 8700, 45000, 
  10606, 8800, 45500, 
  10607, 8900, 46000, 
  10608, 9000, 46500, 
  10609, 9100, 47000, 
  10610, 9200, 47500, 
  10611, 9300, 48000, 
  10612, 9400, 48500, 
  10613, 9500, 49000, 
  10614, 9600, 49500, 
  10615, 9700, 50000, 
  10616, 9800, 50500, 
  10701, 9900, 51000, 
  10702, 10000, 51500, 
  10703, 10100, 52000, 
  10704, 10200, 52500, 
  10705, 10300, 53000, 
  10706, 10400, 53500, 
  10707, 10500, 54000, 
  10708, 10600, 54500, 
  10709, 10700, 55000, 
  10710, 10800, 55500, 
  10711, 10900, 56000, 
  10712, 11000, 56500, 
  10713, 11100, 57000, 
  10714, 11200, 57500, 
  10715, 11300, 58000, 
  10716, 11400, 58500, 
  10801, 11500, 59000, 
  10802, 11600, 59500, 
  10803, 11700, 60000, 
  10804, 11800, 60500, 
  10805, 11900, 61000, 
  10806, 12000, 61500, 
  10807, 12100, 62000, 
  10808, 12200, 62500, 
  10809, 12300, 63000, 
  10810, 12400, 63500, 
  10811, 12500, 64000, 
  10812, 12600, 64500, 
  10813, 12700, 65000, 
  10814, 12800, 65500, 
  10815, 12900, 66000, 
  10816, 13000, 66500, 
  10901, 13100, 67000, 
  10902, 13200, 67500, 
  10903, 13300, 68000, 
  10904, 13400, 68500, 
  10905, 13500, 69000, 
  10906, 13600, 69500, 
  10907, 13700, 70000, 
  10908, 13800, 70500, 
  10909, 13900, 71000, 
  10910, 14000, 71500, 
  10911, 14100, 72000, 
  10912, 14200, 72500, 
  10913, 14300, 73000, 
  10914, 14400, 73500, 
  10915, 14500, 74000, 
  10916, 14600, 74500, 
  11001, 14700, 75000, 
  11002, 14800, 75500, 
  11003, 14900, 76000, 
  11004, 15000, 76500, 
  11005, 15100, 77000, 
  11006, 15200, 77500, 
  11007, 15300, 78000, 
  11008, 15400, 78500, 
  11009, 15500, 79000, 
  11010, 15600, 79500, 
  11011, 15700, 80000, 
  11012, 15800, 80500, 
  11013, 15900, 81000, 
  11014, 16000, 81500, 
  11015, 16100, 82000, 
  11016, 16200, 82500, 
]
BLACKMARKET = [
  0, 0, 100, 0, 0, 3024, 5, 0, 500, 
  0, 0, 100, 1, 0, 1103, 1, 0, 34, 
  0, 0, 100, 2, 0, 1510, 1, 0, 338, 
  0, 0, 100, 3, 0, 1123, 1, 0, 38, 
  0, 0, 100, 4, 0, 1310, 1, 0, 278, 
  0, 0, 100, 5, 0, 1211, 1, 0, 50, 
  0, 0, 100, 6, 0, 3008, 5, 0, 500, 
  0, 0, 100, 7, 0, 2004, 1, 0, 20, 
  0, 0, 100, 8, 0, 2011, 1, 0, 30, 
  0, 0, 100, 9, 0, 2008, 1, 0, 30, 
  0, 0, 100, 10, 0, 2002, 1, 0, 20, 
  0, 0, 100, 11, 0, 1511, 1, 0, 38, 
  0, 0, 100, 0, 1, 3024, 5, 0, 500, 
  0, 0, 100, 1, 1, 1004, 1, 0, 20, 
  0, 0, 100, 2, 1, 3024, 5, 0, 500, 
  0, 0, 100, 3, 1, 1604, 1, 0, 2450, 
  0, 0, 100, 4, 1, 1107, 1, 0, 43, 
  0, 0, 100, 5, 1, 1602, 1, 0, 50, 
  0, 0, 100, 6, 1, 2015, 1, 0, 30, 
  0, 0, 100, 7, 1, 1407, 1, 0, 43, 
  0, 0, 100, 8, 1, 1502, 1, 0, 350, 
  0, 0, 100, 9, 1, 1403, 1, 0, 50, 
  0, 0, 100, 10, 1, 2010, 1, 0, 30, 
  0, 0, 100, 11, 1, 2018, 1, 0, 20, 
  0, 0, 100, 0, 2, 3024, 5, 0, 500, 
  0, 0, 100, 1, 2, 3027, 5, 0, 1750, 
  0, 0, 100, 2, 2, 1411, 1, 0, 38, 
  0, 0, 100, 3, 2, 2006, 1, 0, 20, 
  0, 0, 100, 4, 2, 1506, 1, 0, 343, 
  0, 0, 100, 5, 2, 2005, 1, 0, 20, 
  0, 0, 100, 6, 2, 1303, 1, 0, 50, 
  0, 0, 100, 7, 2, 1207, 1, 0, 43, 
  0, 0, 100, 8, 2, 1006, 1, 0, 30, 
  0, 0, 100, 9, 2, 2016, 1, 0, 30, 
  0, 0, 100, 10, 2, 1503, 1, 0, 50, 
  0, 0, 100, 11, 2, 1111, 1, 0, 43, 
  0, 0, 100, 0, 3, 3024, 5, 0, 500, 
  0, 0, 100, 1, 3, 2020, 1, 0, 20, 
  0, 0, 100, 2, 3, 2014, 1, 0, 20, 
  0, 0, 100, 3, 3, 1121, 1, 0, 1138, 
  0, 0, 100, 4, 3, 2003, 1, 0, 20, 
  0, 0, 100, 5, 3, 2017, 1, 0, 30, 
  0, 0, 100, 6, 3, 1209, 1, 0, 1950, 
  0, 0, 100, 7, 3, 1406, 1, 0, 283, 
  0, 0, 100, 8, 3, 2001, 1, 0, 20, 
  0, 0, 100, 9, 3, 2013, 1, 0, 20, 
  0, 0, 100, 10, 3, 2019, 1, 0, 20, 
  0, 0, 100, 11, 3, 1609, 1, 0, 43, 
  0, 0, 100, 0, 4, 3024, 5, 0, 500, 
  0, 0, 100, 1, 4, 1311, 1, 0, 38, 
  0, 0, 100, 2, 4, 1210, 1, 0, 350, 
  0, 0, 100, 3, 4, 1005, 1, 0, 30, 
  0, 0, 100, 4, 4, 2021, 1, 0, 20, 
  0, 0, 100, 5, 4, 2007, 1, 0, 30, 
  0, 0, 100, 6, 4, 1307, 1, 0, 43, 
  0, 0, 100, 7, 4, 2009, 1, 0, 30, 
  0, 0, 100, 8, 4, 1203, 1, 0, 38, 
  0, 0, 100, 9, 4, 1122, 1, 0, 338, 
  0, 0, 100, 10, 4, 1306, 1, 0, 283, 
  0, 0, 100, 11, 4, 3023, 5, 0, 500, 
  0, 0, 100, 0, 5, 3024, 5, 0, 500, 
  0, 0, 100, 1, 5, 2012, 1, 0, 20, 
  0, 0, 100, 2, 5, 1507, 1, 0, 43, 
  0, 0, 100, 3, 5, 1115, 1, 0, 34, 
  0, 0, 100, 4, 5, 1114, 1, 0, 334, 
  0, 0, 100, 5, 5, 1202, 1, 0, 338, 
  0, 0, 100, 6, 5, 1612, 1, 0, 60, 
  0, 0, 100, 7, 5, 1119, 1, 0, 38, 
  0, 0, 100, 8, 5, 2004, 1, 0, 20, 
  0, 0, 100, 9, 5, 1610, 1, 0, 360, 
  0, 0, 100, 10, 5, 1507, 1, 0, 43, 
  0, 0, 100, 11, 5, 1503, 1, 0, 50, 
  0, 0, 100, 0, 6, 3024, 5, 0, 500, 
  0, 0, 100, 1, 6, 3027, 5, 0, 1750, 
  0, 0, 100, 2, 6, 2017, 1, 0, 30, 
  0, 0, 100, 3, 6, 1602, 1, 0, 50, 
  0, 0, 100, 4, 6, 1123, 1, 0, 38, 
  0, 0, 100, 5, 6, 2016, 1, 0, 30, 
  0, 0, 100, 6, 6, 1611, 1, 0, 343, 
  0, 0, 100, 7, 6, 1311, 1, 0, 38, 
  0, 0, 100, 8, 6, 1118, 1, 0, 338, 
  0, 0, 100, 9, 6, 1410, 1, 0, 278, 
  0, 0, 100, 10, 6, 1402, 1, 0, 290, 
  0, 0, 100, 11, 6, 1601, 1, 0, 350, 
  0, 0, 100, 0, 7, 3024, 5, 0, 500, 
  0, 0, 100, 1, 7, 1307, 1, 0, 43, 
  0, 0, 100, 2, 7, 1609, 1, 0, 43, 
  0, 0, 100, 3, 7, 1110, 1, 0, 343, 
  0, 0, 100, 4, 7, 1303, 1, 0, 50, 
  0, 0, 100, 5, 7, 1106, 1, 0, 343, 
  0, 0, 100, 6, 7, 1302, 1, 0, 290, 
  0, 0, 100, 7, 7, 2015, 1, 0, 30, 
  0, 0, 100, 8, 7, 1206, 1, 0, 343, 
  0, 0, 100, 9, 7, 1107, 1, 0, 43, 
  0, 0, 100, 10, 7, 1305, 1, 0, 2183, 
  0, 0, 100, 11, 7, 1006, 1, 0, 30, 
  0, 0, 100, 0, 8, 3024, 5, 0, 500, 
  0, 0, 100, 1, 8, 3027, 5, 0, 1750, 
  0, 0, 100, 2, 8, 1102, 1, 0, 334, 
  0, 0, 100, 3, 8, 1106, 1, 0, 343, 
  0, 0, 100, 4, 8, 2011, 1, 0, 30, 
  0, 0, 100, 5, 8, 1005, 1, 0, 30, 
  0, 0, 100, 6, 8, 2006, 1, 0, 20, 
  0, 0, 100, 7, 8, 1511, 1, 0, 38, 
  0, 0, 100, 8, 8, 1411, 1, 0, 38, 
  0, 0, 100, 9, 8, 1506, 1, 0, 343, 
  0, 0, 100, 10, 8, 2019, 1, 0, 20, 
  0, 0, 100, 11, 8, 1118, 1, 0, 338, 
  0, 0, 100, 0, 9, 3024, 5, 0, 500, 
  0, 0, 100, 1, 9, 3027, 5, 0, 1750, 
  0, 0, 100, 2, 9, 1119, 1, 0, 38, 
  0, 0, 100, 3, 9, 2020, 1, 0, 20, 
  0, 0, 100, 4, 9, 1004, 1, 0, 20, 
  0, 0, 100, 5, 9, 1201, 1, 0, 2438, 
  0, 0, 100, 6, 9, 2012, 1, 0, 20, 
  0, 0, 100, 7, 9, 2021, 1, 0, 20, 
  0, 0, 100, 8, 9, 1612, 1, 0, 60, 
  0, 0, 100, 9, 9, 1207, 1, 0, 43, 
  0, 0, 100, 10, 9, 2010, 1, 0, 30, 
  0, 0, 100, 11, 9, 1103, 1, 0, 34, 
  0, 0, 100, 0, 10, 3024, 5, 0, 500, 
  0, 0, 100, 1, 10, 3027, 5, 0, 1750, 
  0, 0, 100, 2, 10, 1402, 1, 0, 290, 
  0, 0, 100, 3, 10, 2014, 1, 0, 20, 
  0, 0, 100, 4, 10, 1608, 1, 0, 2443, 
  0, 0, 100, 5, 10, 1502, 1, 0, 350, 
  0, 0, 100, 6, 10, 1310, 1, 0, 278, 
  0, 0, 100, 7, 10, 2008, 1, 0, 30, 
  0, 0, 100, 8, 10, 1115, 1, 0, 34, 
  0, 0, 100, 9, 10, 1117, 1, 0, 1138, 
  0, 0, 100, 10, 10, 2003, 1, 0, 20, 
  0, 0, 100, 11, 10, 2018, 1, 0, 20, 
  0, 0, 100, 0, 11, 3024, 5, 0, 500, 
  0, 0, 100, 1, 11, 3027, 5, 0, 1750, 
  0, 0, 100, 2, 11, 1601, 1, 0, 350, 
  0, 0, 100, 3, 11, 2002, 1, 0, 20, 
  0, 0, 100, 4, 11, 1403, 1, 0, 50, 
  0, 0, 100, 5, 11, 2007, 1, 0, 30, 
  0, 0, 100, 6, 11, 1302, 1, 0, 290, 
  0, 0, 100, 7, 11, 2005, 1, 0, 20, 
  0, 0, 100, 8, 11, 1211, 1, 0, 50, 
  0, 0, 100, 9, 11, 1111, 1, 0, 43, 
  0, 0, 100, 10, 11, 1122, 1, 0, 338, 
  0, 0, 100, 11, 11, 1406, 1, 0, 283, 
  1, 0, 100, 0, 0, 3024, 5, 0, 500, 
  1, 0, 100, 1, 0, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 0, 2009, 1, 0, 30, 
  1, 0, 100, 3, 0, 1407, 1, 0, 43, 
  1, 0, 100, 4, 0, 3017, 5, 0, 500, 
  1, 0, 100, 5, 0, 2001, 1, 0, 20, 
  1, 0, 100, 6, 0, 2013, 1, 0, 20, 
  1, 0, 100, 7, 0, 1203, 1, 0, 38, 
  1, 0, 100, 8, 0, 2019, 1, 0, 20, 
  1, 0, 100, 9, 0, 1411, 1, 0, 38, 
  1, 0, 100, 10, 0, 1110, 1, 0, 343, 
  1, 0, 100, 11, 0, 3030, 5, 0, 500, 
  1, 0, 100, 0, 1, 3024, 5, 0, 500, 
  1, 0, 100, 1, 1, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 1, 1119, 1, 0, 38, 
  1, 0, 100, 3, 1, 1303, 1, 0, 50, 
  1, 0, 100, 4, 1, 1107, 1, 0, 43, 
  1, 0, 100, 5, 1, 2003, 1, 0, 20, 
  1, 0, 100, 6, 1, 1611, 1, 0, 343, 
  1, 0, 100, 7, 1, 1409, 1, 0, 1678, 
  1, 0, 100, 8, 1, 1005, 1, 0, 30, 
  1, 0, 100, 9, 1, 1407, 1, 0, 43, 
  1, 0, 100, 10, 1, 1004, 1, 0, 20, 
  1, 0, 100, 11, 1, 3017, 5, 0, 500, 
  1, 0, 100, 0, 2, 3024, 5, 0, 500, 
  1, 0, 100, 1, 2, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 2, 1609, 1, 0, 43, 
  1, 0, 100, 3, 2, 2006, 1, 0, 20, 
  1, 0, 100, 4, 2, 2013, 1, 0, 20, 
  1, 0, 100, 5, 2, 1211, 1, 0, 50, 
  1, 0, 100, 6, 2, 2015, 1, 0, 30, 
  1, 0, 100, 7, 2, 1306, 1, 0, 283, 
  1, 0, 100, 8, 2, 2021, 1, 0, 20, 
  1, 0, 100, 9, 2, 3008, 5, 0, 500, 
  1, 0, 100, 10, 2, 1115, 1, 0, 34, 
  1, 0, 100, 11, 2, 1206, 1, 0, 343, 
  1, 0, 100, 0, 3, 3024, 5, 0, 500, 
  1, 0, 100, 1, 3, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 3, 1509, 1, 0, 1938, 
  1, 0, 100, 3, 3, 1507, 1, 0, 43, 
  1, 0, 100, 4, 3, 1403, 1, 0, 50, 
  1, 0, 100, 5, 3, 1207, 1, 0, 43, 
  1, 0, 100, 6, 3, 1103, 1, 0, 34, 
  1, 0, 100, 7, 3, 2007, 1, 0, 30, 
  1, 0, 100, 8, 3, 2004, 1, 0, 20, 
  1, 0, 100, 9, 3, 1123, 1, 0, 38, 
  1, 0, 100, 10, 3, 1205, 1, 0, 2443, 
  1, 0, 100, 11, 3, 2009, 1, 0, 30, 
  1, 0, 100, 0, 4, 3024, 5, 0, 500, 
  1, 0, 100, 1, 4, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 4, 2002, 1, 0, 20, 
  1, 0, 100, 3, 4, 2010, 1, 0, 30, 
  1, 0, 100, 4, 4, 1610, 1, 0, 360, 
  1, 0, 100, 5, 4, 1307, 1, 0, 43, 
  1, 0, 100, 6, 4, 1203, 1, 0, 38, 
  1, 0, 100, 7, 4, 1602, 1, 0, 50, 
  1, 0, 100, 8, 4, 2011, 1, 0, 30, 
  1, 0, 100, 9, 4, 1102, 1, 0, 334, 
  1, 0, 100, 10, 4, 2017, 1, 0, 30, 
  1, 0, 100, 11, 4, 1612, 1, 0, 60, 
  1, 0, 100, 0, 5, 3024, 5, 0, 500, 
  1, 0, 100, 1, 5, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 5, 1503, 1, 0, 50, 
  1, 0, 100, 3, 5, 1111, 1, 0, 43, 
  1, 0, 100, 4, 5, 2001, 1, 0, 20, 
  1, 0, 100, 5, 5, 2018, 1, 0, 20, 
  1, 0, 100, 6, 5, 2014, 1, 0, 20, 
  1, 0, 100, 7, 5, 1311, 1, 0, 38, 
  1, 0, 100, 8, 5, 2008, 1, 0, 30, 
  1, 0, 100, 9, 5, 1006, 1, 0, 30, 
  1, 0, 100, 10, 5, 1510, 1, 0, 338, 
  1, 0, 100, 11, 5, 2012, 1, 0, 20, 
  1, 0, 100, 0, 6, 3024, 5, 0, 500, 
  1, 0, 100, 1, 6, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 6, 1511, 1, 0, 38, 
  1, 0, 100, 3, 6, 2005, 1, 0, 20, 
  1, 0, 100, 4, 6, 2016, 1, 0, 30, 
  1, 0, 100, 5, 6, 2020, 1, 0, 20, 
  1, 0, 100, 6, 6, 2017, 1, 0, 30, 
  1, 0, 100, 7, 6, 2003, 1, 0, 20, 
  1, 0, 100, 8, 6, 1311, 1, 0, 38, 
  1, 0, 100, 9, 6, 1411, 1, 0, 38, 
  1, 0, 100, 10, 6, 1403, 1, 0, 50, 
  1, 0, 100, 11, 6, 3014, 5, 0, 250, 
  1, 0, 100, 0, 7, 3024, 5, 0, 500, 
  1, 0, 100, 1, 7, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 7, 3023, 5, 0, 500, 
  1, 0, 100, 3, 7, 1210, 1, 0, 350, 
  1, 0, 100, 4, 7, 1114, 1, 0, 334, 
  1, 0, 100, 5, 7, 2011, 1, 0, 30, 
  1, 0, 100, 6, 7, 2014, 1, 0, 20, 
  1, 0, 100, 7, 7, 2018, 1, 0, 20, 
  1, 0, 100, 8, 7, 1211, 1, 0, 50, 
  1, 0, 100, 9, 7, 1303, 1, 0, 50, 
  1, 0, 100, 10, 7, 1207, 1, 0, 43, 
  1, 0, 100, 11, 7, 1410, 1, 0, 278, 
  1, 0, 100, 0, 8, 3024, 5, 0, 500, 
  1, 0, 100, 1, 8, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 8, 3030, 5, 0, 500, 
  1, 0, 100, 3, 8, 1602, 1, 0, 50, 
  1, 0, 100, 4, 8, 2019, 1, 0, 20, 
  1, 0, 100, 5, 8, 1202, 1, 0, 338, 
  1, 0, 100, 6, 8, 1612, 1, 0, 60, 
  1, 0, 100, 7, 8, 1004, 1, 0, 20, 
  1, 0, 100, 8, 8, 1106, 1, 0, 343, 
  1, 0, 100, 9, 8, 2009, 1, 0, 30, 
  1, 0, 100, 10, 8, 2020, 1, 0, 20, 
  1, 0, 100, 11, 8, 2016, 1, 0, 30, 
  1, 0, 100, 0, 9, 3024, 5, 0, 500, 
  1, 0, 100, 1, 9, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 9, 2007, 1, 0, 30, 
  1, 0, 100, 3, 9, 1202, 1, 0, 338, 
  1, 0, 100, 4, 9, 1123, 1, 0, 38, 
  1, 0, 100, 5, 9, 1107, 1, 0, 43, 
  1, 0, 100, 6, 9, 1307, 1, 0, 43, 
  1, 0, 100, 7, 9, 1306, 1, 0, 283, 
  1, 0, 100, 8, 9, 1006, 1, 0, 30, 
  1, 0, 100, 9, 9, 1005, 1, 0, 30, 
  1, 0, 100, 10, 9, 1503, 1, 0, 50, 
  1, 0, 100, 11, 9, 2006, 1, 0, 20, 
  1, 0, 100, 0, 10, 3024, 5, 0, 500, 
  1, 0, 100, 1, 10, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 10, 1210, 1, 0, 350, 
  1, 0, 100, 3, 10, 1410, 1, 0, 278, 
  1, 0, 100, 4, 10, 1103, 1, 0, 34, 
  1, 0, 100, 5, 10, 1119, 1, 0, 38, 
  1, 0, 100, 6, 10, 2012, 1, 0, 20, 
  1, 0, 100, 7, 10, 1511, 1, 0, 38, 
  1, 0, 100, 8, 10, 2001, 1, 0, 20, 
  1, 0, 100, 9, 10, 1110, 1, 0, 343, 
  1, 0, 100, 10, 10, 1502, 1, 0, 350, 
  1, 0, 100, 11, 10, 1302, 1, 0, 290, 
  1, 0, 100, 0, 11, 3024, 5, 0, 500, 
  1, 0, 100, 1, 11, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 11, 3024, 5, 0, 500, 
  1, 0, 100, 3, 11, 1610, 1, 0, 360, 
  1, 0, 100, 4, 11, 3023, 5, 0, 500, 
  1, 0, 100, 5, 11, 2005, 1, 0, 20, 
  1, 0, 100, 6, 11, 1203, 1, 0, 38, 
  1, 0, 100, 7, 11, 1114, 1, 0, 334, 
  1, 0, 100, 8, 11, 2002, 1, 0, 20, 
  1, 0, 100, 9, 11, 1510, 1, 0, 338, 
  1, 0, 100, 10, 11, 1310, 1, 0, 278, 
  1, 0, 100, 11, 11, 2015, 1, 0, 30, 
  2, 0, 100, 0, 0, 3024, 5, 0, 500, 
  2, 0, 100, 1, 0, 3027, 5, 0, 1750, 
  2, 0, 100, 2, 0, 1407, 1, 0, 43, 
  2, 0, 100, 3, 0, 1115, 1, 0, 34, 
  2, 0, 100, 4, 0, 1111, 1, 0, 43, 
  2, 0, 100, 5, 0, 1406, 1, 0, 283, 
  2, 0, 100, 6, 0, 1301, 1, 0, 2190, 
  2, 0, 100, 7, 0, 1102, 1, 0, 334, 
  2, 0, 100, 8, 0, 2004, 1, 0, 20, 
  2, 0, 100, 9, 0, 1609, 1, 0, 43, 
  2, 0, 100, 10, 0, 2010, 1, 0, 30, 
  2, 0, 100, 11, 0, 1501, 1, 0, 1950, 
  2, 0, 100, 0, 1, 3024, 5, 0, 500, 
  2, 0, 100, 1, 1, 3027, 5, 0, 1750, 
  2, 0, 100, 2, 1, 2021, 1, 0, 20, 
  2, 0, 100, 3, 1, 2008, 1, 0, 30, 
  2, 0, 100, 4, 1, 1507, 1, 0, 43, 
  2, 0, 100, 5, 1, 2013, 1, 0, 20, 
  2, 0, 100, 6, 1, 2003, 1, 0, 20, 
  2, 0, 100, 7, 1, 1511, 1, 0, 38, 
  2, 0, 100, 8, 1, 1203, 1, 0, 38, 
  2, 0, 100, 9, 1, 1107, 1, 0, 43, 
  2, 0, 100, 10, 1, 1122, 1, 0, 338, 
  2, 0, 100, 11, 1, 3008, 5, 0, 500, 
  2, 0, 100, 0, 2, 3024, 5, 0, 500, 
  2, 0, 100, 1, 2, 3027, 5, 0, 1750, 
  2, 0, 100, 2, 2, 1507, 1, 0, 43, 
  2, 0, 100, 3, 2, 1402, 1, 0, 290, 
  2, 0, 100, 4, 2, 3017, 5, 0, 500, 
  2, 0, 100, 5, 2, 1005, 1, 0, 30, 
  2, 0, 100, 6, 2, 2021, 1, 0, 20, 
  2, 0, 100, 7, 2, 1611, 1, 0, 343, 
  2, 0, 100, 8, 2, 2006, 1, 0, 20, 
  2, 0, 100, 9, 2, 3030, 5, 0, 500, 
  2, 0, 100, 10, 2, 3007, 5, 0, 250, 
  2, 0, 100, 11, 2, 3024, 5, 0, 500, 
  2, 0, 100, 0, 3, 3024, 5, 0, 500, 
  2, 0, 100, 1, 3, 2019, 1, 0, 20, 
  2, 0, 100, 2, 3, 1503, 1, 0, 50, 
  2, 0, 100, 3, 3, 1311, 1, 0, 38, 
  2, 0, 100, 4, 3, 1403, 1, 0, 50, 
  2, 0, 100, 5, 3, 1506, 1, 0, 343, 
  2, 0, 100, 6, 3, 1303, 1, 0, 50, 
  2, 0, 100, 7, 3, 1103, 1, 0, 34, 
  2, 0, 100, 8, 3, 1118, 1, 0, 338, 
  2, 0, 100, 9, 3, 2005, 1, 0, 20, 
  2, 0, 100, 10, 3, 2015, 1, 0, 30, 
  2, 0, 100, 11, 3, 1612, 1, 0, 60, 
  2, 0, 100, 0, 4, 3024, 5, 0, 500, 
  2, 0, 100, 1, 4, 3027, 5, 0, 1750, 
  2, 0, 100, 2, 4, 2007, 1, 0, 30, 
  2, 0, 100, 3, 4, 1601, 1, 0, 350, 
  2, 0, 100, 4, 4, 3024, 5, 0, 500, 
  2, 0, 100, 5, 4, 2011, 1, 0, 30, 
  2, 0, 100, 6, 4, 1407, 1, 0, 43, 
  2, 0, 100, 7, 4, 2017, 1, 0, 30, 
  2, 0, 100, 8, 4, 2020, 1, 0, 20, 
  2, 0, 100, 9, 4, 1405, 1, 0, 1683, 
  2, 0, 100, 10, 4, 1115, 1, 0, 34, 
  2, 0, 100, 11, 4, 2002, 1, 0, 20, 
  2, 0, 100, 0, 5, 3024, 5, 0, 500, 
  2, 0, 100, 1, 5, 3027, 5, 0, 1750, 
  2, 0, 100, 2, 5, 2001, 1, 0, 20, 
  2, 0, 100, 3, 5, 1206, 1, 0, 343, 
  2, 0, 100, 4, 5, 1006, 1, 0, 30, 
  2, 0, 100, 5, 5, 1207, 1, 0, 43, 
  2, 0, 100, 6, 5, 2013, 1, 0, 20, 
  2, 0, 100, 7, 5, 1123, 1, 0, 38, 
  2, 0, 100, 8, 5, 1118, 1, 0, 338, 
  2, 0, 100, 9, 5, 1510, 1, 0, 338, 
  2, 0, 100, 10, 5, 2016, 1, 0, 30, 
  2, 0, 100, 11, 5, 1302, 1, 0, 290, 
  2, 0, 100, 0, 6, 3024, 5, 0, 500, 
  2, 0, 100, 1, 6, 3027, 5, 0, 1750, 
  2, 0, 100, 2, 6, 1402, 1, 0, 290, 
  2, 0, 100, 3, 6, 2014, 1, 0, 20, 
  2, 0, 100, 4, 6, 1307, 1, 0, 43, 
  2, 0, 100, 5, 6, 1411, 1, 0, 38, 
  2, 0, 100, 6, 6, 2010, 1, 0, 30, 
  2, 0, 100, 7, 6, 1306, 1, 0, 283, 
  2, 0, 100, 8, 6, 1119, 1, 0, 38, 
  2, 0, 100, 9, 6, 2012, 1, 0, 20, 
  2, 0, 100, 10, 6, 1505, 1, 0, 1943, 
  2, 0, 100, 11, 6, 1310, 1, 0, 278, 
  2, 0, 100, 0, 7, 3024, 5, 0, 500, 
  2, 0, 100, 1, 7, 3027, 5, 0, 1750, 
  2, 0, 100, 2, 7, 1111, 1, 0, 43, 
  2, 0, 100, 3, 7, 3015, 5, 0, 250, 
  2, 0, 100, 4, 7, 1602, 1, 0, 50, 
  2, 0, 100, 5, 7, 3030, 5, 0, 500, 
  2, 0, 100, 6, 7, 1309, 1, 0, 2178, 
  2, 0, 100, 7, 7, 1004, 1, 0, 20, 
  2, 0, 100, 8, 7, 1410, 1, 0, 278, 
  2, 0, 100, 9, 7, 2018, 1, 0, 20, 
  2, 0, 100, 10, 7, 3008, 5, 0, 500, 
  2, 0, 100, 11, 7, 2009, 1, 0, 30, 
  2, 0, 100, 0, 8, 3024, 5, 0, 500, 
  2, 0, 100, 1, 8, 3027, 5, 0, 1750, 
  2, 0, 100, 2, 8, 1609, 1, 0, 43, 
  2, 0, 100, 3, 8, 1211, 1, 0, 50, 
  2, 0, 100, 4, 8, 2004, 1, 0, 20, 
  2, 0, 100, 5, 8, 2008, 1, 0, 30, 
  2, 0, 100, 6, 8, 1506, 1, 0, 343, 
  2, 0, 100, 7, 8, 1123, 1, 0, 38, 
  2, 0, 100, 8, 8, 3017, 5, 0, 500, 
  2, 0, 100, 9, 8, 2018, 1, 0, 20, 
  2, 0, 100, 10, 8, 2002, 1, 0, 20, 
  2, 0, 100, 11, 8, 2017, 1, 0, 30, 
  2, 0, 100, 0, 9, 3024, 5, 0, 500, 
  2, 0, 100, 1, 9, 1411, 1, 0, 38, 
  2, 0, 100, 2, 9, 2001, 1, 0, 20, 
  2, 0, 100, 3, 9, 1611, 1, 0, 343, 
  2, 0, 100, 4, 9, 1503, 1, 0, 50, 
  2, 0, 100, 5, 9, 1005, 1, 0, 30, 
  2, 0, 100, 6, 9, 1106, 1, 0, 343, 
  2, 0, 100, 7, 9, 1203, 1, 0, 38, 
  2, 0, 100, 8, 9, 1602, 1, 0, 50, 
  2, 0, 100, 9, 9, 3023, 5, 0, 500, 
  2, 0, 100, 10, 9, 1119, 1, 0, 38, 
  2, 0, 100, 11, 9, 1502, 1, 0, 350, 
  2, 0, 100, 0, 10, 3024, 5, 0, 500, 
  2, 0, 100, 1, 10, 1307, 1, 0, 43, 
  2, 0, 100, 2, 10, 1207, 1, 0, 43, 
  2, 0, 100, 3, 10, 3008, 5, 0, 500, 
  2, 0, 100, 4, 10, 3023, 5, 0, 500, 
  2, 0, 100, 5, 10, 2014, 1, 0, 20, 
  2, 0, 100, 6, 10, 1110, 1, 0, 343, 
  2, 0, 100, 7, 10, 2013, 1, 0, 20, 
  2, 0, 100, 8, 10, 1403, 1, 0, 50, 
  2, 0, 100, 9, 10, 2009, 1, 0, 30, 
  2, 0, 100, 10, 10, 1507, 1, 0, 43, 
  2, 0, 100, 11, 10, 2012, 1, 0, 20, 
  2, 0, 100, 0, 11, 3024, 5, 0, 500, 
  2, 0, 100, 1, 11, 3027, 5, 0, 1750, 
  2, 0, 100, 2, 11, 2021, 1, 0, 20, 
  2, 0, 100, 3, 11, 1406, 1, 0, 283, 
  2, 0, 100, 4, 11, 1211, 1, 0, 50, 
  2, 0, 100, 5, 11, 1206, 1, 0, 343, 
  2, 0, 100, 6, 11, 2010, 1, 0, 30, 
  2, 0, 100, 7, 11, 1407, 1, 0, 43, 
  2, 0, 100, 8, 11, 1102, 1, 0, 334, 
  2, 0, 100, 9, 11, 3030, 5, 0, 500, 
  2, 0, 100, 10, 11, 1210, 1, 0, 350, 
  2, 0, 100, 11, 11, 2007, 1, 0, 30, 
  3, 0, 100, 0, 0, 3024, 5, 0, 500, 
  3, 0, 100, 1, 0, 1006, 1, 0, 30, 
  3, 0, 100, 2, 0, 2020, 1, 0, 20, 
  3, 0, 100, 3, 0, 1511, 1, 0, 38, 
  3, 0, 100, 4, 0, 1101, 1, 0, 1134, 
  3, 0, 100, 5, 0, 2008, 1, 0, 30, 
  3, 0, 100, 6, 0, 1111, 1, 0, 43, 
  3, 0, 100, 7, 0, 1122, 1, 0, 338, 
  3, 0, 100, 8, 0, 1114, 1, 0, 334, 
  3, 0, 100, 9, 0, 3017, 5, 0, 500, 
  3, 0, 100, 10, 0, 1107, 1, 0, 43, 
  3, 0, 100, 11, 0, 2011, 1, 0, 30, 
  3, 0, 100, 0, 1, 3024, 5, 0, 500, 
  3, 0, 100, 1, 1, 1004, 1, 0, 20, 
  3, 0, 100, 2, 1, 2006, 1, 0, 20, 
  3, 0, 100, 3, 1, 2019, 1, 0, 20, 
  3, 0, 100, 4, 1, 2005, 1, 0, 20, 
  3, 0, 100, 5, 1, 1109, 1, 0, 1143, 
  3, 0, 100, 6, 1, 2015, 1, 0, 30, 
  3, 0, 100, 7, 1, 2004, 1, 0, 20, 
  3, 0, 100, 8, 1, 1609, 1, 0, 43, 
  3, 0, 100, 9, 1, 1303, 1, 0, 50, 
  3, 0, 100, 10, 1, 1601, 1, 0, 350, 
  3, 0, 100, 11, 1, 2003, 1, 0, 20, 
  3, 0, 100, 0, 2, 3024, 5, 0, 500, 
  3, 0, 100, 1, 2, 1612, 1, 0, 60, 
  3, 0, 100, 2, 2, 1115, 1, 0, 34, 
  3, 0, 100, 3, 2, 2016, 1, 0, 30, 
  3, 0, 100, 4, 2, 1103, 1, 0, 34, 
  3, 0, 100, 5, 2, 1401, 1, 0, 1690, 
  3, 0, 100, 6, 2, 1610, 1, 0, 360, 
  3, 0, 100, 7, 2, 1311, 1, 0, 38, 
  3, 0, 100, 8, 2, 2006, 1, 0, 20, 
  3, 0, 100, 9, 2, 1211, 1, 0, 50, 
  3, 0, 100, 10, 2, 2004, 1, 0, 20, 
  3, 0, 100, 11, 2, 1123, 1, 0, 38, 
  3, 0, 100, 0, 3, 3024, 5, 0, 500, 
  3, 0, 100, 1, 3, 3027, 5, 0, 1750, 
  3, 0, 100, 2, 3, 1103, 1, 0, 34, 
  3, 0, 100, 3, 3, 1202, 1, 0, 338, 
  3, 0, 100, 4, 3, 2002, 1, 0, 20, 
  3, 0, 100, 5, 3, 1114, 1, 0, 334, 
  3, 0, 100, 6, 3, 1302, 1, 0, 290, 
  3, 0, 100, 7, 3, 2019, 1, 0, 20, 
  3, 0, 100, 8, 3, 3024, 5, 0, 500, 
  3, 0, 100, 9, 3, 1609, 1, 0, 43, 
  3, 0, 100, 10, 3, 1115, 1, 0, 34, 
  3, 0, 100, 11, 3, 1502, 1, 0, 350, 
  3, 0, 100, 0, 4, 3024, 5, 0, 500, 
  3, 0, 100, 1, 4, 3027, 5, 0, 1750, 
  3, 0, 100, 2, 4, 1207, 1, 0, 43, 
  3, 0, 100, 3, 4, 1306, 1, 0, 283, 
  3, 0, 100, 4, 4, 3010, 5, 0, 250, 
  3, 0, 100, 5, 4, 2012, 1, 0, 20, 
  3, 0, 100, 6, 4, 3024, 5, 0, 500, 
  3, 0, 100, 7, 4, 2020, 1, 0, 20, 
  3, 0, 100, 8, 4, 1119, 1, 0, 38, 
  3, 0, 100, 9, 4, 1111, 1, 0, 43, 
  3, 0, 100, 10, 4, 1411, 1, 0, 38, 
  3, 0, 100, 11, 4, 2015, 1, 0, 30, 
  3, 0, 100, 0, 5, 3024, 5, 0, 500, 
  3, 0, 100, 1, 5, 3027, 5, 0, 1750, 
  3, 0, 100, 2, 5, 1307, 1, 0, 43, 
  3, 0, 100, 3, 5, 2016, 1, 0, 30, 
  3, 0, 100, 4, 5, 1203, 1, 0, 38, 
  3, 0, 100, 5, 5, 1206, 1, 0, 343, 
  3, 0, 100, 6, 5, 2017, 1, 0, 30, 
  3, 0, 100, 7, 5, 3013, 5, 0, 250, 
  3, 0, 100, 8, 5, 1510, 1, 0, 338, 
  3, 0, 100, 9, 5, 1611, 1, 0, 343, 
  3, 0, 100, 10, 5, 1102, 1, 0, 334, 
  3, 0, 100, 11, 5, 2013, 1, 0, 20, 
  3, 0, 100, 0, 6, 3024, 5, 0, 500, 
  3, 0, 100, 1, 6, 3027, 5, 0, 1750, 
  3, 0, 100, 2, 6, 3030, 5, 0, 500, 
  3, 0, 100, 3, 6, 2008, 1, 0, 30, 
  3, 0, 100, 4, 6, 2009, 1, 0, 30, 
  3, 0, 100, 5, 6, 1005, 1, 0, 30, 
  3, 0, 100, 6, 6, 2001, 1, 0, 20, 
  3, 0, 100, 7, 6, 1303, 1, 0, 50, 
  3, 0, 100, 8, 6, 1107, 1, 0, 43, 
  3, 0, 100, 9, 6, 1311, 1, 0, 38, 
  3, 0, 100, 10, 6, 2021, 1, 0, 20, 
  3, 0, 100, 11, 6, 1612, 1, 0, 60, 
  3, 0, 100, 0, 7, 3024, 5, 0, 500, 
  3, 0, 100, 1, 7, 3027, 5, 0, 1750, 
  3, 0, 100, 2, 7, 1410, 1, 0, 278, 
  3, 0, 100, 3, 7, 1601, 1, 0, 350, 
  3, 0, 100, 4, 7, 1004, 1, 0, 20, 
  3, 0, 100, 5, 7, 1511, 1, 0, 38, 
  3, 0, 100, 6, 7, 1402, 1, 0, 290, 
  3, 0, 100, 7, 7, 1403, 1, 0, 50, 
  3, 0, 100, 8, 7, 1110, 1, 0, 343, 
  3, 0, 100, 9, 7, 1602, 1, 0, 50, 
  3, 0, 100, 10, 7, 2003, 1, 0, 20, 
  3, 0, 100, 11, 7, 2011, 1, 0, 30, 
  3, 0, 100, 0, 8, 3024, 5, 0, 500, 
  3, 0, 100, 1, 8, 3027, 5, 0, 1750, 
  3, 0, 100, 2, 8, 2018, 1, 0, 20, 
  3, 0, 100, 3, 8, 1606, 1, 0, 2460, 
  3, 0, 100, 4, 8, 1507, 1, 0, 43, 
  3, 0, 100, 5, 8, 2007, 1, 0, 30, 
  3, 0, 100, 6, 8, 1006, 1, 0, 30, 
  3, 0, 100, 7, 8, 2010, 1, 0, 30, 
  3, 0, 100, 8, 8, 1503, 1, 0, 50, 
  3, 0, 100, 9, 8, 2005, 1, 0, 20, 
  3, 0, 100, 10, 8, 1407, 1, 0, 43, 
  3, 0, 100, 11, 8, 2014, 1, 0, 20, 
  3, 0, 100, 0, 9, 3024, 5, 0, 500, 
  3, 0, 100, 1, 9, 3027, 5, 0, 1750, 
  3, 0, 100, 2, 9, 2020, 1, 0, 20, 
  3, 0, 100, 3, 9, 1612, 1, 0, 60, 
  3, 0, 100, 4, 9, 1123, 1, 0, 38, 
  3, 0, 100, 5, 9, 2017, 1, 0, 30, 
  3, 0, 100, 6, 9, 3023, 5, 0, 500, 
  3, 0, 100, 7, 9, 2004, 1, 0, 20, 
  3, 0, 100, 8, 9, 1310, 1, 0, 278, 
  3, 0, 100, 9, 9, 2011, 1, 0, 30, 
  3, 0, 100, 10, 9, 1602, 1, 0, 50, 
  3, 0, 100, 11, 9, 1507, 1, 0, 43, 
  3, 0, 100, 0, 10, 3024, 5, 0, 500, 
  3, 0, 100, 1, 10, 3027, 5, 0, 1750, 
  3, 0, 100, 2, 10, 1407, 1, 0, 43, 
  3, 0, 100, 3, 10, 3016, 5, 0, 250, 
  3, 0, 100, 4, 10, 2001, 1, 0, 20, 
  3, 0, 100, 5, 10, 1609, 1, 0, 43, 
  3, 0, 100, 6, 10, 1311, 1, 0, 38, 
  3, 0, 100, 7, 10, 1503, 1, 0, 50, 
  3, 0, 100, 8, 10, 1106, 1, 0, 343, 
  3, 0, 100, 9, 10, 3011, 5, 0, 250, 
  3, 0, 100, 10, 10, 1005, 1, 0, 30, 
  3, 0, 100, 11, 10, 1207, 1, 0, 43, 
  3, 0, 100, 0, 11, 3024, 5, 0, 500, 
  3, 0, 100, 1, 11, 3027, 5, 0, 1750, 
  3, 0, 100, 2, 11, 2018, 1, 0, 20, 
  3, 0, 100, 3, 11, 1105, 1, 0, 1143, 
  3, 0, 100, 4, 11, 1103, 1, 0, 34, 
  3, 0, 100, 5, 11, 1004, 1, 0, 20, 
  3, 0, 100, 6, 11, 2013, 1, 0, 20, 
  3, 0, 100, 7, 11, 1411, 1, 0, 38, 
  3, 0, 100, 8, 11, 2010, 1, 0, 30, 
  3, 0, 100, 9, 11, 2006, 1, 0, 20, 
  3, 0, 100, 10, 11, 1610, 1, 0, 360, 
  3, 0, 100, 11, 11, 1202, 1, 0, 338, 
  4, 0, 100, 0, 0, 3024, 5, 0, 500, 
  4, 0, 100, 1, 0, 1403, 1, 0, 50, 
  4, 0, 100, 2, 0, 1506, 1, 0, 343, 
  4, 0, 100, 3, 0, 1203, 1, 0, 38, 
  4, 0, 100, 4, 0, 1211, 1, 0, 50, 
  4, 0, 100, 5, 0, 2015, 1, 0, 30, 
  4, 0, 100, 6, 0, 1113, 1, 0, 1134, 
  4, 0, 100, 7, 0, 1210, 1, 0, 350, 
  4, 0, 100, 8, 0, 2008, 1, 0, 30, 
  4, 0, 100, 9, 0, 1115, 1, 0, 34, 
  4, 0, 100, 10, 0, 1511, 1, 0, 38, 
  4, 0, 100, 11, 0, 1111, 1, 0, 43, 
  4, 0, 100, 0, 1, 3024, 5, 0, 500, 
  4, 0, 100, 1, 1, 3027, 5, 0, 1750, 
  4, 0, 100, 2, 1, 1006, 1, 0, 30, 
  4, 0, 100, 3, 1, 1119, 1, 0, 38, 
  4, 0, 100, 4, 1, 1406, 1, 0, 283, 
  4, 0, 100, 5, 1, 2003, 1, 0, 20, 
  4, 0, 100, 6, 1, 1307, 1, 0, 43, 
  4, 0, 100, 7, 1, 2019, 1, 0, 20, 
  4, 0, 100, 8, 1, 1118, 1, 0, 338, 
  4, 0, 100, 9, 1, 1122, 1, 0, 338, 
  4, 0, 100, 10, 1, 2002, 1, 0, 20, 
  4, 0, 100, 11, 1, 2005, 1, 0, 20, 
  4, 0, 100, 0, 2, 3024, 5, 0, 500, 
  4, 0, 100, 1, 2, 3027, 5, 0, 1750, 
  4, 0, 100, 2, 2, 1202, 1, 0, 338, 
  4, 0, 100, 3, 2, 1107, 1, 0, 43, 
  4, 0, 100, 4, 2, 2012, 1, 0, 20, 
  4, 0, 100, 5, 2, 2014, 1, 0, 20, 
  4, 0, 100, 6, 2, 2021, 1, 0, 20, 
  4, 0, 100, 7, 2, 1502, 1, 0, 350, 
  4, 0, 100, 8, 2, 3017, 5, 0, 500, 
  4, 0, 100, 9, 2, 2016, 1, 0, 30, 
  4, 0, 100, 10, 2, 2009, 1, 0, 30, 
  4, 0, 100, 11, 2, 1118, 1, 0, 338, 
  4, 0, 100, 0, 3, 3024, 5, 0, 500, 
  4, 0, 100, 1, 3, 3027, 5, 0, 1750, 
  4, 0, 100, 2, 3, 1303, 1, 0, 50, 
  4, 0, 100, 3, 3, 2007, 1, 0, 30, 
  4, 0, 100, 4, 3, 2006, 1, 0, 20, 
  4, 0, 100, 5, 3, 1306, 1, 0, 283, 
  4, 0, 100, 6, 3, 2001, 1, 0, 20, 
  4, 0, 100, 7, 3, 2009, 1, 0, 30, 
  4, 0, 100, 8, 3, 1005, 1, 0, 30, 
  4, 0, 100, 9, 3, 1506, 1, 0, 343, 
  4, 0, 100, 10, 3, 1211, 1, 0, 50, 
  4, 0, 100, 11, 3, 2021, 1, 0, 20, 
  4, 0, 100, 0, 4, 3024, 5, 0, 500, 
  4, 0, 100, 1, 4, 3027, 5, 0, 1750, 
  4, 0, 100, 2, 4, 1123, 1, 0, 38, 
  4, 0, 100, 3, 4, 3022, 5, 0, 250, 
  4, 0, 100, 4, 4, 1411, 1, 0, 38, 
  4, 0, 100, 5, 4, 1610, 1, 0, 360, 
  4, 0, 100, 6, 4, 1310, 1, 0, 278, 
  4, 0, 100, 7, 4, 1113, 1, 0, 1134, 
  4, 0, 100, 8, 4, 1601, 1, 0, 350, 
  4, 0, 100, 9, 4, 1122, 1, 0, 338, 
  4, 0, 100, 10, 4, 1402, 1, 0, 290, 
  4, 0, 100, 11, 4, 2012, 1, 0, 20, 
  4, 0, 100, 0, 5, 3024, 5, 0, 500, 
  4, 0, 100, 1, 5, 3027, 5, 0, 1750, 
  4, 0, 100, 2, 5, 1511, 1, 0, 38, 
  4, 0, 100, 3, 5, 1510, 1, 0, 338, 
  4, 0, 100, 4, 5, 1507, 1, 0, 43, 
  4, 0, 100, 5, 5, 1103, 1, 0, 34, 
  4, 0, 100, 6, 5, 1114, 1, 0, 334, 
  4, 0, 100, 7, 5, 1303, 1, 0, 50, 
  4, 0, 100, 8, 5, 1609, 1, 0, 43, 
  4, 0, 100, 9, 5, 2015, 1, 0, 30, 
  4, 0, 100, 10, 5, 1004, 1, 0, 20, 
  4, 0, 100, 11, 5, 2002, 1, 0, 20, 
  4, 0, 100, 0, 6, 3024, 5, 0, 500, 
  4, 0, 100, 1, 6, 3027, 5, 0, 1750, 
  4, 0, 100, 2, 6, 2004, 1, 0, 20, 
  4, 0, 100, 3, 6, 1405, 1, 0, 1683, 
  4, 0, 100, 4, 6, 1111, 1, 0, 43, 
  4, 0, 100, 5, 6, 2013, 1, 0, 20, 
  4, 0, 100, 6, 6, 2003, 1, 0, 20, 
  4, 0, 100, 7, 6, 2007, 1, 0, 30, 
  4, 0, 100, 8, 6, 2005, 1, 0, 20, 
  4, 0, 100, 9, 6, 3007, 5, 0, 250, 
  4, 0, 100, 10, 6, 1107, 1, 0, 43, 
  4, 0, 100, 11, 6, 1115, 1, 0, 34, 
  4, 0, 100, 0, 7, 3024, 5, 0, 500, 
  4, 0, 100, 1, 7, 3027, 5, 0, 1750, 
  4, 0, 100, 2, 7, 1006, 1, 0, 30, 
  4, 0, 100, 3, 7, 2018, 1, 0, 20, 
  4, 0, 100, 4, 7, 1611, 1, 0, 343, 
  4, 0, 100, 5, 7, 1206, 1, 0, 343, 
  4, 0, 100, 6, 7, 2020, 1, 0, 20, 
  4, 0, 100, 7, 7, 1407, 1, 0, 43, 
  4, 0, 100, 8, 7, 3008, 5, 0, 500, 
  4, 0, 100, 9, 7, 2019, 1, 0, 20, 
  4, 0, 100, 10, 7, 1210, 1, 0, 350, 
  4, 0, 100, 11, 7, 1119, 1, 0, 38, 
  4, 0, 100, 0, 8, 3024, 5, 0, 500, 
  4, 0, 100, 1, 8, 3027, 5, 0, 1750, 
  4, 0, 100, 2, 8, 1311, 1, 0, 38, 
  4, 0, 100, 3, 8, 1106, 1, 0, 343, 
  4, 0, 100, 4, 8, 2014, 1, 0, 20, 
  4, 0, 100, 5, 8, 1203, 1, 0, 38, 
  4, 0, 100, 6, 8, 2011, 1, 0, 30, 
  4, 0, 100, 7, 8, 2016, 1, 0, 30, 
  4, 0, 100, 8, 8, 1503, 1, 0, 50, 
  4, 0, 100, 9, 8, 1406, 1, 0, 283, 
  4, 0, 100, 10, 8, 1302, 1, 0, 290, 
  4, 0, 100, 11, 8, 2017, 1, 0, 30, 
  4, 0, 100, 0, 9, 3024, 5, 0, 500, 
  4, 0, 100, 1, 9, 3027, 5, 0, 1750, 
  4, 0, 100, 2, 9, 2008, 1, 0, 30, 
  4, 0, 100, 3, 9, 1403, 1, 0, 50, 
  4, 0, 100, 4, 9, 1207, 1, 0, 43, 
  4, 0, 100, 5, 9, 1102, 1, 0, 334, 
  4, 0, 100, 6, 9, 1307, 1, 0, 43, 
  4, 0, 100, 7, 9, 2010, 1, 0, 30, 
  4, 0, 100, 8, 9, 1602, 1, 0, 50, 
  4, 0, 100, 9, 9, 1612, 1, 0, 60, 
  4, 0, 100, 10, 9, 3030, 5, 0, 500, 
  4, 0, 100, 11, 9, 1006, 1, 0, 30, 
  4, 0, 100, 0, 10, 3024, 5, 0, 500, 
  4, 0, 100, 1, 10, 3027, 5, 0, 1750, 
  4, 0, 100, 2, 10, 1410, 1, 0, 278, 
  4, 0, 100, 3, 10, 2020, 1, 0, 20, 
  4, 0, 100, 4, 10, 1110, 1, 0, 343, 
  4, 0, 100, 5, 10, 2016, 1, 0, 30, 
  4, 0, 100, 6, 10, 1111, 1, 0, 43, 
  4, 0, 100, 7, 10, 1119, 1, 0, 38, 
  4, 0, 100, 8, 10, 1609, 1, 0, 43, 
  4, 0, 100, 9, 10, 1122, 1, 0, 338, 
  4, 0, 100, 10, 10, 3023, 5, 0, 500, 
  4, 0, 100, 11, 10, 2011, 1, 0, 30, 
  4, 0, 100, 0, 11, 3024, 5, 0, 500, 
  4, 0, 100, 1, 11, 3027, 5, 0, 1750, 
  4, 0, 100, 2, 11, 1207, 1, 0, 43, 
  4, 0, 100, 3, 11, 1507, 1, 0, 43, 
  4, 0, 100, 4, 11, 2004, 1, 0, 20, 
  4, 0, 100, 5, 11, 1401, 1, 0, 1690, 
  4, 0, 100, 6, 11, 2015, 1, 0, 30, 
  4, 0, 100, 7, 11, 2010, 1, 0, 30, 
  4, 0, 100, 8, 11, 2009, 1, 0, 30, 
  4, 0, 100, 9, 11, 2021, 1, 0, 20, 
  4, 0, 100, 10, 11, 2017, 1, 0, 30, 
  4, 0, 100, 11, 11, 1407, 1, 0, 43, 
  5, 0, 100, 0, 0, 3024, 5, 0, 500, 
  5, 0, 100, 1, 0, 1004, 1, 0, 20, 
  5, 0, 100, 2, 0, 1306, 1, 0, 283, 
  5, 0, 100, 3, 0, 2005, 1, 0, 20, 
  5, 0, 100, 4, 0, 2014, 1, 0, 20, 
  5, 0, 100, 5, 0, 1410, 1, 0, 278, 
  5, 0, 100, 6, 0, 1302, 1, 0, 290, 
  5, 0, 100, 7, 0, 1510, 1, 0, 338, 
  5, 0, 100, 8, 0, 1311, 1, 0, 38, 
  5, 0, 100, 9, 0, 3024, 5, 0, 500, 
  5, 0, 100, 10, 0, 1307, 1, 0, 43, 
  5, 0, 100, 11, 0, 3015, 5, 0, 250, 
  5, 0, 100, 0, 1, 3024, 5, 0, 500, 
  5, 0, 100, 1, 1, 3027, 5, 0, 1750, 
  5, 0, 100, 2, 1, 1502, 1, 0, 350, 
  5, 0, 100, 3, 1, 1602, 1, 0, 50, 
  5, 0, 100, 4, 1, 1610, 1, 0, 360, 
  5, 0, 100, 5, 1, 1103, 1, 0, 34, 
  5, 0, 100, 6, 1, 1511, 1, 0, 38, 
  5, 0, 100, 7, 1, 2007, 1, 0, 30, 
  5, 0, 100, 8, 1, 1005, 1, 0, 30, 
  5, 0, 100, 9, 1, 1411, 1, 0, 38, 
  5, 0, 100, 10, 1, 1114, 1, 0, 334, 
  5, 0, 100, 11, 1, 1402, 1, 0, 290, 
  5, 0, 100, 0, 2, 3024, 5, 0, 500, 
  5, 0, 100, 1, 2, 3027, 5, 0, 1750, 
  5, 0, 100, 2, 2, 1601, 1, 0, 350, 
  5, 0, 100, 3, 2, 2018, 1, 0, 20, 
  5, 0, 100, 4, 2, 1406, 1, 0, 283, 
  5, 0, 100, 5, 2, 1211, 1, 0, 50, 
  5, 0, 100, 6, 2, 1403, 1, 0, 50, 
  5, 0, 100, 7, 2, 2001, 1, 0, 20, 
  5, 0, 100, 8, 2, 2019, 1, 0, 20, 
  5, 0, 100, 9, 2, 1611, 1, 0, 343, 
  5, 0, 100, 10, 2, 1202, 1, 0, 338, 
  5, 0, 100, 11, 2, 1102, 1, 0, 334, 
  5, 0, 100, 0, 3, 3024, 5, 0, 500, 
  5, 0, 100, 1, 3, 3027, 5, 0, 1750, 
  5, 0, 100, 2, 3, 2002, 1, 0, 20, 
  5, 0, 100, 3, 3, 1503, 1, 0, 50, 
  5, 0, 100, 4, 3, 1612, 1, 0, 60, 
  5, 0, 100, 5, 3, 1203, 1, 0, 38, 
  5, 0, 100, 6, 3, 2003, 1, 0, 20, 
  5, 0, 100, 7, 3, 1506, 1, 0, 343, 
  5, 0, 100, 8, 3, 2006, 1, 0, 20, 
  5, 0, 100, 9, 3, 1106, 1, 0, 343, 
  5, 0, 100, 10, 3, 2008, 1, 0, 30, 
  5, 0, 100, 11, 3, 1115, 1, 0, 34, 
  5, 0, 100, 0, 4, 3024, 5, 0, 500, 
  5, 0, 100, 1, 4, 3027, 5, 0, 1750, 
  5, 0, 100, 2, 4, 1107, 1, 0, 43, 
  5, 0, 100, 3, 4, 1121, 1, 0, 1138, 
  5, 0, 100, 4, 4, 2012, 1, 0, 20, 
  5, 0, 100, 5, 4, 2013, 1, 0, 20, 
  5, 0, 100, 6, 4, 1303, 1, 0, 50, 
  5, 0, 100, 7, 4, 1123, 1, 0, 38, 
  5, 0, 100, 8, 4, 1211, 1, 0, 50, 
  5, 0, 100, 9, 4, 1307, 1, 0, 43, 
  5, 0, 100, 10, 4, 2014, 1, 0, 20, 
  5, 0, 100, 11, 4, 1005, 1, 0, 30, 
  5, 0, 100, 0, 5, 3024, 5, 0, 500, 
  5, 0, 100, 1, 5, 3027, 5, 0, 1750, 
  5, 0, 100, 2, 5, 2020, 1, 0, 20, 
  5, 0, 100, 3, 5, 2021, 1, 0, 20, 
  5, 0, 100, 4, 5, 1119, 1, 0, 38, 
  5, 0, 100, 5, 5, 1210, 1, 0, 350, 
  5, 0, 100, 6, 5, 1006, 1, 0, 30, 
  5, 0, 100, 7, 5, 2008, 1, 0, 30, 
  5, 0, 100, 8, 5, 1111, 1, 0, 43, 
  5, 0, 100, 9, 5, 2011, 1, 0, 30, 
  5, 0, 100, 10, 5, 1207, 1, 0, 43, 
  5, 0, 100, 11, 5, 1110, 1, 0, 343, 
  5, 0, 100, 0, 6, 3024, 5, 0, 500, 
  5, 0, 100, 1, 6, 3027, 5, 0, 1750, 
  5, 0, 100, 2, 6, 1407, 1, 0, 43, 
  5, 0, 100, 3, 6, 1206, 1, 0, 343, 
  5, 0, 100, 4, 6, 1301, 1, 0, 2190, 
  5, 0, 100, 5, 6, 2018, 1, 0, 20, 
  5, 0, 100, 6, 6, 1107, 1, 0, 43, 
  5, 0, 100, 7, 6, 2013, 1, 0, 20, 
  5, 0, 100, 8, 6, 1118, 1, 0, 338, 
  5, 0, 100, 9, 6, 1507, 1, 0, 43, 
  5, 0, 100, 10, 6, 2006, 1, 0, 20, 
  5, 0, 100, 11, 6, 1310, 1, 0, 278, 
  5, 0, 100, 0, 7, 3024, 5, 0, 500, 
  5, 0, 100, 1, 7, 3027, 5, 0, 1750, 
  5, 0, 100, 2, 7, 1303, 1, 0, 50, 
  5, 0, 100, 3, 7, 2007, 1, 0, 30, 
  5, 0, 100, 4, 7, 1202, 1, 0, 338, 
  5, 0, 100, 5, 7, 2012, 1, 0, 20, 
  5, 0, 100, 6, 7, 1511, 1, 0, 38, 
  5, 0, 100, 7, 7, 1609, 1, 0, 43, 
  5, 0, 100, 8, 7, 2002, 1, 0, 20, 
  5, 0, 100, 9, 7, 1310, 1, 0, 278, 
  5, 0, 100, 10, 7, 1505, 1, 0, 1943, 
  5, 0, 100, 11, 7, 1503, 1, 0, 50, 
  5, 0, 100, 0, 8, 3024, 5, 0, 500, 
  5, 0, 100, 1, 8, 3027, 5, 0, 1750, 
  5, 0, 100, 2, 8, 1123, 1, 0, 38, 
  5, 0, 100, 3, 8, 1403, 1, 0, 50, 
  5, 0, 100, 4, 8, 2010, 1, 0, 30, 
  5, 0, 100, 5, 8, 1004, 1, 0, 20, 
  5, 0, 100, 6, 8, 1206, 1, 0, 343, 
  5, 0, 100, 7, 8, 2004, 1, 0, 20, 
  5, 0, 100, 8, 8, 2005, 1, 0, 20, 
  5, 0, 100, 9, 8, 2015, 1, 0, 30, 
  5, 0, 100, 10, 8, 2003, 1, 0, 20, 
  5, 0, 100, 11, 8, 1103, 1, 0, 34, 
  5, 0, 100, 0, 9, 3024, 5, 0, 500, 
  5, 0, 100, 1, 9, 3027, 5, 0, 1750, 
  5, 0, 100, 2, 9, 1311, 1, 0, 38, 
  5, 0, 100, 3, 9, 1610, 1, 0, 360, 
  5, 0, 100, 4, 9, 1102, 1, 0, 334, 
  5, 0, 100, 5, 9, 1410, 1, 0, 278, 
  5, 0, 100, 6, 9, 1118, 1, 0, 338, 
  5, 0, 100, 7, 9, 2016, 1, 0, 30, 
  5, 0, 100, 8, 9, 2001, 1, 0, 20, 
  5, 0, 100, 9, 9, 1115, 1, 0, 34, 
  5, 0, 100, 10, 9, 1602, 1, 0, 50, 
  5, 0, 100, 11, 9, 1302, 1, 0, 290, 
  5, 0, 100, 0, 10, 3024, 5, 0, 500, 
  5, 0, 100, 1, 10, 3027, 5, 0, 1750, 
  5, 0, 100, 2, 10, 1601, 1, 0, 350, 
  5, 0, 100, 3, 10, 1604, 1, 0, 2450, 
  5, 0, 100, 4, 10, 2019, 1, 0, 20, 
  5, 0, 100, 5, 10, 2017, 1, 0, 30, 
  5, 0, 100, 6, 10, 1203, 1, 0, 38, 
  5, 0, 100, 7, 10, 1502, 1, 0, 350, 
  5, 0, 100, 8, 10, 1411, 1, 0, 38, 
  5, 0, 100, 9, 10, 2009, 1, 0, 30, 
  5, 0, 100, 10, 10, 1612, 1, 0, 60, 
  5, 0, 100, 11, 10, 3008, 5, 0, 500, 
  5, 0, 100, 0, 11, 3024, 5, 0, 500, 
  5, 0, 100, 1, 11, 3027, 5, 0, 1750, 
  5, 0, 100, 2, 11, 1612, 1, 0, 60, 
  5, 0, 100, 3, 11, 1005, 1, 0, 30, 
  5, 0, 100, 4, 11, 1506, 1, 0, 343, 
  5, 0, 100, 5, 11, 2006, 1, 0, 20, 
  5, 0, 100, 6, 11, 1510, 1, 0, 338, 
  5, 0, 100, 7, 11, 1103, 1, 0, 34, 
  5, 0, 100, 8, 11, 2009, 1, 0, 30, 
  5, 0, 100, 9, 11, 1123, 1, 0, 38, 
  5, 0, 100, 10, 11, 1115, 1, 0, 34, 
  5, 0, 100, 11, 11, 1106, 1, 0, 343, 
  6, 0, 100, 0, 0, 3024, 5, 0, 500, 
  6, 0, 100, 1, 0, 1503, 1, 0, 50, 
  6, 0, 100, 2, 0, 2011, 1, 0, 30, 
  6, 0, 100, 3, 0, 1110, 1, 0, 343, 
  6, 0, 100, 4, 0, 1210, 1, 0, 350, 
  6, 0, 100, 5, 0, 1611, 1, 0, 343, 
  6, 0, 100, 6, 0, 1402, 1, 0, 290, 
  6, 0, 100, 7, 0, 1107, 1, 0, 43, 
  6, 0, 100, 8, 0, 2014, 1, 0, 20, 
  6, 0, 100, 9, 0, 2005, 1, 0, 20, 
  6, 0, 100, 10, 0, 1602, 1, 0, 50, 
  6, 0, 100, 11, 0, 1111, 1, 0, 43, 
  6, 0, 100, 0, 1, 3024, 5, 0, 500, 
  6, 0, 100, 1, 1, 3027, 5, 0, 1750, 
  6, 0, 100, 2, 1, 2017, 1, 0, 30, 
  6, 0, 100, 3, 1, 2016, 1, 0, 30, 
  6, 0, 100, 4, 1, 2008, 1, 0, 30, 
  6, 0, 100, 5, 1, 1311, 1, 0, 38, 
  6, 0, 100, 6, 1, 2001, 1, 0, 20, 
  6, 0, 100, 7, 1, 1507, 1, 0, 43, 
  6, 0, 100, 8, 1, 2002, 1, 0, 20, 
  6, 0, 100, 9, 1, 2004, 1, 0, 20, 
  6, 0, 100, 10, 1, 1207, 1, 0, 43, 
  6, 0, 100, 11, 1, 1407, 1, 0, 43, 
  6, 0, 100, 0, 2, 3024, 5, 0, 500, 
  6, 0, 100, 1, 2, 3027, 5, 0, 1750, 
  6, 0, 100, 2, 2, 2010, 1, 0, 30, 
  6, 0, 100, 3, 2, 3017, 5, 0, 500, 
  6, 0, 100, 4, 2, 1211, 1, 0, 50, 
  6, 0, 100, 5, 2, 1411, 1, 0, 38, 
  6, 0, 100, 6, 2, 1114, 1, 0, 334, 
  6, 0, 100, 7, 2, 1306, 1, 0, 283, 
  6, 0, 100, 8, 2, 1303, 1, 0, 50, 
  6, 0, 100, 9, 2, 1403, 1, 0, 50, 
  6, 0, 100, 10, 2, 3030, 5, 0, 500, 
  6, 0, 100, 11, 2, 2015, 1, 0, 30, 
  6, 0, 100, 0, 3, 3024, 5, 0, 500, 
  6, 0, 100, 1, 3, 2018, 1, 0, 20, 
  6, 0, 100, 2, 3, 1203, 1, 0, 38, 
  6, 0, 100, 3, 3, 2019, 1, 0, 20, 
  6, 0, 100, 4, 3, 2007, 1, 0, 30, 
  6, 0, 100, 5, 3, 2020, 1, 0, 20, 
  6, 0, 100, 6, 3, 1307, 1, 0, 43, 
  6, 0, 100, 7, 3, 1406, 1, 0, 283, 
  6, 0, 100, 8, 3, 1006, 1, 0, 30, 
  6, 0, 100, 9, 3, 1119, 1, 0, 38, 
  6, 0, 100, 10, 3, 1122, 1, 0, 338, 
  6, 0, 100, 11, 3, 3008, 5, 0, 500, 
  6, 0, 100, 0, 4, 3024, 5, 0, 500, 
  6, 0, 100, 1, 4, 3027, 5, 0, 1750, 
  6, 0, 100, 2, 4, 2013, 1, 0, 20, 
  6, 0, 100, 3, 4, 1004, 1, 0, 20, 
  6, 0, 100, 4, 4, 1609, 1, 0, 43, 
  6, 0, 100, 5, 4, 1122, 1, 0, 338, 
  6, 0, 100, 6, 4, 2003, 1, 0, 20, 
  6, 0, 100, 7, 4, 1511, 1, 0, 38, 
  6, 0, 100, 8, 4, 1206, 1, 0, 343, 
  6, 0, 100, 9, 4, 3024, 5, 0, 500, 
  6, 0, 100, 10, 4, 1402, 1, 0, 290, 
  6, 0, 100, 11, 4, 2021, 1, 0, 20, 
  6, 0, 100, 0, 5, 3024, 5, 0, 500, 
  6, 0, 100, 1, 5, 2012, 1, 0, 20, 
  6, 0, 100, 2, 5, 2007, 1, 0, 30, 
  6, 0, 100, 3, 5, 2001, 1, 0, 20, 
  6, 0, 100, 4, 5, 1202, 1, 0, 338, 
  6, 0, 100, 5, 5, 1102, 1, 0, 334, 
  6, 0, 100, 6, 5, 2018, 1, 0, 20, 
  6, 0, 100, 7, 5, 1006, 1, 0, 30, 
  6, 0, 100, 8, 5, 1609, 1, 0, 43, 
  6, 0, 100, 9, 5, 1118, 1, 0, 338, 
  6, 0, 100, 10, 5, 2005, 1, 0, 20, 
  6, 0, 100, 11, 5, 1503, 1, 0, 50, 
  6, 0, 100, 0, 6, 3024, 5, 0, 500, 
  6, 0, 100, 1, 6, 1005, 1, 0, 30, 
  6, 0, 100, 2, 6, 2006, 1, 0, 20, 
  6, 0, 100, 3, 6, 1406, 1, 0, 283, 
  6, 0, 100, 4, 6, 2019, 1, 0, 20, 
  6, 0, 100, 5, 6, 1203, 1, 0, 38, 
  6, 0, 100, 6, 6, 1510, 1, 0, 338, 
  6, 0, 100, 7, 6, 3017, 5, 0, 500, 
  6, 0, 100, 8, 6, 2002, 1, 0, 20, 
  6, 0, 100, 9, 6, 2021, 1, 0, 20, 
  6, 0, 100, 10, 6, 1109, 1, 0, 1143, 
  6, 0, 100, 11, 6, 2008, 1, 0, 30, 
  6, 0, 100, 0, 7, 3024, 5, 0, 500, 
  6, 0, 100, 1, 7, 3027, 5, 0, 1750, 
  6, 0, 100, 2, 7, 2017, 1, 0, 30, 
  6, 0, 100, 3, 7, 1106, 1, 0, 343, 
  6, 0, 100, 4, 7, 2010, 1, 0, 30, 
  6, 0, 100, 5, 7, 2012, 1, 0, 20, 
  6, 0, 100, 6, 7, 2014, 1, 0, 20, 
  6, 0, 100, 7, 7, 1123, 1, 0, 38, 
  6, 0, 100, 8, 7, 3023, 5, 0, 500, 
  6, 0, 100, 9, 7, 1107, 1, 0, 43, 
  6, 0, 100, 10, 7, 1307, 1, 0, 43, 
  6, 0, 100, 11, 7, 1309, 1, 0, 2178, 
  6, 0, 100, 0, 8, 3024, 5, 0, 500, 
  6, 0, 100, 1, 8, 3027, 5, 0, 1750, 
  6, 0, 100, 2, 8, 1103, 1, 0, 34, 
  6, 0, 100, 3, 8, 1115, 1, 0, 34, 
  6, 0, 100, 4, 8, 1207, 1, 0, 43, 
  6, 0, 100, 5, 8, 1410, 1, 0, 278, 
  6, 0, 100, 6, 8, 1407, 1, 0, 43, 
  6, 0, 100, 7, 8, 2016, 1, 0, 30, 
  6, 0, 100, 8, 8, 1110, 1, 0, 343, 
  6, 0, 100, 9, 8, 1111, 1, 0, 43, 
  6, 0, 100, 10, 8, 3008, 5, 0, 500, 
  6, 0, 100, 11, 8, 1210, 1, 0, 350, 
  6, 0, 100, 0, 9, 3024, 5, 0, 500, 
  6, 0, 100, 1, 9, 1211, 1, 0, 50, 
  6, 0, 100, 2, 9, 2015, 1, 0, 30, 
  6, 0, 100, 3, 9, 1201, 1, 0, 2438, 
  6, 0, 100, 4, 9, 1114, 1, 0, 334, 
  6, 0, 100, 5, 9, 1610, 1, 0, 360, 
  6, 0, 100, 6, 9, 1311, 1, 0, 38, 
  6, 0, 100, 7, 9, 2011, 1, 0, 30, 
  6, 0, 100, 8, 9, 1506, 1, 0, 343, 
  6, 0, 100, 9, 9, 1502, 1, 0, 350, 
  6, 0, 100, 10, 9, 2009, 1, 0, 30, 
  6, 0, 100, 11, 9, 1411, 1, 0, 38, 
  6, 0, 100, 0, 10, 3024, 5, 0, 500, 
  6, 0, 100, 1, 10, 3027, 5, 0, 1750, 
  6, 0, 100, 2, 10, 1612, 1, 0, 60, 
  6, 0, 100, 3, 10, 1004, 1, 0, 20, 
  6, 0, 100, 4, 10, 1511, 1, 0, 38, 
  6, 0, 100, 5, 10, 2020, 1, 0, 20, 
  6, 0, 100, 6, 10, 1119, 1, 0, 38, 
  6, 0, 100, 7, 10, 2004, 1, 0, 20, 
  6, 0, 100, 8, 10, 2003, 1, 0, 20, 
  6, 0, 100, 9, 10, 1507, 1, 0, 43, 
  6, 0, 100, 10, 10, 2013, 1, 0, 20, 
  6, 0, 100, 11, 10, 1403, 1, 0, 50, 
  6, 0, 100, 0, 11, 3024, 5, 0, 500, 
  6, 0, 100, 1, 11, 3027, 5, 0, 1750, 
  6, 0, 100, 2, 11, 1303, 1, 0, 50, 
  6, 0, 100, 3, 11, 1602, 1, 0, 50, 
  6, 0, 100, 4, 11, 2021, 1, 0, 20, 
  6, 0, 100, 5, 11, 1601, 1, 0, 350, 
  6, 0, 100, 6, 11, 2010, 1, 0, 30, 
  6, 0, 100, 7, 11, 2020, 1, 0, 20, 
  6, 0, 100, 8, 11, 1302, 1, 0, 290, 
  6, 0, 100, 9, 11, 1303, 1, 0, 50, 
  6, 0, 100, 10, 11, 1511, 1, 0, 38, 
  6, 0, 100, 11, 11, 1311, 1, 0, 38, 
]
BMREFRESH = [
  0, 5, 
  1, 10, 
  2, 10, 
  3, 20, 
  4, 20, 
  5, 50, 
  6, 50, 
  7, 100, 
  8, 100, 
  9, 150, 
  10, 150, 
  11, 150, 
  12, 150, 
  13, 150, 
  14, 150, 
  15, 150, 
  16, 300, 
  17, 300, 
  18, 300, 
  19, 300, 
  20, 300, 
]
MARKETREFRESH = [
  0, 5, 
  1, 10, 
  2, 10, 
  3, 20, 
  4, 20, 
  5, 50, 
  6, 50, 
  7, 100, 
  8, 100, 
  9, 150, 
  10, 150, 
  11, 150, 
  12, 150, 
  13, 150, 
  14, 150, 
  15, 150, 
  16, 300, 
  17, 300, 
  18, 300, 
  19, 300, 
  20, 300, 
]
MARKET = [
  0, 0, 100, 0, 0, 3024, 5, 0, 500, 
  0, 0, 100, 1, 0, 3027, 5, 0, 1750, 
  0, 0, 100, 2, 0, 1503, 1, 0, 50, 
  0, 0, 100, 3, 0, 1507, 1, 0, 43, 
  0, 0, 100, 4, 0, 2016, 1, 0, 30, 
  0, 0, 100, 5, 0, 1111, 1, 0, 43, 
  0, 0, 100, 6, 0, 2011, 1, 0, 30, 
  0, 0, 100, 7, 0, 3017, 5, 0, 500, 
  0, 0, 100, 8, 0, 1005, 1, 0, 30, 
  0, 0, 100, 9, 0, 1302, 1, 0, 290, 
  0, 0, 100, 10, 0, 2009, 1, 0, 30, 
  0, 0, 100, 11, 0, 1123, 1, 0, 38, 
  0, 0, 100, 0, 1, 3024, 5, 0, 500, 
  0, 0, 100, 1, 1, 2003, 1, 0, 20, 
  0, 0, 100, 2, 1, 2014, 1, 0, 20, 
  0, 0, 100, 3, 1, 2019, 1, 0, 20, 
  0, 0, 100, 4, 1, 3030, 5, 0, 500, 
  0, 0, 100, 5, 1, 1107, 1, 0, 43, 
  0, 0, 100, 6, 1, 1403, 1, 0, 50, 
  0, 0, 100, 7, 1, 3024, 5, 0, 500, 
  0, 0, 100, 8, 1, 1410, 1, 0, 278, 
  0, 0, 100, 9, 1, 1119, 1, 0, 38, 
  0, 0, 100, 10, 1, 2010, 1, 0, 30, 
  0, 0, 100, 11, 1, 1110, 1, 0, 343, 
  0, 0, 100, 0, 2, 3024, 5, 0, 500, 
  0, 0, 100, 1, 2, 3027, 5, 0, 1750, 
  0, 0, 100, 2, 2, 1211, 1, 0, 50, 
  0, 0, 100, 3, 2, 2005, 1, 0, 20, 
  0, 0, 100, 4, 2, 1510, 1, 0, 338, 
  0, 0, 100, 5, 2, 2021, 1, 0, 20, 
  0, 0, 100, 6, 2, 2002, 1, 0, 20, 
  0, 0, 100, 7, 2, 1307, 1, 0, 43, 
  0, 0, 100, 8, 2, 2007, 1, 0, 30, 
  0, 0, 100, 9, 2, 2015, 1, 0, 30, 
  0, 0, 100, 10, 2, 1602, 1, 0, 50, 
  0, 0, 100, 11, 2, 2018, 1, 0, 20, 
  0, 0, 100, 0, 3, 3024, 5, 0, 500, 
  0, 0, 100, 1, 3, 1207, 1, 0, 43, 
  0, 0, 100, 2, 3, 1612, 1, 0, 60, 
  0, 0, 100, 3, 3, 3008, 5, 0, 500, 
  0, 0, 100, 4, 3, 1609, 1, 0, 43, 
  0, 0, 100, 5, 3, 1611, 1, 0, 343, 
  0, 0, 100, 6, 3, 1306, 1, 0, 283, 
  0, 0, 100, 7, 3, 1102, 1, 0, 334, 
  0, 0, 100, 8, 3, 1118, 1, 0, 338, 
  0, 0, 100, 9, 3, 2012, 1, 0, 20, 
  0, 0, 100, 10, 3, 3023, 5, 0, 500, 
  0, 0, 100, 11, 3, 1511, 1, 0, 38, 
  0, 0, 100, 0, 4, 3024, 5, 0, 500, 
  0, 0, 100, 1, 4, 3027, 5, 0, 1750, 
  0, 0, 100, 2, 4, 1411, 1, 0, 38, 
  0, 0, 100, 3, 4, 2001, 1, 0, 20, 
  0, 0, 100, 4, 4, 1407, 1, 0, 43, 
  0, 0, 100, 5, 4, 2017, 1, 0, 30, 
  0, 0, 100, 6, 4, 1115, 1, 0, 34, 
  0, 0, 100, 7, 4, 1303, 1, 0, 50, 
  0, 0, 100, 8, 4, 1103, 1, 0, 34, 
  0, 0, 100, 9, 4, 1311, 1, 0, 38, 
  0, 0, 100, 10, 4, 1601, 1, 0, 350, 
  0, 0, 100, 11, 4, 2008, 1, 0, 30, 
  0, 0, 100, 0, 5, 3024, 5, 0, 500, 
  0, 0, 100, 1, 5, 3027, 5, 0, 1750, 
  0, 0, 100, 2, 5, 1310, 1, 0, 278, 
  0, 0, 100, 3, 5, 1203, 1, 0, 38, 
  0, 0, 100, 4, 5, 2020, 1, 0, 20, 
  0, 0, 100, 5, 5, 1506, 1, 0, 343, 
  0, 0, 100, 6, 5, 1501, 1, 0, 1950, 
  0, 0, 100, 7, 5, 1006, 1, 0, 30, 
  0, 0, 100, 8, 5, 2006, 1, 0, 20, 
  0, 0, 100, 9, 5, 1402, 1, 0, 290, 
  0, 0, 100, 10, 5, 2013, 1, 0, 20, 
  0, 0, 100, 11, 5, 2004, 1, 0, 20, 
  0, 0, 100, 0, 6, 3024, 5, 0, 500, 
  0, 0, 100, 1, 6, 3027, 5, 0, 1750, 
  0, 0, 100, 2, 6, 1122, 1, 0, 338, 
  0, 0, 100, 3, 6, 1004, 1, 0, 20, 
  0, 0, 100, 4, 6, 1406, 1, 0, 283, 
  0, 0, 100, 5, 6, 3017, 5, 0, 500, 
  0, 0, 100, 6, 6, 2014, 1, 0, 20, 
  0, 0, 100, 7, 6, 2006, 1, 0, 20, 
  0, 0, 100, 8, 6, 1006, 1, 0, 30, 
  0, 0, 100, 9, 6, 3008, 5, 0, 500, 
  0, 0, 100, 10, 6, 1207, 1, 0, 43, 
  0, 0, 100, 11, 6, 2021, 1, 0, 20, 
  0, 0, 100, 0, 7, 3024, 5, 0, 500, 
  0, 0, 100, 1, 7, 3027, 5, 0, 1750, 
  0, 0, 100, 2, 7, 2001, 1, 0, 20, 
  0, 0, 100, 3, 7, 2009, 1, 0, 30, 
  0, 0, 100, 4, 7, 2012, 1, 0, 20, 
  0, 0, 100, 5, 7, 1107, 1, 0, 43, 
  0, 0, 100, 6, 7, 1307, 1, 0, 43, 
  0, 0, 100, 7, 7, 3030, 5, 0, 500, 
  0, 0, 100, 8, 7, 3023, 5, 0, 500, 
  0, 0, 100, 9, 7, 1610, 1, 0, 360, 
  0, 0, 100, 10, 7, 1123, 1, 0, 38, 
  0, 0, 100, 11, 7, 1407, 1, 0, 43, 
  0, 0, 100, 0, 8, 3024, 5, 0, 500, 
  0, 0, 100, 1, 8, 3027, 5, 0, 1750, 
  0, 0, 100, 2, 8, 1119, 1, 0, 38, 
  0, 0, 100, 3, 8, 1005, 1, 0, 30, 
  0, 0, 100, 4, 8, 1507, 1, 0, 43, 
  0, 0, 100, 5, 8, 1004, 1, 0, 20, 
  0, 0, 100, 6, 8, 2015, 1, 0, 30, 
  0, 0, 100, 7, 8, 1511, 1, 0, 38, 
  0, 0, 100, 8, 8, 2018, 1, 0, 20, 
  0, 0, 100, 9, 8, 1103, 1, 0, 34, 
  0, 0, 100, 10, 8, 1411, 1, 0, 38, 
  0, 0, 100, 11, 8, 2020, 1, 0, 20, 
  0, 0, 100, 0, 9, 3024, 5, 0, 500, 
  0, 0, 100, 1, 9, 3027, 5, 0, 1750, 
  0, 0, 100, 2, 9, 1115, 1, 0, 34, 
  0, 0, 100, 3, 9, 1602, 1, 0, 50, 
  0, 0, 100, 4, 9, 1305, 1, 0, 2183, 
  0, 0, 100, 5, 9, 1502, 1, 0, 350, 
  0, 0, 100, 6, 9, 1203, 1, 0, 38, 
  0, 0, 100, 7, 9, 3024, 5, 0, 500, 
  0, 0, 100, 8, 9, 3024, 5, 0, 500, 
  0, 0, 100, 9, 9, 2019, 1, 0, 20, 
  0, 0, 100, 10, 9, 2008, 1, 0, 30, 
  0, 0, 100, 11, 9, 1210, 1, 0, 350, 
  0, 0, 100, 0, 10, 3024, 5, 0, 500, 
  0, 0, 100, 1, 10, 2005, 1, 0, 20, 
  0, 0, 100, 2, 10, 1111, 1, 0, 43, 
  0, 0, 100, 3, 10, 1609, 1, 0, 43, 
  0, 0, 100, 4, 10, 1612, 1, 0, 60, 
  0, 0, 100, 5, 10, 2011, 1, 0, 30, 
  0, 0, 100, 6, 10, 1109, 1, 0, 1143, 
  0, 0, 100, 7, 10, 1503, 1, 0, 50, 
  0, 0, 100, 8, 10, 1211, 1, 0, 50, 
  0, 0, 100, 9, 10, 2016, 1, 0, 30, 
  0, 0, 100, 10, 10, 2010, 1, 0, 30, 
  0, 0, 100, 11, 10, 2007, 1, 0, 30, 
  0, 0, 100, 0, 11, 3024, 5, 0, 500, 
  0, 0, 100, 1, 11, 3027, 5, 0, 1750, 
  0, 0, 100, 2, 11, 2013, 1, 0, 20, 
  0, 0, 100, 3, 11, 3030, 5, 0, 500, 
  0, 0, 100, 4, 11, 1303, 1, 0, 50, 
  0, 0, 100, 5, 11, 3023, 5, 0, 500, 
  0, 0, 100, 6, 11, 2017, 1, 0, 30, 
  0, 0, 100, 7, 11, 1403, 1, 0, 50, 
  0, 0, 100, 8, 11, 2004, 1, 0, 20, 
  0, 0, 100, 9, 11, 1106, 1, 0, 343, 
  0, 0, 100, 10, 11, 2002, 1, 0, 20, 
  0, 0, 100, 11, 11, 1206, 1, 0, 343, 
  1, 0, 100, 0, 0, 3024, 5, 0, 500, 
  1, 0, 100, 1, 0, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 0, 2003, 1, 0, 20, 
  1, 0, 100, 3, 0, 1311, 1, 0, 38, 
  1, 0, 100, 4, 0, 2012, 1, 0, 20, 
  1, 0, 100, 5, 0, 2013, 1, 0, 20, 
  1, 0, 100, 6, 0, 1609, 1, 0, 43, 
  1, 0, 100, 7, 0, 2018, 1, 0, 20, 
  1, 0, 100, 8, 0, 2007, 1, 0, 30, 
  1, 0, 100, 9, 0, 2011, 1, 0, 30, 
  1, 0, 100, 10, 0, 1303, 1, 0, 50, 
  1, 0, 100, 11, 0, 1403, 1, 0, 50, 
  1, 0, 100, 0, 1, 3024, 5, 0, 500, 
  1, 0, 100, 1, 1, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 1, 1307, 1, 0, 43, 
  1, 0, 100, 3, 1, 1612, 1, 0, 60, 
  1, 0, 100, 4, 1, 3011, 5, 0, 250, 
  1, 0, 100, 5, 1, 1411, 1, 0, 38, 
  1, 0, 100, 6, 1, 1203, 1, 0, 38, 
  1, 0, 100, 7, 1, 2006, 1, 0, 20, 
  1, 0, 100, 8, 1, 1202, 1, 0, 338, 
  1, 0, 100, 9, 1, 1602, 1, 0, 50, 
  1, 0, 100, 10, 1, 1111, 1, 0, 43, 
  1, 0, 100, 11, 1, 2003, 1, 0, 20, 
  1, 0, 100, 0, 2, 3024, 5, 0, 500, 
  1, 0, 100, 1, 2, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 2, 2021, 1, 0, 20, 
  1, 0, 100, 3, 2, 1107, 1, 0, 43, 
  1, 0, 100, 4, 2, 1503, 1, 0, 50, 
  1, 0, 100, 5, 2, 2004, 1, 0, 20, 
  1, 0, 100, 6, 2, 3008, 5, 0, 500, 
  1, 0, 100, 7, 2, 1004, 1, 0, 20, 
  1, 0, 100, 8, 2, 1123, 1, 0, 38, 
  1, 0, 100, 9, 2, 2008, 1, 0, 30, 
  1, 0, 100, 10, 2, 1114, 1, 0, 334, 
  1, 0, 100, 11, 2, 1507, 1, 0, 43, 
  1, 0, 100, 0, 3, 3024, 5, 0, 500, 
  1, 0, 100, 1, 3, 1103, 1, 0, 34, 
  1, 0, 100, 2, 3, 1005, 1, 0, 30, 
  1, 0, 100, 3, 3, 2015, 1, 0, 30, 
  1, 0, 100, 4, 3, 1115, 1, 0, 34, 
  1, 0, 100, 5, 3, 2016, 1, 0, 30, 
  1, 0, 100, 6, 3, 2014, 1, 0, 20, 
  1, 0, 100, 7, 3, 1511, 1, 0, 38, 
  1, 0, 100, 8, 3, 2017, 1, 0, 30, 
  1, 0, 100, 9, 3, 2001, 1, 0, 20, 
  1, 0, 100, 10, 3, 1006, 1, 0, 30, 
  1, 0, 100, 11, 3, 1407, 1, 0, 43, 
  1, 0, 100, 0, 4, 3024, 5, 0, 500, 
  1, 0, 100, 1, 4, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 4, 1611, 1, 0, 343, 
  1, 0, 100, 3, 4, 1510, 1, 0, 338, 
  1, 0, 100, 4, 4, 2019, 1, 0, 20, 
  1, 0, 100, 5, 4, 2009, 1, 0, 30, 
  1, 0, 100, 6, 4, 1311, 1, 0, 38, 
  1, 0, 100, 7, 4, 1113, 1, 0, 1134, 
  1, 0, 100, 8, 4, 2020, 1, 0, 20, 
  1, 0, 100, 9, 4, 2005, 1, 0, 20, 
  1, 0, 100, 10, 4, 1119, 1, 0, 38, 
  1, 0, 100, 11, 4, 1606, 1, 0, 2460, 
  1, 0, 100, 0, 5, 3024, 5, 0, 500, 
  1, 0, 100, 1, 5, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 5, 3013, 5, 0, 250, 
  1, 0, 100, 3, 5, 2002, 1, 0, 20, 
  1, 0, 100, 4, 5, 1207, 1, 0, 43, 
  1, 0, 100, 5, 5, 1122, 1, 0, 338, 
  1, 0, 100, 6, 5, 1202, 1, 0, 338, 
  1, 0, 100, 7, 5, 2010, 1, 0, 30, 
  1, 0, 100, 8, 5, 1211, 1, 0, 50, 
  1, 0, 100, 9, 5, 1114, 1, 0, 334, 
  1, 0, 100, 10, 5, 2018, 1, 0, 20, 
  1, 0, 100, 11, 5, 1608, 1, 0, 2443, 
  1, 0, 100, 0, 6, 3024, 5, 0, 500, 
  1, 0, 100, 1, 6, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 6, 1006, 1, 0, 30, 
  1, 0, 100, 3, 6, 1307, 1, 0, 43, 
  1, 0, 100, 4, 6, 1207, 1, 0, 43, 
  1, 0, 100, 5, 6, 2003, 1, 0, 20, 
  1, 0, 100, 6, 6, 1506, 1, 0, 343, 
  1, 0, 100, 7, 6, 1407, 1, 0, 43, 
  1, 0, 100, 8, 6, 1107, 1, 0, 43, 
  1, 0, 100, 9, 6, 2007, 1, 0, 30, 
  1, 0, 100, 10, 6, 2001, 1, 0, 20, 
  1, 0, 100, 11, 6, 1302, 1, 0, 290, 
  1, 0, 100, 0, 7, 3024, 5, 0, 500, 
  1, 0, 100, 1, 7, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 7, 1303, 1, 0, 50, 
  1, 0, 100, 3, 7, 1211, 1, 0, 50, 
  1, 0, 100, 4, 7, 2017, 1, 0, 30, 
  1, 0, 100, 5, 7, 1612, 1, 0, 60, 
  1, 0, 100, 6, 7, 2006, 1, 0, 20, 
  1, 0, 100, 7, 7, 1115, 1, 0, 34, 
  1, 0, 100, 8, 7, 1101, 1, 0, 1134, 
  1, 0, 100, 9, 7, 1005, 1, 0, 30, 
  1, 0, 100, 10, 7, 1610, 1, 0, 360, 
  1, 0, 100, 11, 7, 1102, 1, 0, 334, 
  1, 0, 100, 0, 8, 3024, 5, 0, 500, 
  1, 0, 100, 1, 8, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 8, 1503, 1, 0, 50, 
  1, 0, 100, 3, 8, 2013, 1, 0, 20, 
  1, 0, 100, 4, 8, 1601, 1, 0, 350, 
  1, 0, 100, 5, 8, 1511, 1, 0, 38, 
  1, 0, 100, 6, 8, 1309, 1, 0, 2178, 
  1, 0, 100, 7, 8, 2012, 1, 0, 20, 
  1, 0, 100, 8, 8, 1118, 1, 0, 338, 
  1, 0, 100, 9, 8, 3017, 5, 0, 500, 
  1, 0, 100, 10, 8, 1410, 1, 0, 278, 
  1, 0, 100, 11, 8, 2005, 1, 0, 20, 
  1, 0, 100, 0, 9, 3024, 5, 0, 500, 
  1, 0, 100, 1, 9, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 9, 3010, 5, 0, 250, 
  1, 0, 100, 3, 9, 2016, 1, 0, 30, 
  1, 0, 100, 4, 9, 1103, 1, 0, 34, 
  1, 0, 100, 5, 9, 2010, 1, 0, 30, 
  1, 0, 100, 6, 9, 2014, 1, 0, 20, 
  1, 0, 100, 7, 9, 1004, 1, 0, 20, 
  1, 0, 100, 8, 9, 2008, 1, 0, 30, 
  1, 0, 100, 9, 9, 1507, 1, 0, 43, 
  1, 0, 100, 10, 9, 2004, 1, 0, 20, 
  1, 0, 100, 11, 9, 1105, 1, 0, 1143, 
  1, 0, 100, 0, 10, 3024, 5, 0, 500, 
  1, 0, 100, 1, 10, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 10, 1502, 1, 0, 350, 
  1, 0, 100, 3, 10, 1311, 1, 0, 38, 
  1, 0, 100, 4, 10, 2021, 1, 0, 20, 
  1, 0, 100, 5, 10, 1110, 1, 0, 343, 
  1, 0, 100, 6, 10, 1602, 1, 0, 50, 
  1, 0, 100, 7, 10, 2002, 1, 0, 20, 
  1, 0, 100, 8, 10, 3008, 5, 0, 500, 
  1, 0, 100, 9, 10, 1403, 1, 0, 50, 
  1, 0, 100, 10, 10, 2020, 1, 0, 20, 
  1, 0, 100, 11, 10, 1106, 1, 0, 343, 
  1, 0, 100, 0, 11, 3024, 5, 0, 500, 
  1, 0, 100, 1, 11, 3027, 5, 0, 1750, 
  1, 0, 100, 2, 11, 1609, 1, 0, 43, 
  1, 0, 100, 3, 11, 1123, 1, 0, 38, 
  1, 0, 100, 4, 11, 2009, 1, 0, 30, 
  1, 0, 100, 5, 11, 1310, 1, 0, 278, 
  1, 0, 100, 6, 11, 1402, 1, 0, 290, 
  1, 0, 100, 7, 11, 2019, 1, 0, 20, 
  1, 0, 100, 8, 11, 1111, 1, 0, 43, 
  1, 0, 100, 9, 11, 1210, 1, 0, 350, 
  1, 0, 100, 10, 11, 2011, 1, 0, 30, 
  1, 0, 100, 11, 11, 1411, 1, 0, 38, 
  2, 0, 100, 0, 0, 3024, 5, 0, 500, 
  2, 0, 100, 1, 0, 3027, 5, 0, 1750, 
  2, 0, 100, 2, 0, 1119, 1, 0, 38, 
  2, 0, 100, 3, 0, 3017, 5, 0, 500, 
  2, 0, 100, 4, 0, 1206, 1, 0, 343, 
  2, 0, 100, 5, 0, 1306, 1, 0, 283, 
  2, 0, 100, 6, 0, 1203, 1, 0, 38, 
  2, 0, 100, 7, 0, 2015, 1, 0, 30, 
  2, 0, 100, 8, 0, 1406, 1, 0, 283, 
  2, 0, 100, 9, 0, 2011, 1, 0, 30, 
  2, 0, 100, 10, 0, 1004, 1, 0, 20, 
  2, 0, 100, 11, 0, 2015, 1, 0, 30, 
  2, 0, 100, 0, 1, 3024, 5, 0, 500, 
  2, 0, 100, 1, 1, 3027, 5, 0, 1750, 
  2, 0, 100, 2, 1, 1107, 1, 0, 43, 
  2, 0, 100, 3, 1, 1502, 1, 0, 350, 
  2, 0, 100, 4, 1, 1511, 1, 0, 38, 
  2, 0, 100, 5, 1, 1114, 1, 0, 334, 
  2, 0, 100, 6, 1, 1210, 1, 0, 350, 
  2, 0, 100, 7, 1, 3024, 5, 0, 500, 
  2, 0, 100, 8, 1, 1203, 1, 0, 38, 
  2, 0, 100, 9, 1, 1507, 1, 0, 43, 
  2, 0, 100, 10, 1, 2017, 1, 0, 30, 
  2, 0, 100, 11, 1, 1006, 1, 0, 30, 
  2, 0, 100, 0, 2, 3024, 5, 0, 500, 
  2, 0, 100, 1, 2, 3027, 5, 0, 1750, 
  2, 0, 100, 2, 2, 1311, 1, 0, 38, 
  2, 0, 100, 3, 2, 1103, 1, 0, 34, 
  2, 0, 100, 4, 2, 1123, 1, 0, 38, 
  2, 0, 100, 5, 2, 2012, 1, 0, 20, 
  2, 0, 100, 6, 2, 2013, 1, 0, 20, 
  2, 0, 100, 7, 2, 2020, 1, 0, 20, 
  2, 0, 100, 8, 2, 1119, 1, 0, 38, 
  2, 0, 100, 9, 2, 1302, 1, 0, 290, 
  2, 0, 100, 10, 2, 1407, 1, 0, 43, 
  2, 0, 100, 11, 2, 2007, 1, 0, 30, 
  2, 0, 100, 0, 3, 3024, 5, 0, 500, 
  2, 0, 100, 1, 3, 3027, 5, 0, 1750, 
  2, 0, 100, 2, 3, 1411, 1, 0, 38, 
  2, 0, 100, 3, 3, 1307, 1, 0, 43, 
  2, 0, 100, 4, 3, 1402, 1, 0, 290, 
  2, 0, 100, 5, 3, 3023, 5, 0, 500, 
  2, 0, 100, 6, 3, 2001, 1, 0, 20, 
  2, 0, 100, 7, 3, 1211, 1, 0, 50, 
  2, 0, 100, 8, 3, 1118, 1, 0, 338, 
  2, 0, 100, 9, 3, 2003, 1, 0, 20, 
  2, 0, 100, 10, 3, 1121, 1, 0, 1138, 
  2, 0, 100, 11, 3, 1602, 1, 0, 50, 
  2, 0, 100, 0, 4, 3024, 5, 0, 500, 
  2, 0, 100, 1, 4, 3027, 5, 0, 1750, 
  2, 0, 100, 2, 4, 3030, 5, 0, 500, 
  2, 0, 100, 3, 4, 1106, 1, 0, 343, 
  2, 0, 100, 4, 4, 2016, 1, 0, 30, 
  2, 0, 100, 5, 4, 1115, 1, 0, 34, 
  2, 0, 100, 6, 4, 1306, 1, 0, 283, 
  2, 0, 100, 7, 4, 1406, 1, 0, 283, 
  2, 0, 100, 8, 4, 2010, 1, 0, 30, 
  2, 0, 100, 9, 4, 2021, 1, 0, 20, 
  2, 0, 100, 10, 4, 1005, 1, 0, 30, 
  2, 0, 100, 11, 4, 2014, 1, 0, 20, 
  2, 0, 100, 0, 5, 3024, 5, 0, 500, 
  2, 0, 100, 1, 5, 3027, 5, 0, 1750, 
  2, 0, 100, 2, 5, 1503, 1, 0, 50, 
  2, 0, 100, 3, 5, 2005, 1, 0, 20, 
  2, 0, 100, 4, 5, 2018, 1, 0, 20, 
  2, 0, 100, 5, 5, 1610, 1, 0, 360, 
  2, 0, 100, 6, 5, 1403, 1, 0, 50, 
  2, 0, 100, 7, 5, 1207, 1, 0, 43, 
  2, 0, 100, 8, 5, 2004, 1, 0, 20, 
  2, 0, 100, 9, 5, 2002, 1, 0, 20, 
  2, 0, 100, 10, 5, 2019, 1, 0, 20, 
  2, 0, 100, 11, 5, 1117, 1, 0, 1138, 
  2, 0, 100, 0, 6, 3024, 5, 0, 500, 
  2, 0, 100, 1, 6, 3027, 5, 0, 1750, 
  2, 0, 100, 2, 6, 2006, 1, 0, 20, 
  2, 0, 100, 3, 6, 1206, 1, 0, 343, 
  2, 0, 100, 4, 6, 1310, 1, 0, 278, 
  2, 0, 100, 5, 6, 2009, 1, 0, 30, 
  2, 0, 100, 6, 6, 1110, 1, 0, 343, 
  2, 0, 100, 7, 6, 3023, 5, 0, 500, 
  2, 0, 100, 8, 6, 1612, 1, 0, 60, 
  2, 0, 100, 9, 6, 1506, 1, 0, 343, 
  2, 0, 100, 10, 6, 1303, 1, 0, 50, 
  2, 0, 100, 11, 6, 2008, 1, 0, 30, 
  2, 0, 100, 0, 7, 3024, 5, 0, 500, 
  2, 0, 100, 1, 7, 1609, 1, 0, 43, 
  2, 0, 100, 2, 7, 1111, 1, 0, 43, 
  2, 0, 100, 3, 7, 1307, 1, 0, 43, 
  2, 0, 100, 4, 7, 1122, 1, 0, 338, 
  2, 0, 100, 5, 7, 3024, 5, 0, 500, 
  2, 0, 100, 6, 7, 1005, 1, 0, 30, 
  2, 0, 100, 7, 7, 1503, 1, 0, 50, 
  2, 0, 100, 8, 7, 2001, 1, 0, 20, 
  2, 0, 100, 9, 7, 1407, 1, 0, 43, 
  2, 0, 100, 10, 7, 2007, 1, 0, 30, 
  2, 0, 100, 11, 7, 1410, 1, 0, 278, 
  2, 0, 100, 0, 8, 3024, 5, 0, 500, 
  2, 0, 100, 1, 8, 1612, 1, 0, 60, 
  2, 0, 100, 2, 8, 1609, 1, 0, 43, 
  2, 0, 100, 3, 8, 1107, 1, 0, 43, 
  2, 0, 100, 4, 8, 1211, 1, 0, 50, 
  2, 0, 100, 5, 8, 2018, 1, 0, 20, 
  2, 0, 100, 6, 8, 1102, 1, 0, 334, 
  2, 0, 100, 7, 8, 1601, 1, 0, 350, 
  2, 0, 100, 8, 8, 1311, 1, 0, 38, 
  2, 0, 100, 9, 8, 1611, 1, 0, 343, 
  2, 0, 100, 10, 8, 1411, 1, 0, 38, 
  2, 0, 100, 11, 8, 2002, 1, 0, 20, 
  2, 0, 100, 0, 9, 3024, 5, 0, 500, 
  2, 0, 100, 1, 9, 1507, 1, 0, 43, 
  2, 0, 100, 2, 9, 1115, 1, 0, 34, 
  2, 0, 100, 3, 9, 1202, 1, 0, 338, 
  2, 0, 100, 4, 9, 1119, 1, 0, 38, 
  2, 0, 100, 5, 9, 1403, 1, 0, 50, 
  2, 0, 100, 6, 9, 2011, 1, 0, 30, 
  2, 0, 100, 7, 9, 3030, 5, 0, 500, 
  2, 0, 100, 8, 9, 1510, 1, 0, 338, 
  2, 0, 100, 9, 9, 1610, 1, 0, 360, 
  2, 0, 100, 10, 9, 2006, 1, 0, 20, 
  2, 0, 100, 11, 9, 1302, 1, 0, 290, 
  2, 0, 100, 0, 10, 3024, 5, 0, 500, 
  2, 0, 100, 1, 10, 3027, 5, 0, 1750, 
  2, 0, 100, 2, 10, 2010, 1, 0, 30, 
  2, 0, 100, 3, 10, 1207, 1, 0, 43, 
  2, 0, 100, 4, 10, 2020, 1, 0, 20, 
  2, 0, 100, 5, 10, 1103, 1, 0, 34, 
  2, 0, 100, 6, 10, 1510, 1, 0, 338, 
  2, 0, 100, 7, 10, 2014, 1, 0, 20, 
  2, 0, 100, 8, 10, 2005, 1, 0, 20, 
  2, 0, 100, 9, 10, 1004, 1, 0, 20, 
  2, 0, 100, 10, 10, 2019, 1, 0, 20, 
  2, 0, 100, 11, 10, 2021, 1, 0, 20, 
  2, 0, 100, 0, 11, 3024, 5, 0, 500, 
  2, 0, 100, 1, 11, 3027, 5, 0, 1750, 
  2, 0, 100, 2, 11, 1511, 1, 0, 38, 
  2, 0, 100, 3, 11, 2008, 1, 0, 30, 
  2, 0, 100, 4, 11, 2017, 1, 0, 30, 
  2, 0, 100, 5, 11, 3017, 5, 0, 500, 
  2, 0, 100, 6, 11, 1202, 1, 0, 338, 
  2, 0, 100, 7, 11, 2004, 1, 0, 20, 
  2, 0, 100, 8, 11, 2009, 1, 0, 30, 
  2, 0, 100, 9, 11, 1006, 1, 0, 30, 
  2, 0, 100, 10, 11, 2016, 1, 0, 30, 
  2, 0, 100, 11, 11, 1602, 1, 0, 50, 
  3, 0, 100, 0, 0, 3024, 5, 0, 500, 
  3, 0, 100, 1, 0, 2015, 1, 0, 30, 
  3, 0, 100, 2, 0, 1506, 1, 0, 343, 
  3, 0, 100, 3, 0, 1303, 1, 0, 50, 
  3, 0, 100, 4, 0, 1203, 1, 0, 38, 
  3, 0, 100, 5, 0, 1123, 1, 0, 38, 
  3, 0, 100, 6, 0, 2012, 1, 0, 20, 
  3, 0, 100, 7, 0, 1110, 1, 0, 343, 
  3, 0, 100, 8, 0, 2013, 1, 0, 20, 
  3, 0, 100, 9, 0, 1111, 1, 0, 43, 
  3, 0, 100, 10, 0, 2003, 1, 0, 20, 
  3, 0, 100, 11, 0, 1106, 1, 0, 343, 
  3, 0, 100, 0, 1, 3024, 5, 0, 500, 
  3, 0, 100, 1, 1, 3027, 5, 0, 1750, 
  3, 0, 100, 2, 1, 1311, 1, 0, 38, 
  3, 0, 100, 3, 1, 3014, 5, 0, 250, 
  3, 0, 100, 4, 1, 1004, 1, 0, 20, 
  3, 0, 100, 5, 1, 3022, 5, 0, 250, 
  3, 0, 100, 6, 1, 3008, 5, 0, 500, 
  3, 0, 100, 7, 1, 1602, 1, 0, 50, 
  3, 0, 100, 8, 1, 1409, 1, 0, 1678, 
  3, 0, 100, 9, 1, 2012, 1, 0, 20, 
  3, 0, 100, 10, 1, 2001, 1, 0, 20, 
  3, 0, 100, 11, 1, 1601, 1, 0, 350, 
  3, 0, 100, 0, 2, 3024, 5, 0, 500, 
  3, 0, 100, 1, 2, 3027, 5, 0, 1750, 
  3, 0, 100, 2, 2, 3008, 5, 0, 500, 
  3, 0, 100, 3, 2, 1111, 1, 0, 43, 
  3, 0, 100, 4, 2, 1203, 1, 0, 38, 
  3, 0, 100, 5, 2, 2013, 1, 0, 20, 
  3, 0, 100, 6, 2, 3007, 5, 0, 250, 
  3, 0, 100, 7, 2, 2019, 1, 0, 20, 
  3, 0, 100, 8, 2, 1411, 1, 0, 38, 
  3, 0, 100, 9, 2, 1507, 1, 0, 43, 
  3, 0, 100, 10, 2, 1205, 1, 0, 2443, 
  3, 0, 100, 11, 2, 1609, 1, 0, 43, 
  3, 0, 100, 0, 3, 3024, 5, 0, 500, 
  3, 0, 100, 1, 3, 1119, 1, 0, 38, 
  3, 0, 100, 2, 3, 1502, 1, 0, 350, 
  3, 0, 100, 3, 3, 2007, 1, 0, 30, 
  3, 0, 100, 4, 3, 2003, 1, 0, 20, 
  3, 0, 100, 5, 3, 2004, 1, 0, 20, 
  3, 0, 100, 6, 3, 1303, 1, 0, 50, 
  3, 0, 100, 7, 3, 2002, 1, 0, 20, 
  3, 0, 100, 8, 3, 1503, 1, 0, 50, 
  3, 0, 100, 9, 3, 1122, 1, 0, 338, 
  3, 0, 100, 10, 3, 2009, 1, 0, 30, 
  3, 0, 100, 11, 3, 1403, 1, 0, 50, 
  3, 0, 100, 0, 4, 3024, 5, 0, 500, 
  3, 0, 100, 1, 4, 3027, 5, 0, 1750, 
  3, 0, 100, 2, 4, 1410, 1, 0, 278, 
  3, 0, 100, 3, 4, 2021, 1, 0, 20, 
  3, 0, 100, 4, 4, 2015, 1, 0, 30, 
  3, 0, 100, 5, 4, 1401, 1, 0, 1690, 
  3, 0, 100, 6, 4, 1211, 1, 0, 50, 
  3, 0, 100, 7, 4, 1006, 1, 0, 30, 
  3, 0, 100, 8, 4, 1407, 1, 0, 43, 
  3, 0, 100, 9, 4, 2008, 1, 0, 30, 
  3, 0, 100, 10, 4, 1306, 1, 0, 283, 
  3, 0, 100, 11, 4, 1301, 1, 0, 2190, 
  3, 0, 100, 0, 5, 3024, 5, 0, 500, 
  3, 0, 100, 1, 5, 3027, 5, 0, 1750, 
  3, 0, 100, 2, 5, 1115, 1, 0, 34, 
  3, 0, 100, 3, 5, 2014, 1, 0, 20, 
  3, 0, 100, 4, 5, 1612, 1, 0, 60, 
  3, 0, 100, 5, 5, 1310, 1, 0, 278, 
  3, 0, 100, 6, 5, 2005, 1, 0, 20, 
  3, 0, 100, 7, 5, 1307, 1, 0, 43, 
  3, 0, 100, 8, 5, 1511, 1, 0, 38, 
  3, 0, 100, 9, 5, 1107, 1, 0, 43, 
  3, 0, 100, 10, 5, 2018, 1, 0, 20, 
  3, 0, 100, 11, 5, 2017, 1, 0, 30, 
  3, 0, 100, 0, 6, 3024, 5, 0, 500, 
  3, 0, 100, 1, 6, 3027, 5, 0, 1750, 
  3, 0, 100, 2, 6, 1209, 1, 0, 1950, 
  3, 0, 100, 3, 6, 2006, 1, 0, 20, 
  3, 0, 100, 4, 6, 1102, 1, 0, 334, 
  3, 0, 100, 5, 6, 1123, 1, 0, 38, 
  3, 0, 100, 6, 6, 1005, 1, 0, 30, 
  3, 0, 100, 7, 6, 1206, 1, 0, 343, 
  3, 0, 100, 8, 6, 1611, 1, 0, 343, 
  3, 0, 100, 9, 6, 1210, 1, 0, 350, 
  3, 0, 100, 10, 6, 1207, 1, 0, 43, 
  3, 0, 100, 11, 6, 1406, 1, 0, 283, 
  3, 0, 100, 0, 7, 3024, 5, 0, 500, 
  3, 0, 100, 1, 7, 1103, 1, 0, 34, 
  3, 0, 100, 2, 7, 2010, 1, 0, 30, 
  3, 0, 100, 3, 7, 1114, 1, 0, 334, 
  3, 0, 100, 4, 7, 2016, 1, 0, 30, 
  3, 0, 100, 5, 7, 2011, 1, 0, 30, 
  3, 0, 100, 6, 7, 2020, 1, 0, 20, 
  3, 0, 100, 7, 7, 1118, 1, 0, 338, 
  3, 0, 100, 8, 7, 2008, 1, 0, 30, 
  3, 0, 100, 9, 7, 1402, 1, 0, 290, 
  3, 0, 100, 10, 7, 1405, 1, 0, 1683, 
  3, 0, 100, 11, 7, 2006, 1, 0, 20, 
  3, 0, 100, 0, 8, 3024, 5, 0, 500, 
  3, 0, 100, 1, 8, 3027, 5, 0, 1750, 
  3, 0, 100, 2, 8, 1502, 1, 0, 350, 
  3, 0, 100, 3, 8, 1610, 1, 0, 360, 
  3, 0, 100, 4, 8, 1506, 1, 0, 343, 
  3, 0, 100, 5, 8, 1410, 1, 0, 278, 
  3, 0, 100, 6, 8, 1203, 1, 0, 38, 
  3, 0, 100, 7, 8, 1302, 1, 0, 290, 
  3, 0, 100, 8, 8, 1406, 1, 0, 283, 
  3, 0, 100, 9, 8, 2010, 1, 0, 30, 
  3, 0, 100, 10, 8, 2018, 1, 0, 20, 
  3, 0, 100, 11, 8, 1503, 1, 0, 50, 
  3, 0, 100, 0, 9, 3024, 5, 0, 500, 
  3, 0, 100, 1, 9, 3027, 5, 0, 1750, 
  3, 0, 100, 2, 9, 1115, 1, 0, 34, 
  3, 0, 100, 3, 9, 1307, 1, 0, 43, 
  3, 0, 100, 4, 9, 3015, 5, 0, 250, 
  3, 0, 100, 5, 9, 2007, 1, 0, 30, 
  3, 0, 100, 6, 9, 1106, 1, 0, 343, 
  3, 0, 100, 7, 9, 2020, 1, 0, 20, 
  3, 0, 100, 8, 9, 1103, 1, 0, 34, 
  3, 0, 100, 9, 9, 2017, 1, 0, 30, 
  3, 0, 100, 10, 9, 1310, 1, 0, 278, 
  3, 0, 100, 11, 9, 2009, 1, 0, 30, 
  3, 0, 100, 0, 10, 3024, 5, 0, 500, 
  3, 0, 100, 1, 10, 3027, 5, 0, 1750, 
  3, 0, 100, 2, 10, 2021, 1, 0, 20, 
  3, 0, 100, 3, 10, 1122, 1, 0, 338, 
  3, 0, 100, 4, 10, 2003, 1, 0, 20, 
  3, 0, 100, 5, 10, 1609, 1, 0, 43, 
  3, 0, 100, 6, 10, 2012, 1, 0, 20, 
  3, 0, 100, 7, 10, 1602, 1, 0, 50, 
  3, 0, 100, 8, 10, 1511, 1, 0, 38, 
  3, 0, 100, 9, 10, 1004, 1, 0, 20, 
  3, 0, 100, 10, 10, 1507, 1, 0, 43, 
  3, 0, 100, 11, 10, 1612, 1, 0, 60, 
  3, 0, 100, 0, 11, 3024, 5, 0, 500, 
  3, 0, 100, 1, 11, 1107, 1, 0, 43, 
  3, 0, 100, 2, 11, 2001, 1, 0, 20, 
  3, 0, 100, 3, 11, 3016, 5, 0, 250, 
  3, 0, 100, 4, 11, 2004, 1, 0, 20, 
  3, 0, 100, 5, 11, 1005, 1, 0, 30, 
  3, 0, 100, 6, 11, 3030, 5, 0, 500, 
  3, 0, 100, 7, 11, 1211, 1, 0, 50, 
  3, 0, 100, 8, 11, 1411, 1, 0, 38, 
  3, 0, 100, 9, 11, 2015, 1, 0, 30, 
  3, 0, 100, 10, 11, 1111, 1, 0, 43, 
  3, 0, 100, 11, 11, 1201, 1, 0, 2438, 
  4, 0, 100, 0, 0, 3024, 5, 0, 500, 
  4, 0, 100, 1, 0, 3027, 5, 0, 1750, 
  4, 0, 100, 2, 0, 2014, 1, 0, 20, 
  4, 0, 100, 3, 0, 1407, 1, 0, 43, 
  4, 0, 100, 4, 0, 1006, 1, 0, 30, 
  4, 0, 100, 5, 0, 3017, 5, 0, 500, 
  4, 0, 100, 6, 0, 1311, 1, 0, 38, 
  4, 0, 100, 7, 0, 1210, 1, 0, 350, 
  4, 0, 100, 8, 0, 2013, 1, 0, 20, 
  4, 0, 100, 9, 0, 2005, 1, 0, 20, 
  4, 0, 100, 10, 0, 1403, 1, 0, 50, 
  4, 0, 100, 11, 0, 2002, 1, 0, 20, 
  4, 0, 100, 0, 1, 3024, 5, 0, 500, 
  4, 0, 100, 1, 1, 3027, 5, 0, 1750, 
  4, 0, 100, 2, 1, 1303, 1, 0, 50, 
  4, 0, 100, 3, 1, 2019, 1, 0, 20, 
  4, 0, 100, 4, 1, 3023, 5, 0, 500, 
  4, 0, 100, 5, 1, 2011, 1, 0, 30, 
  4, 0, 100, 6, 1, 1207, 1, 0, 43, 
  4, 0, 100, 7, 1, 1123, 1, 0, 38, 
  4, 0, 100, 8, 1, 1119, 1, 0, 38, 
  4, 0, 100, 9, 1, 2016, 1, 0, 30, 
  4, 0, 100, 10, 1, 1102, 1, 0, 334, 
  4, 0, 100, 11, 1, 2008, 1, 0, 30, 
  4, 0, 100, 0, 2, 3024, 5, 0, 500, 
  4, 0, 100, 1, 2, 3027, 5, 0, 1750, 
  4, 0, 100, 2, 2, 1601, 1, 0, 350, 
  4, 0, 100, 3, 2, 1006, 1, 0, 30, 
  4, 0, 100, 4, 2, 1411, 1, 0, 38, 
  4, 0, 100, 5, 2, 1510, 1, 0, 338, 
  4, 0, 100, 6, 2, 1115, 1, 0, 34, 
  4, 0, 100, 7, 2, 1306, 1, 0, 283, 
  4, 0, 100, 8, 2, 1118, 1, 0, 338, 
  4, 0, 100, 9, 2, 2020, 1, 0, 20, 
  4, 0, 100, 10, 2, 2011, 1, 0, 30, 
  4, 0, 100, 11, 2, 1203, 1, 0, 38, 
  4, 0, 100, 0, 3, 3024, 5, 0, 500, 
  4, 0, 100, 1, 3, 3027, 5, 0, 1750, 
  4, 0, 100, 2, 3, 2006, 1, 0, 20, 
  4, 0, 100, 3, 3, 1202, 1, 0, 338, 
  4, 0, 100, 4, 3, 1207, 1, 0, 43, 
  4, 0, 100, 5, 3, 2009, 1, 0, 30, 
  4, 0, 100, 6, 3, 3024, 5, 0, 500, 
  4, 0, 100, 7, 3, 1206, 1, 0, 343, 
  4, 0, 100, 8, 3, 1604, 1, 0, 2450, 
  4, 0, 100, 9, 3, 1503, 1, 0, 50, 
  4, 0, 100, 10, 3, 1005, 1, 0, 30, 
  4, 0, 100, 11, 3, 1403, 1, 0, 50, 
  4, 0, 100, 0, 4, 3024, 5, 0, 500, 
  4, 0, 100, 1, 4, 1602, 1, 0, 50, 
  4, 0, 100, 2, 4, 1402, 1, 0, 290, 
  4, 0, 100, 3, 4, 1303, 1, 0, 50, 
  4, 0, 100, 4, 4, 1611, 1, 0, 343, 
  4, 0, 100, 5, 4, 2013, 1, 0, 20, 
  4, 0, 100, 6, 4, 1004, 1, 0, 20, 
  4, 0, 100, 7, 4, 1114, 1, 0, 334, 
  4, 0, 100, 8, 4, 1110, 1, 0, 343, 
  4, 0, 100, 9, 4, 1102, 1, 0, 334, 
  4, 0, 100, 10, 4, 1110, 1, 0, 343, 
  4, 0, 100, 11, 4, 1510, 1, 0, 338, 
  4, 0, 100, 0, 5, 3024, 5, 0, 500, 
  4, 0, 100, 1, 5, 3027, 5, 0, 1750, 
  4, 0, 100, 2, 5, 1610, 1, 0, 360, 
  4, 0, 100, 3, 5, 2021, 1, 0, 20, 
  4, 0, 100, 4, 5, 2002, 1, 0, 20, 
  4, 0, 100, 5, 5, 2014, 1, 0, 20, 
  4, 0, 100, 6, 5, 2001, 1, 0, 20, 
  4, 0, 100, 7, 5, 1612, 1, 0, 60, 
  4, 0, 100, 8, 5, 2017, 1, 0, 30, 
  4, 0, 100, 9, 5, 1114, 1, 0, 334, 
  4, 0, 100, 10, 5, 3024, 5, 0, 500, 
  4, 0, 100, 11, 5, 1123, 1, 0, 38, 
  4, 0, 100, 0, 6, 3024, 5, 0, 500, 
  4, 0, 100, 1, 6, 2004, 1, 0, 20, 
  4, 0, 100, 2, 6, 1511, 1, 0, 38, 
  4, 0, 100, 3, 6, 2005, 1, 0, 20, 
  4, 0, 100, 4, 6, 2007, 1, 0, 30, 
  4, 0, 100, 5, 6, 1211, 1, 0, 50, 
  4, 0, 100, 6, 6, 2016, 1, 0, 30, 
  4, 0, 100, 7, 6, 2003, 1, 0, 20, 
  4, 0, 100, 8, 6, 1107, 1, 0, 43, 
  4, 0, 100, 9, 6, 1118, 1, 0, 338, 
  4, 0, 100, 10, 6, 1106, 1, 0, 343, 
  4, 0, 100, 11, 6, 1609, 1, 0, 43, 
  4, 0, 100, 0, 7, 3024, 5, 0, 500, 
  4, 0, 100, 1, 7, 3027, 5, 0, 1750, 
  4, 0, 100, 2, 7, 1111, 1, 0, 43, 
  4, 0, 100, 3, 7, 3008, 5, 0, 500, 
  4, 0, 100, 4, 7, 1507, 1, 0, 43, 
  4, 0, 100, 5, 7, 1103, 1, 0, 34, 
  4, 0, 100, 6, 7, 1307, 1, 0, 43, 
  4, 0, 100, 7, 7, 1311, 1, 0, 38, 
  4, 0, 100, 8, 7, 1407, 1, 0, 43, 
  4, 0, 100, 9, 7, 1509, 1, 0, 1938, 
  4, 0, 100, 10, 7, 2015, 1, 0, 30, 
  4, 0, 100, 11, 7, 2010, 1, 0, 30, 
  4, 0, 100, 0, 8, 3024, 5, 0, 500, 
  4, 0, 100, 1, 8, 2018, 1, 0, 20, 
  4, 0, 100, 2, 8, 2012, 1, 0, 20, 
  4, 0, 100, 3, 8, 1506, 1, 0, 343, 
  4, 0, 100, 4, 8, 1119, 1, 0, 38, 
  4, 0, 100, 5, 8, 2019, 1, 0, 20, 
  4, 0, 100, 6, 8, 2017, 1, 0, 30, 
  4, 0, 100, 7, 8, 1111, 1, 0, 43, 
  4, 0, 100, 8, 8, 2015, 1, 0, 30, 
  4, 0, 100, 9, 8, 2002, 1, 0, 20, 
  4, 0, 100, 10, 8, 2013, 1, 0, 20, 
  4, 0, 100, 11, 8, 1005, 1, 0, 30, 
  4, 0, 100, 0, 9, 3024, 5, 0, 500, 
  4, 0, 100, 1, 9, 3027, 5, 0, 1750, 
  4, 0, 100, 2, 9, 1103, 1, 0, 34, 
  4, 0, 100, 3, 9, 1006, 1, 0, 30, 
  4, 0, 100, 4, 9, 1202, 1, 0, 338, 
  4, 0, 100, 5, 9, 1211, 1, 0, 50, 
  4, 0, 100, 6, 9, 2021, 1, 0, 20, 
  4, 0, 100, 7, 9, 1505, 1, 0, 1943, 
  4, 0, 100, 8, 9, 1115, 1, 0, 34, 
  4, 0, 100, 9, 9, 2014, 1, 0, 20, 
  4, 0, 100, 10, 9, 1407, 1, 0, 43, 
  4, 0, 100, 11, 9, 1107, 1, 0, 43, 
  4, 0, 100, 0, 10, 3024, 5, 0, 500, 
  4, 0, 100, 1, 10, 3027, 5, 0, 1750, 
  4, 0, 100, 2, 10, 2004, 1, 0, 20, 
  4, 0, 100, 3, 10, 3015, 5, 0, 250, 
  4, 0, 100, 4, 10, 2018, 1, 0, 20, 
  4, 0, 100, 5, 10, 1511, 1, 0, 38, 
  4, 0, 100, 6, 10, 1303, 1, 0, 50, 
  4, 0, 100, 7, 10, 1119, 1, 0, 38, 
  4, 0, 100, 8, 10, 1411, 1, 0, 38, 
  4, 0, 100, 9, 10, 1507, 1, 0, 43, 
  4, 0, 100, 10, 10, 1203, 1, 0, 38, 
  4, 0, 100, 11, 10, 1207, 1, 0, 43, 
  4, 0, 100, 0, 11, 3024, 5, 0, 500, 
  4, 0, 100, 1, 11, 3027, 5, 0, 1750, 
  4, 0, 100, 2, 11, 2006, 1, 0, 20, 
  4, 0, 100, 3, 11, 2019, 1, 0, 20, 
  4, 0, 100, 4, 11, 1123, 1, 0, 38, 
  4, 0, 100, 5, 11, 2010, 1, 0, 30, 
  4, 0, 100, 6, 11, 1311, 1, 0, 38, 
  4, 0, 100, 7, 11, 1609, 1, 0, 43, 
  4, 0, 100, 8, 11, 2009, 1, 0, 30, 
  4, 0, 100, 9, 11, 1004, 1, 0, 20, 
  4, 0, 100, 10, 11, 2001, 1, 0, 20, 
  4, 0, 100, 11, 11, 2011, 1, 0, 30, 
  5, 0, 100, 0, 0, 3024, 5, 0, 500, 
  5, 0, 100, 1, 0, 1503, 1, 0, 50, 
  5, 0, 100, 2, 0, 3007, 5, 0, 250, 
  5, 0, 100, 3, 0, 1403, 1, 0, 50, 
  5, 0, 100, 4, 0, 1306, 1, 0, 283, 
  5, 0, 100, 5, 0, 1602, 1, 0, 50, 
  5, 0, 100, 6, 0, 2016, 1, 0, 30, 
  5, 0, 100, 7, 0, 2005, 1, 0, 20, 
  5, 0, 100, 8, 0, 1611, 1, 0, 343, 
  5, 0, 100, 9, 0, 2020, 1, 0, 20, 
  5, 0, 100, 10, 0, 1509, 1, 0, 1938, 
  5, 0, 100, 11, 0, 2008, 1, 0, 30, 
  5, 0, 100, 0, 1, 3024, 5, 0, 500, 
  5, 0, 100, 1, 1, 3027, 5, 0, 1750, 
  5, 0, 100, 2, 1, 1307, 1, 0, 43, 
  5, 0, 100, 3, 1, 2007, 1, 0, 30, 
  5, 0, 100, 4, 1, 2003, 1, 0, 20, 
  5, 0, 100, 5, 1, 1612, 1, 0, 60, 
  5, 0, 100, 6, 1, 1302, 1, 0, 290, 
  5, 0, 100, 7, 1, 2012, 1, 0, 20, 
  5, 0, 100, 8, 1, 1403, 1, 0, 50, 
  5, 0, 100, 9, 1, 1119, 1, 0, 38, 
  5, 0, 100, 10, 1, 1502, 1, 0, 350, 
  5, 0, 100, 11, 1, 2007, 1, 0, 30, 
  5, 0, 100, 0, 2, 3024, 5, 0, 500, 
  5, 0, 100, 1, 2, 3027, 5, 0, 1750, 
  5, 0, 100, 2, 2, 2021, 1, 0, 20, 
  5, 0, 100, 3, 2, 1602, 1, 0, 50, 
  5, 0, 100, 4, 2, 2002, 1, 0, 20, 
  5, 0, 100, 5, 2, 1123, 1, 0, 38, 
  5, 0, 100, 6, 2, 1203, 1, 0, 38, 
  5, 0, 100, 7, 2, 1115, 1, 0, 34, 
  5, 0, 100, 8, 2, 2019, 1, 0, 20, 
  5, 0, 100, 9, 2, 1407, 1, 0, 43, 
  5, 0, 100, 10, 2, 2020, 1, 0, 20, 
  5, 0, 100, 11, 2, 2013, 1, 0, 20, 
  5, 0, 100, 0, 3, 3024, 5, 0, 500, 
  5, 0, 100, 1, 3, 3027, 5, 0, 1750, 
  5, 0, 100, 2, 3, 2010, 1, 0, 30, 
  5, 0, 100, 3, 3, 2018, 1, 0, 20, 
  5, 0, 100, 4, 3, 2005, 1, 0, 20, 
  5, 0, 100, 5, 3, 1612, 1, 0, 60, 
  5, 0, 100, 6, 3, 3022, 5, 0, 250, 
  5, 0, 100, 7, 3, 1004, 1, 0, 20, 
  5, 0, 100, 8, 3, 1207, 1, 0, 43, 
  5, 0, 100, 9, 3, 1107, 1, 0, 43, 
  5, 0, 100, 10, 3, 2016, 1, 0, 30, 
  5, 0, 100, 11, 3, 2004, 1, 0, 20, 
  5, 0, 100, 0, 4, 3024, 5, 0, 500, 
  5, 0, 100, 1, 4, 3027, 5, 0, 1750, 
  5, 0, 100, 2, 4, 1601, 1, 0, 350, 
  5, 0, 100, 3, 4, 1307, 1, 0, 43, 
  5, 0, 100, 4, 4, 1501, 1, 0, 1950, 
  5, 0, 100, 5, 4, 1511, 1, 0, 38, 
  5, 0, 100, 6, 4, 1507, 1, 0, 43, 
  5, 0, 100, 7, 4, 1201, 1, 0, 2438, 
  5, 0, 100, 8, 4, 2014, 1, 0, 20, 
  5, 0, 100, 9, 4, 1503, 1, 0, 50, 
  5, 0, 100, 10, 4, 2001, 1, 0, 20, 
  5, 0, 100, 11, 4, 2015, 1, 0, 30, 
  5, 0, 100, 0, 5, 3024, 5, 0, 500, 
  5, 0, 100, 1, 5, 3027, 5, 0, 1750, 
  5, 0, 100, 2, 5, 1006, 1, 0, 30, 
  5, 0, 100, 3, 5, 2009, 1, 0, 30, 
  5, 0, 100, 4, 5, 1211, 1, 0, 50, 
  5, 0, 100, 5, 5, 1103, 1, 0, 34, 
  5, 0, 100, 6, 5, 1111, 1, 0, 43, 
  5, 0, 100, 7, 5, 1311, 1, 0, 38, 
  5, 0, 100, 8, 5, 2003, 1, 0, 20, 
  5, 0, 100, 9, 5, 1210, 1, 0, 350, 
  5, 0, 100, 10, 5, 2008, 1, 0, 30, 
  5, 0, 100, 11, 5, 1505, 1, 0, 1943, 
  5, 0, 100, 0, 6, 3024, 5, 0, 500, 
  5, 0, 100, 1, 6, 3027, 5, 0, 1750, 
  5, 0, 100, 2, 6, 2012, 1, 0, 20, 
  5, 0, 100, 3, 6, 3013, 5, 0, 250, 
  5, 0, 100, 4, 6, 2011, 1, 0, 30, 
  5, 0, 100, 5, 6, 1005, 1, 0, 30, 
  5, 0, 100, 6, 6, 1609, 1, 0, 43, 
  5, 0, 100, 7, 6, 1411, 1, 0, 38, 
  5, 0, 100, 8, 6, 1206, 1, 0, 343, 
  5, 0, 100, 9, 6, 1305, 1, 0, 2183, 
  5, 0, 100, 10, 6, 2006, 1, 0, 20, 
  5, 0, 100, 11, 6, 1113, 1, 0, 1134, 
  5, 0, 100, 0, 7, 3024, 5, 0, 500, 
  5, 0, 100, 1, 7, 3027, 5, 0, 1750, 
  5, 0, 100, 2, 7, 1410, 1, 0, 278, 
  5, 0, 100, 3, 7, 1303, 1, 0, 50, 
  5, 0, 100, 4, 7, 2017, 1, 0, 30, 
  5, 0, 100, 5, 7, 1123, 1, 0, 38, 
  5, 0, 100, 6, 7, 2005, 1, 0, 20, 
  5, 0, 100, 7, 7, 1211, 1, 0, 50, 
  5, 0, 100, 8, 7, 2020, 1, 0, 20, 
  5, 0, 100, 9, 7, 3016, 5, 0, 250, 
  5, 0, 100, 10, 7, 1310, 1, 0, 278, 
  5, 0, 100, 11, 7, 1307, 1, 0, 43, 
  5, 0, 100, 0, 8, 3024, 5, 0, 500, 
  5, 0, 100, 1, 8, 1203, 1, 0, 38, 
  5, 0, 100, 2, 8, 1507, 1, 0, 43, 
  5, 0, 100, 3, 8, 1411, 1, 0, 38, 
  5, 0, 100, 4, 8, 1004, 1, 0, 20, 
  5, 0, 100, 5, 8, 1503, 1, 0, 50, 
  5, 0, 100, 6, 8, 2014, 1, 0, 20, 
  5, 0, 100, 7, 8, 2019, 1, 0, 20, 
  5, 0, 100, 8, 8, 2003, 1, 0, 20, 
  5, 0, 100, 9, 8, 1612, 1, 0, 60, 
  5, 0, 100, 10, 8, 1406, 1, 0, 283, 
  5, 0, 100, 11, 8, 2013, 1, 0, 20, 
  5, 0, 100, 0, 9, 3024, 5, 0, 500, 
  5, 0, 100, 1, 9, 3027, 5, 0, 1750, 
  5, 0, 100, 2, 9, 1402, 1, 0, 290, 
  5, 0, 100, 3, 9, 1107, 1, 0, 43, 
  5, 0, 100, 4, 9, 1005, 1, 0, 30, 
  5, 0, 100, 5, 9, 2018, 1, 0, 20, 
  5, 0, 100, 6, 9, 1303, 1, 0, 50, 
  5, 0, 100, 7, 9, 1311, 1, 0, 38, 
  5, 0, 100, 8, 9, 2015, 1, 0, 30, 
  5, 0, 100, 9, 9, 1119, 1, 0, 38, 
  5, 0, 100, 10, 9, 1122, 1, 0, 338, 
  5, 0, 100, 11, 9, 1511, 1, 0, 38, 
  5, 0, 100, 0, 10, 3024, 5, 0, 500, 
  5, 0, 100, 1, 10, 3027, 5, 0, 1750, 
  5, 0, 100, 2, 10, 1601, 1, 0, 350, 
  5, 0, 100, 3, 10, 1609, 1, 0, 43, 
  5, 0, 100, 4, 10, 1103, 1, 0, 34, 
  5, 0, 100, 5, 10, 2010, 1, 0, 30, 
  5, 0, 100, 6, 10, 3030, 5, 0, 500, 
  5, 0, 100, 7, 10, 2004, 1, 0, 20, 
  5, 0, 100, 8, 10, 1111, 1, 0, 43, 
  5, 0, 100, 9, 10, 1407, 1, 0, 43, 
  5, 0, 100, 10, 10, 1402, 1, 0, 290, 
  5, 0, 100, 11, 10, 1115, 1, 0, 34, 
  5, 0, 100, 0, 11, 3024, 5, 0, 500, 
  5, 0, 100, 1, 11, 3027, 5, 0, 1750, 
  5, 0, 100, 2, 11, 1602, 1, 0, 50, 
  5, 0, 100, 3, 11, 2009, 1, 0, 30, 
  5, 0, 100, 4, 11, 2016, 1, 0, 30, 
  5, 0, 100, 5, 11, 3023, 5, 0, 500, 
  5, 0, 100, 6, 11, 1310, 1, 0, 278, 
  5, 0, 100, 7, 11, 2006, 1, 0, 20, 
  5, 0, 100, 8, 11, 2001, 1, 0, 20, 
  5, 0, 100, 9, 11, 2007, 1, 0, 30, 
  5, 0, 100, 10, 11, 1006, 1, 0, 30, 
  5, 0, 100, 11, 11, 2012, 1, 0, 20, 
  6, 0, 100, 0, 0, 3024, 5, 0, 500, 
  6, 0, 100, 1, 0, 3027, 5, 0, 1750, 
  6, 0, 100, 2, 0, 2008, 1, 0, 30, 
  6, 0, 100, 3, 0, 2011, 1, 0, 30, 
  6, 0, 100, 4, 0, 2002, 1, 0, 20, 
  6, 0, 100, 5, 0, 1403, 1, 0, 50, 
  6, 0, 100, 6, 0, 2017, 1, 0, 30, 
  6, 0, 100, 7, 0, 2021, 1, 0, 20, 
  6, 0, 100, 8, 0, 1604, 1, 0, 2450, 
  6, 0, 100, 9, 0, 1207, 1, 0, 43, 
  6, 0, 100, 10, 0, 2017, 1, 0, 30, 
  6, 0, 100, 11, 0, 1511, 1, 0, 38, 
  6, 0, 100, 0, 1, 3024, 5, 0, 500, 
  6, 0, 100, 1, 1, 3027, 5, 0, 1750, 
  6, 0, 100, 2, 1, 2002, 1, 0, 20, 
  6, 0, 100, 3, 1, 1609, 1, 0, 43, 
  6, 0, 100, 4, 1, 2013, 1, 0, 20, 
  6, 0, 100, 5, 1, 2007, 1, 0, 30, 
  6, 0, 100, 6, 1, 2006, 1, 0, 20, 
  6, 0, 100, 7, 1, 1111, 1, 0, 43, 
  6, 0, 100, 8, 1, 1207, 1, 0, 43, 
  6, 0, 100, 9, 1, 2001, 1, 0, 20, 
  6, 0, 100, 10, 1, 2014, 1, 0, 20, 
  6, 0, 100, 11, 1, 1206, 1, 0, 343, 
  6, 0, 100, 0, 2, 3024, 5, 0, 500, 
  6, 0, 100, 1, 2, 3027, 5, 0, 1750, 
  6, 0, 100, 2, 2, 3017, 5, 0, 500, 
  6, 0, 100, 3, 2, 1608, 1, 0, 2443, 
  6, 0, 100, 4, 2, 3008, 5, 0, 500, 
  6, 0, 100, 5, 2, 1506, 1, 0, 343, 
  6, 0, 100, 6, 2, 1307, 1, 0, 43, 
  6, 0, 100, 7, 2, 1612, 1, 0, 60, 
  6, 0, 100, 8, 2, 1409, 1, 0, 1678, 
  6, 0, 100, 9, 2, 3030, 5, 0, 500, 
  6, 0, 100, 10, 2, 1102, 1, 0, 334, 
  6, 0, 100, 11, 2, 1119, 1, 0, 38, 
  6, 0, 100, 0, 3, 3024, 5, 0, 500, 
  6, 0, 100, 1, 3, 2021, 1, 0, 20, 
  6, 0, 100, 2, 3, 1302, 1, 0, 290, 
  6, 0, 100, 3, 3, 1210, 1, 0, 350, 
  6, 0, 100, 4, 3, 1411, 1, 0, 38, 
  6, 0, 100, 5, 3, 1205, 1, 0, 2443, 
  6, 0, 100, 6, 3, 1311, 1, 0, 38, 
  6, 0, 100, 7, 3, 1611, 1, 0, 343, 
  6, 0, 100, 8, 3, 2016, 1, 0, 30, 
  6, 0, 100, 9, 3, 1610, 1, 0, 360, 
  6, 0, 100, 10, 3, 1503, 1, 0, 50, 
  6, 0, 100, 11, 3, 1507, 1, 0, 43, 
  6, 0, 100, 0, 4, 3024, 5, 0, 500, 
  6, 0, 100, 1, 4, 2005, 1, 0, 20, 
  6, 0, 100, 2, 4, 2004, 1, 0, 20, 
  6, 0, 100, 3, 4, 2020, 1, 0, 20, 
  6, 0, 100, 4, 4, 1211, 1, 0, 50, 
  6, 0, 100, 5, 4, 1005, 1, 0, 30, 
  6, 0, 100, 6, 4, 1203, 1, 0, 38, 
  6, 0, 100, 7, 4, 1107, 1, 0, 43, 
  6, 0, 100, 8, 4, 1103, 1, 0, 34, 
  6, 0, 100, 9, 4, 2008, 1, 0, 30, 
  6, 0, 100, 10, 4, 3024, 5, 0, 500, 
  6, 0, 100, 11, 4, 1118, 1, 0, 338, 
  6, 0, 100, 0, 5, 3024, 5, 0, 500, 
  6, 0, 100, 1, 5, 3027, 5, 0, 1750, 
  6, 0, 100, 2, 5, 1401, 1, 0, 1690, 
  6, 0, 100, 3, 5, 1403, 1, 0, 50, 
  6, 0, 100, 4, 5, 1006, 1, 0, 30, 
  6, 0, 100, 5, 5, 1114, 1, 0, 334, 
  6, 0, 100, 6, 5, 1303, 1, 0, 50, 
  6, 0, 100, 7, 5, 2018, 1, 0, 20, 
  6, 0, 100, 8, 5, 1602, 1, 0, 50, 
  6, 0, 100, 9, 5, 1122, 1, 0, 338, 
  6, 0, 100, 10, 5, 2010, 1, 0, 30, 
  6, 0, 100, 11, 5, 1407, 1, 0, 43, 
  6, 0, 100, 0, 6, 3024, 5, 0, 500, 
  6, 0, 100, 1, 6, 3027, 5, 0, 1750, 
  6, 0, 100, 2, 6, 2019, 1, 0, 20, 
  6, 0, 100, 3, 6, 2015, 1, 0, 30, 
  6, 0, 100, 4, 6, 2003, 1, 0, 20, 
  6, 0, 100, 5, 6, 1123, 1, 0, 38, 
  6, 0, 100, 6, 6, 1406, 1, 0, 283, 
  6, 0, 100, 7, 6, 2012, 1, 0, 20, 
  6, 0, 100, 8, 6, 1115, 1, 0, 34, 
  6, 0, 100, 9, 6, 3023, 5, 0, 500, 
  6, 0, 100, 10, 6, 3017, 5, 0, 500, 
  6, 0, 100, 11, 6, 2011, 1, 0, 30, 
  6, 0, 100, 0, 7, 3024, 5, 0, 500, 
  6, 0, 100, 1, 7, 3027, 5, 0, 1750, 
  6, 0, 100, 2, 7, 2009, 1, 0, 30, 
  6, 0, 100, 3, 7, 1502, 1, 0, 350, 
  6, 0, 100, 4, 7, 1004, 1, 0, 20, 
  6, 0, 100, 5, 7, 2009, 1, 0, 30, 
  6, 0, 100, 6, 7, 1311, 1, 0, 38, 
  6, 0, 100, 7, 7, 1507, 1, 0, 43, 
  6, 0, 100, 8, 7, 1510, 1, 0, 338, 
  6, 0, 100, 9, 7, 2001, 1, 0, 20, 
  6, 0, 100, 10, 7, 1410, 1, 0, 278, 
  6, 0, 100, 11, 7, 2021, 1, 0, 20, 
  6, 0, 100, 0, 8, 3024, 5, 0, 500, 
  6, 0, 100, 1, 8, 3027, 5, 0, 1750, 
  6, 0, 100, 2, 8, 1411, 1, 0, 38, 
  6, 0, 100, 3, 8, 1203, 1, 0, 38, 
  6, 0, 100, 4, 8, 1211, 1, 0, 50, 
  6, 0, 100, 5, 8, 1511, 1, 0, 38, 
  6, 0, 100, 6, 8, 1306, 1, 0, 283, 
  6, 0, 100, 7, 8, 1407, 1, 0, 43, 
  6, 0, 100, 8, 8, 2006, 1, 0, 20, 
  6, 0, 100, 9, 8, 1403, 1, 0, 50, 
  6, 0, 100, 10, 8, 1006, 1, 0, 30, 
  6, 0, 100, 11, 8, 1202, 1, 0, 338, 
  6, 0, 100, 0, 9, 3024, 5, 0, 500, 
  6, 0, 100, 1, 9, 2014, 1, 0, 20, 
  6, 0, 100, 2, 9, 1106, 1, 0, 343, 
  6, 0, 100, 3, 9, 2011, 1, 0, 30, 
  6, 0, 100, 4, 9, 2016, 1, 0, 30, 
  6, 0, 100, 5, 9, 1110, 1, 0, 343, 
  6, 0, 100, 6, 9, 1004, 1, 0, 20, 
  6, 0, 100, 7, 9, 1110, 1, 0, 343, 
  6, 0, 100, 8, 9, 1609, 1, 0, 43, 
  6, 0, 100, 9, 9, 1005, 1, 0, 30, 
  6, 0, 100, 10, 9, 1106, 1, 0, 343, 
  6, 0, 100, 11, 9, 3017, 5, 0, 500, 
  6, 0, 100, 0, 10, 3024, 5, 0, 500, 
  6, 0, 100, 1, 10, 3027, 5, 0, 1750, 
  6, 0, 100, 2, 10, 2013, 1, 0, 20, 
  6, 0, 100, 3, 10, 1123, 1, 0, 38, 
  6, 0, 100, 4, 10, 2017, 1, 0, 30, 
  6, 0, 100, 5, 10, 1502, 1, 0, 350, 
  6, 0, 100, 6, 10, 2007, 1, 0, 30, 
  6, 0, 100, 7, 10, 1114, 1, 0, 334, 
  6, 0, 100, 8, 10, 1103, 1, 0, 34, 
  6, 0, 100, 9, 10, 2005, 1, 0, 20, 
  6, 0, 100, 10, 10, 2015, 1, 0, 30, 
  6, 0, 100, 11, 10, 2019, 1, 0, 20, 
  6, 0, 100, 0, 11, 3024, 5, 0, 500, 
  6, 0, 100, 1, 11, 3027, 5, 0, 1750, 
  6, 0, 100, 2, 11, 1119, 1, 0, 38, 
  6, 0, 100, 3, 11, 2020, 1, 0, 20, 
  6, 0, 100, 4, 11, 1306, 1, 0, 283, 
  6, 0, 100, 5, 11, 1602, 1, 0, 50, 
  6, 0, 100, 6, 11, 1122, 1, 0, 338, 
  6, 0, 100, 7, 11, 1612, 1, 0, 60, 
  6, 0, 100, 8, 11, 2002, 1, 0, 20, 
  6, 0, 100, 9, 11, 2003, 1, 0, 20, 
  6, 0, 100, 10, 11, 1307, 1, 0, 43, 
  6, 0, 100, 11, 11, 1303, 1, 0, 50, 
]
STOREREFRESH = [
  0, 5, 
  1, 10, 
  2, 10, 
  3, 20, 
  4, 20, 
  5, 50, 
  6, 50, 
  7, 100, 
  8, 100, 
  9, 150, 
  10, 150, 
  11, 150, 
  12, 150, 
  13, 150, 
  14, 150, 
  15, 150, 
  16, 300, 
  17, 300, 
  18, 300, 
  19, 300, 
  20, 300, 
]
STORE = [
  0, 0, 100, 1, 0, 3025, 1, 0, 250, 
  0, 0, 100, 2, 0, 1601, 1, 350000, 0, 
  0, 0, 100, 3, 0, 1005, 1, 30000, 0, 
  0, 0, 100, 4, 0, 1609, 1, 43000, 0, 
  0, 0, 100, 5, 0, 1510, 1, 338000, 0, 
  0, 0, 100, 0, 1, 3008, 1, 0, 100, 
  0, 0, 100, 1, 1, 2020, 1, 20000, 0, 
  0, 0, 100, 2, 1, 1607, 1, 9000, 0, 
  0, 0, 100, 3, 1, 3021, 5, 0, 250, 
  0, 0, 100, 4, 1, 1611, 1, 343000, 0, 
  0, 0, 100, 5, 1, 1119, 1, 38000, 0, 
  0, 0, 100, 0, 2, 3008, 1, 0, 100, 
  0, 0, 100, 1, 2, 3025, 1, 0, 250, 
  0, 0, 100, 2, 2, 1112, 1, 9000, 0, 
  0, 0, 100, 3, 2, 1204, 1, 8000, 0, 
  0, 0, 100, 4, 2, 1512, 1, 8000, 0, 
  0, 0, 100, 5, 2, 1404, 1, 10000, 0, 
  0, 0, 100, 0, 3, 3008, 1, 0, 100, 
  0, 0, 100, 1, 3, 3025, 1, 0, 250, 
  0, 0, 100, 2, 3, 1121, 1, 1138000, 0, 
  0, 0, 100, 3, 3, 3020, 5, 0, 250, 
  0, 0, 100, 4, 3, 2018, 1, 20000, 0, 
  0, 0, 100, 5, 3, 1108, 1, 9000, 0, 
  0, 0, 100, 0, 4, 3008, 1, 0, 100, 
  0, 0, 100, 1, 4, 3025, 1, 0, 250, 
  0, 0, 100, 2, 4, 1307, 1, 43000, 0, 
  0, 0, 100, 3, 4, 2010, 1, 30000, 0, 
  0, 0, 100, 4, 4, 1308, 1, 9000, 0, 
  0, 0, 100, 5, 4, 1002, 1, 15000, 0, 
  0, 0, 100, 0, 5, 3008, 1, 0, 100, 
  0, 0, 100, 1, 5, 3025, 1, 0, 250, 
  0, 0, 100, 2, 5, 1003, 1, 15000, 0, 
  0, 0, 100, 3, 5, 1103, 1, 34000, 0, 
  0, 0, 100, 4, 5, 1211, 1, 50000, 0, 
  0, 0, 100, 5, 5, 1116, 1, 7000, 0, 
  0, 0, 100, 0, 6, 3008, 1, 0, 100, 
  0, 0, 100, 1, 6, 3025, 1, 0, 250, 
  0, 0, 100, 2, 6, 2009, 1, 30000, 0, 
  0, 0, 100, 3, 6, 1511, 1, 38000, 0, 
  0, 0, 100, 4, 6, 1122, 1, 338000, 0, 
  0, 0, 100, 5, 6, 1506, 1, 343000, 0, 
  0, 0, 100, 0, 7, 3008, 1, 0, 100, 
  0, 0, 100, 1, 7, 3025, 1, 0, 250, 
  0, 0, 100, 2, 7, 1603, 1, 10000, 0, 
  0, 0, 100, 3, 7, 1202, 1, 338000, 0, 
  0, 0, 100, 4, 7, 1406, 1, 283000, 0, 
  0, 0, 100, 5, 7, 1109, 1, 1143000, 0, 
  0, 0, 100, 0, 8, 3008, 1, 0, 100, 
  0, 0, 100, 1, 8, 3025, 1, 0, 250, 
  0, 0, 100, 2, 8, 1120, 1, 8000, 0, 
  0, 0, 100, 3, 8, 2004, 1, 20000, 0, 
  0, 0, 100, 4, 8, 1208, 1, 9000, 0, 
  0, 0, 100, 5, 8, 1203, 1, 38000, 0, 
  0, 0, 100, 0, 9, 3008, 1, 0, 100, 
  0, 0, 100, 1, 9, 3025, 1, 0, 250, 
  0, 0, 100, 2, 9, 1207, 1, 43000, 0, 
  0, 0, 100, 3, 9, 1407, 1, 43000, 0, 
  0, 0, 100, 4, 9, 2015, 1, 30000, 0, 
  0, 0, 100, 5, 9, 1304, 1, 10000, 0, 
  0, 0, 100, 0, 10, 3008, 1, 0, 100, 
  0, 0, 100, 1, 10, 3025, 1, 0, 250, 
  0, 0, 100, 2, 10, 1111, 1, 43000, 0, 
  0, 0, 100, 3, 10, 1209, 1, 1950000, 0, 
  0, 0, 100, 4, 10, 2006, 1, 20000, 0, 
  0, 0, 100, 5, 10, 2016, 1, 30000, 0, 
  0, 0, 100, 0, 11, 3008, 1, 0, 100, 
  0, 0, 100, 1, 11, 3025, 1, 0, 250, 
  0, 0, 100, 2, 11, 1403, 1, 50000, 0, 
  0, 0, 100, 3, 11, 2002, 1, 20000, 0, 
  0, 0, 100, 4, 11, 2012, 1, 20000, 0, 
  0, 0, 100, 5, 11, 3010, 5, 0, 250, 
  1, 0, 100, 0, 0, 3008, 1, 0, 100, 
  1, 0, 100, 1, 0, 3025, 1, 0, 250, 
  1, 0, 100, 2, 0, 1104, 1, 7000, 0, 
  1, 0, 100, 3, 0, 1610, 1, 360000, 0, 
  1, 0, 100, 4, 0, 1508, 1, 9000, 0, 
  1, 0, 100, 5, 0, 1212, 1, 10000, 0, 
  1, 0, 100, 0, 1, 3008, 1, 0, 100, 
  1, 0, 100, 1, 1, 3025, 1, 0, 250, 
  1, 0, 100, 2, 1, 2001, 1, 20000, 0, 
  1, 0, 100, 3, 1, 1602, 1, 50000, 0, 
  1, 0, 100, 4, 1, 2017, 1, 30000, 0, 
  1, 0, 100, 5, 1, 3003, 5, 0, 250, 
  1, 0, 100, 0, 2, 3008, 1, 0, 100, 
  1, 0, 100, 1, 2, 2005, 1, 20000, 0, 
  1, 0, 100, 2, 2, 1302, 1, 290000, 0, 
  1, 0, 100, 3, 2, 3012, 5, 0, 250, 
  1, 0, 100, 4, 2, 1412, 1, 8000, 0, 
  1, 0, 100, 5, 2, 1310, 1, 278000, 0, 
  1, 0, 100, 0, 3, 3008, 1, 0, 100, 
  1, 0, 100, 1, 3, 3025, 1, 0, 250, 
  1, 0, 100, 2, 3, 1605, 1, 12000, 0, 
  1, 0, 100, 3, 3, 1504, 1, 10000, 0, 
  1, 0, 100, 4, 3, 3011, 5, 0, 250, 
  1, 0, 100, 5, 3, 1312, 1, 8000, 0, 
  1, 0, 100, 0, 4, 3008, 1, 0, 100, 
  1, 0, 100, 1, 4, 3025, 1, 0, 250, 
  1, 0, 100, 2, 4, 1408, 1, 9000, 0, 
  1, 0, 100, 3, 4, 1001, 1, 12000, 0, 
  1, 0, 100, 4, 4, 1124, 1, 8000, 0, 
  1, 0, 100, 5, 4, 1001, 1, 12000, 0, 
  1, 0, 100, 0, 5, 3008, 1, 0, 100, 
  1, 0, 100, 1, 5, 2014, 1, 20000, 0, 
  1, 0, 100, 2, 5, 1002, 1, 15000, 0, 
  1, 0, 100, 3, 5, 1208, 1, 9000, 0, 
  1, 0, 100, 4, 5, 3019, 5, 0, 250, 
  1, 0, 100, 5, 5, 1120, 1, 8000, 0, 
  1, 0, 100, 0, 6, 3008, 1, 0, 100, 
  1, 0, 100, 1, 6, 2007, 1, 30000, 0, 
  1, 0, 100, 2, 6, 1306, 1, 283000, 0, 
  1, 0, 100, 3, 6, 1110, 1, 343000, 0, 
  1, 0, 100, 4, 6, 1412, 1, 8000, 0, 
  1, 0, 100, 5, 6, 2008, 1, 30000, 0, 
  1, 0, 100, 0, 7, 3008, 1, 0, 100, 
  1, 0, 100, 1, 7, 3002, 5, 0, 250, 
  1, 0, 100, 2, 7, 1612, 1, 60000, 0, 
  1, 0, 100, 3, 7, 1504, 1, 10000, 0, 
  1, 0, 100, 4, 7, 1606, 1, 2460000, 0, 
  1, 0, 100, 5, 7, 1112, 1, 9000, 0, 
  1, 0, 100, 0, 8, 3008, 1, 0, 100, 
  1, 0, 100, 1, 8, 3025, 1, 0, 250, 
  1, 0, 100, 2, 8, 1123, 1, 38000, 0, 
  1, 0, 100, 3, 8, 1004, 1, 20000, 0, 
  1, 0, 100, 4, 8, 1304, 1, 10000, 0, 
  1, 0, 100, 5, 8, 2019, 1, 20000, 0, 
  1, 0, 100, 0, 9, 3008, 1, 0, 100, 
  1, 0, 100, 1, 9, 3025, 1, 0, 250, 
  1, 0, 100, 2, 9, 2011, 1, 30000, 0, 
  1, 0, 100, 3, 9, 1404, 1, 10000, 0, 
  1, 0, 100, 4, 9, 1108, 1, 9000, 0, 
  1, 0, 100, 5, 9, 1003, 1, 15000, 0, 
  1, 0, 100, 0, 10, 3008, 1, 0, 100, 
  1, 0, 100, 1, 10, 3025, 1, 0, 250, 
  1, 0, 100, 2, 10, 1604, 1, 2450000, 0, 
  1, 0, 100, 3, 10, 3006, 5, 0, 250, 
  1, 0, 100, 4, 10, 1106, 1, 343000, 0, 
  1, 0, 100, 5, 10, 1303, 1, 50000, 0, 
  1, 0, 100, 0, 11, 3008, 1, 0, 100, 
  1, 0, 100, 1, 11, 3025, 1, 0, 250, 
  1, 0, 100, 2, 11, 1311, 1, 38000, 0, 
  1, 0, 100, 3, 11, 1507, 1, 43000, 0, 
  1, 0, 100, 4, 11, 2003, 1, 20000, 0, 
  1, 0, 100, 5, 11, 1512, 1, 8000, 0, 
  2, 0, 100, 0, 0, 3008, 1, 0, 100, 
  2, 0, 100, 1, 0, 3001, 5, 0, 250, 
  2, 0, 100, 2, 0, 1605, 1, 12000, 0, 
  2, 0, 100, 3, 0, 1115, 1, 34000, 0, 
  2, 0, 100, 4, 0, 1116, 1, 7000, 0, 
  2, 0, 100, 5, 0, 1309, 1, 2178000, 0, 
  2, 0, 100, 0, 1, 3008, 1, 0, 100, 
  2, 0, 100, 1, 1, 3025, 1, 0, 250, 
  2, 0, 100, 2, 1, 1201, 1, 2438000, 0, 
  2, 0, 100, 3, 1, 1312, 1, 8000, 0, 
  2, 0, 100, 4, 1, 1006, 1, 30000, 0, 
  2, 0, 100, 5, 1, 2021, 1, 20000, 0, 
  2, 0, 100, 0, 2, 3008, 1, 0, 100, 
  2, 0, 100, 1, 2, 2013, 1, 20000, 0, 
  2, 0, 100, 2, 2, 3019, 5, 0, 250, 
  2, 0, 100, 3, 2, 1212, 1, 10000, 0, 
  2, 0, 100, 4, 2, 1411, 1, 38000, 0, 
  2, 0, 100, 5, 2, 2016, 1, 30000, 0, 
  2, 0, 100, 0, 3, 3008, 1, 0, 100, 
  2, 0, 100, 1, 3, 3025, 1, 0, 250, 
  2, 0, 100, 2, 3, 1104, 1, 7000, 0, 
  2, 0, 100, 3, 3, 1603, 1, 10000, 0, 
  2, 0, 100, 4, 3, 2018, 1, 20000, 0, 
  2, 0, 100, 5, 3, 1113, 1, 1134000, 0, 
  2, 0, 100, 0, 4, 3008, 1, 0, 100, 
  2, 0, 100, 1, 4, 3025, 1, 0, 250, 
  2, 0, 100, 2, 4, 1204, 1, 8000, 0, 
  2, 0, 100, 3, 4, 1508, 1, 9000, 0, 
  2, 0, 100, 4, 4, 1107, 1, 43000, 0, 
  2, 0, 100, 5, 4, 1308, 1, 9000, 0, 
  2, 0, 100, 0, 5, 3008, 1, 0, 100, 
  2, 0, 100, 1, 5, 2019, 1, 20000, 0, 
  2, 0, 100, 2, 5, 1503, 1, 50000, 0, 
  2, 0, 100, 3, 5, 1004, 1, 20000, 0, 
  2, 0, 100, 4, 5, 1124, 1, 8000, 0, 
  2, 0, 100, 5, 5, 1408, 1, 9000, 0, 
  2, 0, 100, 0, 6, 3008, 1, 0, 100, 
  2, 0, 100, 1, 6, 3025, 1, 0, 250, 
  2, 0, 100, 2, 6, 1607, 1, 9000, 0, 
  2, 0, 100, 3, 6, 1116, 1, 7000, 0, 
  2, 0, 100, 4, 6, 1002, 1, 15000, 0, 
  2, 0, 100, 5, 6, 1208, 1, 9000, 0, 
  2, 0, 100, 0, 7, 3008, 1, 0, 100, 
  2, 0, 100, 1, 7, 3025, 1, 0, 250, 
  2, 0, 100, 2, 7, 1119, 1, 38000, 0, 
  2, 0, 100, 3, 7, 1503, 1, 50000, 0, 
  2, 0, 100, 4, 7, 1115, 1, 34000, 0, 
  2, 0, 100, 5, 7, 1512, 1, 8000, 0, 
  2, 0, 100, 0, 8, 3008, 1, 0, 100, 
  2, 0, 100, 1, 8, 3025, 1, 0, 250, 
  2, 0, 100, 2, 8, 2006, 1, 20000, 0, 
  2, 0, 100, 3, 8, 1312, 1, 8000, 0, 
  2, 0, 100, 4, 8, 1124, 1, 8000, 0, 
  2, 0, 100, 5, 8, 1003, 1, 15000, 0, 
  2, 0, 100, 0, 9, 3008, 1, 0, 100, 
  2, 0, 100, 1, 9, 3025, 1, 0, 250, 
  2, 0, 100, 2, 9, 1112, 1, 9000, 0, 
  2, 0, 100, 3, 9, 2001, 1, 20000, 0, 
  2, 0, 100, 4, 9, 2021, 1, 20000, 0, 
  2, 0, 100, 5, 9, 1308, 1, 9000, 0, 
  2, 0, 100, 0, 10, 3008, 1, 0, 100, 
  2, 0, 100, 1, 10, 3025, 1, 0, 250, 
  2, 0, 100, 2, 10, 1612, 1, 60000, 0, 
  2, 0, 100, 3, 10, 1212, 1, 10000, 0, 
  2, 0, 100, 4, 10, 1104, 1, 7000, 0, 
  2, 0, 100, 5, 10, 3014, 5, 0, 250, 
  2, 0, 100, 0, 11, 3008, 1, 0, 100, 
  2, 0, 100, 1, 11, 3025, 1, 0, 250, 
  2, 0, 100, 2, 11, 1402, 1, 290000, 0, 
  2, 0, 100, 3, 11, 1304, 1, 10000, 0, 
  2, 0, 100, 4, 11, 3022, 5, 0, 250, 
  2, 0, 100, 5, 11, 1605, 1, 12000, 0, 
  3, 0, 100, 0, 0, 3008, 1, 0, 100, 
  3, 0, 100, 1, 0, 3025, 1, 0, 250, 
  3, 0, 100, 2, 0, 1609, 1, 43000, 0, 
  3, 0, 100, 3, 0, 1005, 1, 30000, 0, 
  3, 0, 100, 4, 0, 3021, 5, 0, 250, 
  3, 0, 100, 5, 0, 1507, 1, 43000, 0, 
  3, 0, 100, 0, 1, 3008, 1, 0, 100, 
  3, 0, 100, 1, 1, 3003, 5, 0, 250, 
  3, 0, 100, 2, 1, 3015, 5, 0, 250, 
  3, 0, 100, 3, 1, 1405, 1, 1683000, 0, 
  3, 0, 100, 4, 1, 1118, 1, 338000, 0, 
  3, 0, 100, 5, 1, 1504, 1, 10000, 0, 
  3, 0, 100, 0, 2, 3008, 1, 0, 100, 
  3, 0, 100, 1, 2, 3001, 5, 0, 250, 
  3, 0, 100, 2, 2, 3008, 5, 0, 500, 
  3, 0, 100, 3, 2, 1108, 1, 9000, 0, 
  3, 0, 100, 4, 2, 1204, 1, 8000, 0, 
  3, 0, 100, 5, 2, 1602, 1, 50000, 0, 
  3, 0, 100, 0, 3, 3008, 1, 0, 100, 
  3, 0, 100, 1, 3, 3025, 1, 0, 250, 
  3, 0, 100, 2, 3, 1311, 1, 38000, 0, 
  3, 0, 100, 3, 3, 1001, 1, 12000, 0, 
  3, 0, 100, 4, 3, 2011, 1, 30000, 0, 
  3, 0, 100, 5, 3, 1607, 1, 9000, 0, 
  3, 0, 100, 0, 4, 3008, 1, 0, 100, 
  3, 0, 100, 1, 4, 2014, 1, 20000, 0, 
  3, 0, 100, 2, 4, 1511, 1, 38000, 0, 
  3, 0, 100, 3, 4, 2015, 1, 30000, 0, 
  3, 0, 100, 4, 4, 2017, 1, 30000, 0, 
  3, 0, 100, 5, 4, 1103, 1, 34000, 0, 
  3, 0, 100, 0, 5, 3008, 1, 0, 100, 
  3, 0, 100, 1, 5, 3025, 1, 0, 250, 
  3, 0, 100, 2, 5, 2004, 1, 20000, 0, 
  3, 0, 100, 3, 5, 2002, 1, 20000, 0, 
  3, 0, 100, 4, 5, 3007, 5, 0, 250, 
  3, 0, 100, 5, 5, 1508, 1, 9000, 0, 
  3, 0, 100, 0, 6, 3008, 1, 0, 100, 
  3, 0, 100, 1, 6, 2005, 1, 20000, 0, 
  3, 0, 100, 2, 6, 1412, 1, 8000, 0, 
  3, 0, 100, 3, 6, 1303, 1, 50000, 0, 
  3, 0, 100, 4, 6, 1408, 1, 9000, 0, 
  3, 0, 100, 5, 6, 3013, 5, 0, 250, 
  3, 0, 100, 0, 7, 3008, 1, 0, 100, 
  3, 0, 100, 1, 7, 2009, 1, 30000, 0, 
  3, 0, 100, 2, 7, 1404, 1, 10000, 0, 
  3, 0, 100, 3, 7, 1114, 1, 334000, 0, 
  3, 0, 100, 4, 7, 2013, 1, 20000, 0, 
  3, 0, 100, 5, 7, 1603, 1, 10000, 0, 
  3, 0, 100, 0, 8, 3008, 1, 0, 100, 
  3, 0, 100, 1, 8, 2020, 1, 20000, 0, 
  3, 0, 100, 2, 8, 1120, 1, 8000, 0, 
  3, 0, 100, 3, 8, 1404, 1, 10000, 0, 
  3, 0, 100, 4, 8, 1104, 1, 7000, 0, 
  3, 0, 100, 5, 8, 1210, 1, 350000, 0, 
  3, 0, 100, 0, 9, 3008, 1, 0, 100, 
  3, 0, 100, 1, 9, 3025, 1, 0, 250, 
  3, 0, 100, 2, 9, 1504, 1, 10000, 0, 
  3, 0, 100, 3, 9, 3002, 5, 0, 250, 
  3, 0, 100, 4, 9, 1102, 1, 334000, 0, 
  3, 0, 100, 5, 9, 1208, 1, 9000, 0, 
  3, 0, 100, 0, 10, 3008, 1, 0, 100, 
  3, 0, 100, 1, 10, 3025, 1, 0, 250, 
  3, 0, 100, 2, 10, 1304, 1, 10000, 0, 
  3, 0, 100, 3, 10, 2010, 1, 30000, 0, 
  3, 0, 100, 4, 10, 2008, 1, 30000, 0, 
  3, 0, 100, 5, 10, 3006, 5, 0, 250, 
  3, 0, 100, 0, 11, 3008, 1, 0, 100, 
  3, 0, 100, 1, 11, 3020, 5, 0, 250, 
  3, 0, 100, 2, 11, 1001, 1, 12000, 0, 
  3, 0, 100, 3, 11, 1211, 1, 50000, 0, 
  3, 0, 100, 4, 11, 1502, 1, 350000, 0, 
  3, 0, 100, 5, 11, 1607, 1, 9000, 0, 
  4, 0, 100, 0, 0, 3008, 1, 0, 100, 
  4, 0, 100, 1, 0, 3025, 1, 0, 250, 
  4, 0, 100, 2, 0, 3016, 5, 0, 250, 
  4, 0, 100, 3, 0, 2012, 1, 20000, 0, 
  4, 0, 100, 4, 0, 3012, 5, 0, 250, 
  4, 0, 100, 5, 0, 1412, 1, 8000, 0, 
  4, 0, 100, 0, 1, 3008, 1, 0, 100, 
  4, 0, 100, 1, 1, 3025, 1, 0, 250, 
  4, 0, 100, 2, 1, 2007, 1, 30000, 0, 
  4, 0, 100, 3, 1, 1108, 1, 9000, 0, 
  4, 0, 100, 4, 1, 1006, 1, 30000, 0, 
  4, 0, 100, 5, 1, 1204, 1, 8000, 0, 
  4, 0, 100, 0, 2, 3008, 1, 0, 100, 
  4, 0, 100, 1, 2, 2003, 1, 20000, 0, 
  4, 0, 100, 2, 2, 1308, 1, 9000, 0, 
  4, 0, 100, 3, 2, 1407, 1, 43000, 0, 
  4, 0, 100, 4, 2, 3019, 5, 0, 250, 
  4, 0, 100, 5, 2, 1512, 1, 8000, 0, 
  4, 0, 100, 0, 3, 3008, 1, 0, 100, 
  4, 0, 100, 1, 3, 3025, 1, 0, 250, 
  4, 0, 100, 2, 3, 2015, 1, 30000, 0, 
  4, 0, 100, 3, 3, 1120, 1, 8000, 0, 
  4, 0, 100, 4, 3, 1603, 1, 10000, 0, 
  4, 0, 100, 5, 3, 1408, 1, 9000, 0, 
  4, 0, 100, 0, 4, 3008, 1, 0, 100, 
  4, 0, 100, 1, 4, 2004, 1, 20000, 0, 
  4, 0, 100, 2, 4, 3013, 5, 0, 250, 
  4, 0, 100, 3, 4, 1117, 1, 1138000, 0, 
  4, 0, 100, 4, 4, 3001, 5, 0, 250, 
  4, 0, 100, 5, 4, 1212, 1, 10000, 0, 
  4, 0, 100, 0, 5, 3008, 1, 0, 100, 
  4, 0, 100, 1, 5, 3025, 1, 0, 250, 
  4, 0, 100, 2, 5, 1410, 1, 278000, 0, 
  4, 0, 100, 3, 5, 1112, 1, 9000, 0, 
  4, 0, 100, 4, 5, 2008, 1, 30000, 0, 
  4, 0, 100, 5, 5, 3003, 5, 0, 250, 
  4, 0, 100, 0, 6, 3008, 1, 0, 100, 
  4, 0, 100, 1, 6, 3025, 1, 0, 250, 
  4, 0, 100, 2, 6, 3006, 5, 0, 250, 
  4, 0, 100, 3, 6, 2005, 1, 20000, 0, 
  4, 0, 100, 4, 6, 3002, 5, 0, 250, 
  4, 0, 100, 5, 6, 1123, 1, 38000, 0, 
  4, 0, 100, 0, 7, 3008, 1, 0, 100, 
  4, 0, 100, 1, 7, 3025, 1, 0, 250, 
  4, 0, 100, 2, 7, 1312, 1, 8000, 0, 
  4, 0, 100, 3, 7, 1301, 1, 2190000, 0, 
  4, 0, 100, 4, 7, 1124, 1, 8000, 0, 
  4, 0, 100, 5, 7, 1605, 1, 12000, 0, 
  4, 0, 100, 0, 8, 3008, 1, 0, 100, 
  4, 0, 100, 1, 8, 2011, 1, 30000, 0, 
  4, 0, 100, 2, 8, 1002, 1, 15000, 0, 
  4, 0, 100, 3, 8, 1509, 1, 1938000, 0, 
  4, 0, 100, 4, 8, 1206, 1, 343000, 0, 
  4, 0, 100, 5, 8, 1409, 1, 1678000, 0, 
  4, 0, 100, 0, 9, 3008, 1, 0, 100, 
  4, 0, 100, 1, 9, 3025, 1, 0, 250, 
  4, 0, 100, 2, 9, 2018, 1, 20000, 0, 
  4, 0, 100, 3, 9, 1608, 1, 2443000, 0, 
  4, 0, 100, 4, 9, 3012, 5, 0, 250, 
  4, 0, 100, 5, 9, 1116, 1, 7000, 0, 
  4, 0, 100, 0, 10, 3008, 1, 0, 100, 
  4, 0, 100, 1, 10, 3025, 1, 0, 250, 
  4, 0, 100, 2, 10, 1508, 1, 9000, 0, 
  4, 0, 100, 3, 10, 1506, 1, 343000, 0, 
  4, 0, 100, 4, 10, 2012, 1, 20000, 0, 
  4, 0, 100, 5, 10, 1003, 1, 15000, 0, 
  4, 0, 100, 0, 11, 3008, 1, 0, 100, 
  4, 0, 100, 1, 11, 3025, 1, 0, 250, 
  4, 0, 100, 2, 11, 1112, 1, 9000, 0, 
  4, 0, 100, 3, 11, 3020, 5, 0, 250, 
  4, 0, 100, 4, 11, 1207, 1, 43000, 0, 
  4, 0, 100, 5, 11, 1005, 1, 30000, 0, 
  5, 0, 100, 0, 0, 3008, 1, 0, 100, 
  5, 0, 100, 1, 0, 1004, 1, 20000, 0, 
  5, 0, 100, 2, 0, 3024, 5, 0, 500, 
  5, 0, 100, 3, 0, 1122, 1, 338000, 0, 
  5, 0, 100, 4, 0, 3015, 5, 0, 250, 
  5, 0, 100, 5, 0, 1603, 1, 10000, 0, 
  5, 0, 100, 0, 1, 3008, 1, 0, 100, 
  5, 0, 100, 1, 1, 3025, 1, 0, 250, 
  5, 0, 100, 2, 1, 1204, 1, 8000, 0, 
  5, 0, 100, 3, 1, 3011, 5, 0, 250, 
  5, 0, 100, 4, 1, 1605, 1, 12000, 0, 
  5, 0, 100, 5, 1, 1403, 1, 50000, 0, 
  5, 0, 100, 0, 2, 3008, 1, 0, 100, 
  5, 0, 100, 1, 2, 3025, 1, 0, 250, 
  5, 0, 100, 2, 2, 1611, 1, 343000, 0, 
  5, 0, 100, 3, 2, 2001, 1, 20000, 0, 
  5, 0, 100, 4, 2, 3014, 5, 0, 250, 
  5, 0, 100, 5, 2, 1412, 1, 8000, 0, 
  5, 0, 100, 0, 3, 3008, 1, 0, 100, 
  5, 0, 100, 1, 3, 3025, 1, 0, 250, 
  5, 0, 100, 2, 3, 1120, 1, 8000, 0, 
  5, 0, 100, 3, 3, 1203, 1, 38000, 0, 
  5, 0, 100, 4, 3, 2020, 1, 20000, 0, 
  5, 0, 100, 5, 3, 1312, 1, 8000, 0, 
  5, 0, 100, 0, 4, 3008, 1, 0, 100, 
  5, 0, 100, 1, 4, 3025, 1, 0, 250, 
  5, 0, 100, 2, 4, 1212, 1, 10000, 0, 
  5, 0, 100, 3, 4, 1508, 1, 9000, 0, 
  5, 0, 100, 4, 4, 1116, 1, 7000, 0, 
  5, 0, 100, 5, 4, 1111, 1, 43000, 0, 
  5, 0, 100, 0, 5, 3008, 1, 0, 100, 
  5, 0, 100, 1, 5, 3025, 1, 0, 250, 
  5, 0, 100, 2, 5, 2007, 1, 30000, 0, 
  5, 0, 100, 3, 5, 2021, 1, 20000, 0, 
  5, 0, 100, 4, 5, 1308, 1, 9000, 0, 
  5, 0, 100, 5, 5, 1124, 1, 8000, 0, 
  5, 0, 100, 0, 6, 3008, 1, 0, 100, 
  5, 0, 100, 1, 6, 3025, 1, 0, 250, 
  5, 0, 100, 2, 6, 3010, 5, 0, 250, 
  5, 0, 100, 3, 6, 1411, 1, 38000, 0, 
  5, 0, 100, 4, 6, 1104, 1, 7000, 0, 
  5, 0, 100, 5, 6, 1006, 1, 30000, 0, 
  5, 0, 100, 0, 7, 3008, 1, 0, 100, 
  5, 0, 100, 1, 7, 3025, 1, 0, 250, 
  5, 0, 100, 2, 7, 1107, 1, 43000, 0, 
  5, 0, 100, 3, 7, 1306, 1, 283000, 0, 
  5, 0, 100, 4, 7, 2013, 1, 20000, 0, 
  5, 0, 100, 5, 7, 1404, 1, 10000, 0, 
  5, 0, 100, 0, 8, 3008, 1, 0, 100, 
  5, 0, 100, 1, 8, 3025, 1, 0, 250, 
  5, 0, 100, 2, 8, 1108, 1, 9000, 0, 
  5, 0, 100, 3, 8, 1002, 1, 15000, 0, 
  5, 0, 100, 4, 8, 1208, 1, 9000, 0, 
  5, 0, 100, 5, 8, 1114, 1, 334000, 0, 
  5, 0, 100, 0, 9, 3008, 1, 0, 100, 
  5, 0, 100, 1, 9, 3025, 1, 0, 250, 
  5, 0, 100, 2, 9, 1307, 1, 43000, 0, 
  5, 0, 100, 3, 9, 2017, 1, 30000, 0, 
  5, 0, 100, 4, 9, 1503, 1, 50000, 0, 
  5, 0, 100, 5, 9, 1411, 1, 38000, 0, 
  5, 0, 100, 0, 10, 3008, 1, 0, 100, 
  5, 0, 100, 1, 10, 3025, 1, 0, 250, 
  5, 0, 100, 2, 10, 1512, 1, 8000, 0, 
  5, 0, 100, 3, 10, 1311, 1, 38000, 0, 
  5, 0, 100, 4, 10, 1609, 1, 43000, 0, 
  5, 0, 100, 5, 10, 1607, 1, 9000, 0, 
  5, 0, 100, 0, 11, 3008, 1, 0, 100, 
  5, 0, 100, 1, 11, 3025, 1, 0, 250, 
  5, 0, 100, 2, 11, 3022, 5, 0, 250, 
  5, 0, 100, 3, 11, 3016, 5, 0, 250, 
  5, 0, 100, 4, 11, 1119, 1, 38000, 0, 
  5, 0, 100, 5, 11, 1003, 1, 15000, 0, 
  6, 0, 100, 0, 0, 3008, 1, 0, 100, 
  6, 0, 100, 1, 0, 3025, 1, 0, 250, 
  6, 0, 100, 2, 0, 2003, 1, 20000, 0, 
  6, 0, 100, 3, 0, 2010, 1, 30000, 0, 
  6, 0, 100, 4, 0, 1612, 1, 60000, 0, 
  6, 0, 100, 5, 0, 1402, 1, 290000, 0, 
  6, 0, 100, 0, 1, 3008, 1, 0, 100, 
  6, 0, 100, 1, 1, 3025, 1, 0, 250, 
  6, 0, 100, 2, 1, 1408, 1, 9000, 0, 
  6, 0, 100, 3, 1, 1001, 1, 12000, 0, 
  6, 0, 100, 4, 1, 1505, 1, 1943000, 0, 
  6, 0, 100, 5, 1, 1211, 1, 50000, 0, 
  6, 0, 100, 0, 2, 3008, 1, 0, 100, 
  6, 0, 100, 1, 2, 2016, 1, 30000, 0, 
  6, 0, 100, 2, 2, 3007, 5, 0, 250, 
  6, 0, 100, 3, 2, 1304, 1, 10000, 0, 
  6, 0, 100, 4, 2, 2019, 1, 20000, 0, 
  6, 0, 100, 5, 2, 3021, 5, 0, 250, 
  6, 0, 100, 0, 3, 3008, 1, 0, 100, 
  6, 0, 100, 1, 3, 3025, 1, 0, 250, 
  6, 0, 100, 2, 3, 1504, 1, 10000, 0, 
  6, 0, 100, 3, 3, 1308, 1, 9000, 0, 
  6, 0, 100, 4, 3, 1110, 1, 343000, 0, 
  6, 0, 100, 5, 3, 2009, 1, 30000, 0, 
  6, 0, 100, 0, 4, 3008, 1, 0, 100, 
  6, 0, 100, 1, 4, 2002, 1, 20000, 0, 
  6, 0, 100, 2, 4, 1603, 1, 10000, 0, 
  6, 0, 100, 3, 4, 1120, 1, 8000, 0, 
  6, 0, 100, 4, 4, 1401, 1, 1690000, 0, 
  6, 0, 100, 5, 4, 1112, 1, 9000, 0, 
  6, 0, 100, 0, 5, 3008, 1, 0, 100, 
  6, 0, 100, 1, 5, 3025, 1, 0, 250, 
  6, 0, 100, 2, 5, 3015, 5, 0, 250, 
  6, 0, 100, 3, 5, 1404, 1, 10000, 0, 
  6, 0, 100, 4, 5, 1124, 1, 8000, 0, 
  6, 0, 100, 5, 5, 2014, 1, 20000, 0, 
  6, 0, 100, 0, 6, 3008, 1, 0, 100, 
  6, 0, 100, 1, 6, 3025, 1, 0, 250, 
  6, 0, 100, 2, 6, 1208, 1, 9000, 0, 
  6, 0, 100, 3, 6, 2006, 1, 20000, 0, 
  6, 0, 100, 4, 6, 1412, 1, 8000, 0, 
  6, 0, 100, 5, 6, 1410, 1, 278000, 0, 
  6, 0, 100, 0, 7, 3008, 1, 0, 100, 
  6, 0, 100, 1, 7, 3025, 1, 0, 250, 
  6, 0, 100, 2, 7, 1605, 1, 12000, 0, 
  6, 0, 100, 3, 7, 1207, 1, 43000, 0, 
  6, 0, 100, 4, 7, 1104, 1, 7000, 0, 
  6, 0, 100, 5, 7, 1502, 1, 350000, 0, 
  6, 0, 100, 0, 8, 3008, 1, 0, 100, 
  6, 0, 100, 1, 8, 2001, 1, 20000, 0, 
  6, 0, 100, 2, 8, 1003, 1, 15000, 0, 
  6, 0, 100, 3, 8, 1103, 1, 34000, 0, 
  6, 0, 100, 4, 8, 3030, 5, 0, 500, 
  6, 0, 100, 5, 8, 1403, 1, 50000, 0, 
  6, 0, 100, 0, 9, 3008, 1, 0, 100, 
  6, 0, 100, 1, 9, 3001, 5, 0, 250, 
  6, 0, 100, 2, 9, 1116, 1, 7000, 0, 
  6, 0, 100, 3, 9, 2021, 1, 20000, 0, 
  6, 0, 100, 4, 9, 1204, 1, 8000, 0, 
  6, 0, 100, 5, 9, 1001, 1, 12000, 0, 
  6, 0, 100, 0, 10, 3008, 1, 0, 100, 
  6, 0, 100, 1, 10, 3002, 5, 0, 250, 
  6, 0, 100, 2, 10, 1607, 1, 9000, 0, 
  6, 0, 100, 3, 10, 3020, 5, 0, 250, 
  6, 0, 100, 4, 10, 2003, 1, 20000, 0, 
  6, 0, 100, 5, 10, 1106, 1, 343000, 0, 
  6, 0, 100, 0, 11, 3008, 1, 0, 100, 
  6, 0, 100, 1, 11, 3025, 1, 0, 250, 
  6, 0, 100, 2, 11, 1002, 1, 15000, 0, 
  6, 0, 100, 3, 11, 1407, 1, 43000, 0, 
  6, 0, 100, 4, 11, 1507, 1, 43000, 0, 
  6, 0, 100, 5, 11, 1005, 1, 30000, 0, 
]
BMPROBA = 0.05
MPROBA = 0.01
SWEEPBMPROBA = 0.15
SWEEPPROBA = 0.08
# SWEEPBMPROBA = 0.5
# SWEEPPROBA = 0.5
BEAUTY = [
	0, 45000, '04002', 2, 30, '04002', 1,
	1, 75000, '04002', 2, 50, '04002', 1,
	2, 75000, '04002', 2, 50, '04002', 1,
	3, 75000, '04002', 2, 50, '04002', 1,
	4, 75000, '04002', 2, 50, '04002', 1,
	5, 75000, '04002', 4, 50, '04002', 2,
	6, 75000, '04002', 4, 50, '04002', 2,
	7, 75000, '04002', 4, 50, '04002', 2,
	8, 75000, '04002', 4, 50, '04002', 2,
	9, 75000, '04002', 4, 50, '04002', 2,
	10, 75000, '04002', 6, 50, '04002', 3,
	11, 75000, '04002', 6, 50, '04002', 3,
	12, 75000, '04002', 6, 50, '04002', 3,
	13, 75000, '04002', 6, 50, '04002', 3,
	14, 75000, '04002', 6, 50, '04002', 3,
	15, 75000, '04002', 8, 50, '04002', 4,
	16, 75000, '04002', 8, 50, '04002', 4,
	17, 75000, '04002', 8, 50, '04002', 4,
	18, 90000, '04002', 8, 60, '04002', 4,
	19, 90000, '04002', 8, 60, '04002', 4,
	20, 90000, '04002', 10, 60, '04002', 5,
	21, 90000, '04002', 10, 60, '04002', 5,
	22, 90000, '04002', 10, 60, '04002', 5,
	23, 90000, '04002', 10, 60, '04002', 5,
	24, 90000, '04002', 10, 60, '04002', 5,
	25, 90000, '04002', 12, 60, '04002', 6,
	26, 90000, '04002', 12, 60, '04002', 6,
	27, 90000, '04002', 12, 60, '04002', 6,
	28, 105000, '04002', 12, 70, '04002', 6,
	29, 105000, '04002', 12, 70, '04002', 6,
	30, 105000, '04002', 14, 70, '04002', 7,
	31, 105000, '04002', 14, 70, '04002', 7,
	32, 105000, '04002', 14, 70, '04002', 7,
	33, 105000, '04002', 14, 70, '04002', 7,
	34, 105000, '04002', 14, 70, '04002', 7,
	35, 105000, '04002', 16, 70, '04002', 8,
	36, 105000, '04002', 16, 70, '04002', 8,
	37, 105000, '04002', 16, 70, '04002', 8,
	38, 120000, '04002', 16, 80, '04002', 8,
	39, 120000, '04002', 16, 80, '04002', 8,
	40, 120000, '04002', 18, 80, '04002', 9,
	41, 120000, '04002', 18, 80, '04002', 9,
	42, 120000, '04002', 18, 80, '04002', 9,
	43, 120000, '04002', 18, 80, '04002', 9,
	44, 120000, '04002', 18, 80, '04002', 9,
	45, 120000, '04002', 20, 80, '04002', 10,
	46, 120000, '04002', 20, 80, '04002', 10,
	47, 135000, '04002', 20, 90, '04002', 10,
	48, 135000, '04002', 20, 90, '04002', 10,
	49, 135000, '04002', 20, 90, '04002', 10,
	50, 180000, '04002', 22, 90, '04002', 11,
	51, 180000, '04002', 22, 90, '04002', 11,
	52, 180000, '04002', 22, 90, '04002', 11,
	53, 180000, '04002', 22, 90, '04002', 11,
	54, 180000, '04002', 22, 90, '04002', 11,
	55, 180000, '04002', 24, 90, '04002', 12,
	56, 180000, '04002', 24, 90, '04002', 12,
	57, 200000, '04002', 24, 100, '04002', 12,
	58, 200000, '04002', 24, 100, '04002', 12,
	59, 200000, '04002', 24, 100, '04002', 12,
	60, 200000, '04002', 26, 100, '04002', 13,
	61, 200000, '04002', 26, 100, '04002', 13,
	62, 200000, '04002', 26, 100, '04002', 13,
	63, 200000, '04002', 26, 100, '04002', 13,
	64, 200000, '04002', 26, 100, '04002', 13,
	65, 200000, '04002', 30, 100, '04002', 15,
	66, 200000, '04002', 30, 100, '04002', 15,
	67, 220000, '04002', 30, 110, '04002', 15,
	68, 220000, '04002', 30, 110, '04002', 15,
	69, 220000, '04002', 30, 110, '04002', 15,
	70, 220000, '04002', 34, 110, '04002', 17,
	71, 220000, '04002', 34, 110, '04002', 17,
	72, 220000, '04002', 34, 110, '04002', 17,
	73, 220000, '04002', 40, 110, '04002', 20,
	74, 220000, '04002', 44, 110, '04002', 22,
	75, 220000, '04002', 48, 110, '04002', 24,
	76, 220000, '04002', 52, 110, '04002', 26,
	77, 240000, '04002', 56, 120, '04002', 28,
	78, 240000, '04002', 60, 120, '04002', 30,
	79, 240000, '04002', 64, 120, '04002', 32,
	80, 240000, '04002', 68, 120, '04002', 34,
	81, 240000, '04002', 72, 120, '04002', 36,
	82, 240000, '04002', 76, 120, '04002', 38,
	83, 240000, '04002', 80, 120, '04002', 40,
	84, 240000, '04002', 84, 120, '04002', 42,
	85, 240000, '04002', 88, 120, '04002', 44,
	86, 240000, '04002', 92, 120, '04002', 46,
	87, 260000, '04002', 96, 130, '04002', 48,
	88, 260000, '04002', 100, 130, '04002', 50,
	89, 260000, '04002', 104, 130, '04002', 52,
	90, 260000, '04002', 108, 130, '04002', 54,
	91, 260000, '04002', 112, 130, '04002', 56,
	92, 260000, '04002', 116, 130, '04002', 58,
	93, 300000, '04002', 120, 150, '04002', 60,
	94, 300000, '04002', 124, 150, '04002', 62,
	95, 300000, '04002', 128, 150, '04002', 64,
	96, 320000, '04002', 132, 160, '04002', 66,
	97, 340000, '04002', 136, 170, '04002', 68,
	98, 360000, '04002', 140, 180, '04002', 70,
	99, 400000, '04002', 144, 200, '04002', 72,
]


BEAUTYPROBA = 0.1
#get_economy end==========

#get_hero start==========
HEROEQUIP = {
  "01001": [
    [
      "01112",
      "01208",
      "01312",
      "01412",
      "01512",
      "01607"
    ],
    [
      "01111",
      "01207",
      "01311",
      "01403",
      "01511",
      "01612"
    ],
    [
      "01123",
      "01207",
      "01311",
      "01403",
      "01511",
      "01612"
    ],
    [
      "01102",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01122",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01118",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01105",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01109",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01109",
      "01209",
      "01302",
      "01410",
      "01505",
      "01606"
    ],
    [
      "01117",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ]
  ],
  "01002": [
    [
      "01108",
      "01204",
      "01312",
      "01001",
      "01512",
      "01607"
    ],
    [
      "01111",
      "01207",
      "01311",
      "01403",
      "01511",
      "01612"
    ],
    [
      "01123",
      "01207",
      "01311",
      "01403",
      "01511",
      "01612"
    ],
    [
      "01102",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01122",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01118",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01105",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01109",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01109",
      "01209",
      "01302",
      "01410",
      "01505",
      "01606"
    ],
    [
      "01117",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ]
  ],
  "01003": [
    [
      "01120",
      "01212",
      "01308",
      "01408",
      "01508",
      "01603"
    ],
    [
      "01107",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01111",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01123",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01102",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01122",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01118",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01509",
      "01604"
    ],
    [
      "01109",
      "01201",
      "01305",
      "01401",
      "01509",
      "01604"
    ]
  ],
  "01004": [
    [
      "01120",
      "01212",
      "01308",
      "01408",
      "01508",
      "01603"
    ],
    [
      "01107",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01111",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01123",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01102",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01122",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01118",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01509",
      "01604"
    ],
    [
      "01109",
      "01201",
      "01305",
      "01401",
      "01509",
      "01604"
    ]
  ],
  "01005": [
    [
      "01120",
      "01212",
      "01308",
      "01408",
      "01508",
      "01603"
    ],
    [
      "01107",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01111",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01123",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01102",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01122",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01118",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01509",
      "01604"
    ],
    [
      "01109",
      "01201",
      "01305",
      "01401",
      "01509",
      "01604"
    ]
  ],
  "01006": [
    [
      "01116",
      "01204",
      "01304",
      "01404",
      "01504",
      "01605"
    ],
    [
      "01112",
      "01203",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01107",
      "01203",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01111",
      "01207",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01123",
      "01211",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01102",
      "01210",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01122",
      "01206",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01118",
      "01202",
      "01305",
      "01401",
      "01509",
      "01604"
    ],
    [
      "01118",
      "01202",
      "01305",
      "01401",
      "01501",
      "01608"
    ],
    [
      "01105",
      "01209",
      "01301",
      "01405",
      "01501",
      "01608"
    ]
  ],
  "01007": [
    [
      "01112",
      "01208",
      "01312",
      "01412",
      "01512",
      "01607"
    ],
    [
      "01111",
      "01207",
      "01311",
      "01403",
      "01511",
      "01612"
    ],
    [
      "01123",
      "01207",
      "01311",
      "01403",
      "01511",
      "01612"
    ],
    [
      "01102",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01122",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01118",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01105",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01109",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01109",
      "01209",
      "01302",
      "01410",
      "01505",
      "01606"
    ],
    [
      "01117",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ]
  ],
  "01008": [
    [
      "01104",
      "01204",
      "01304",
      "01404",
      "01504",
      "01605"
    ],
    [
      "01108",
      "01203",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01103",
      "01203",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01115",
      "01207",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01119",
      "01211",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01106",
      "01210",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01110",
      "01206",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01114",
      "01202",
      "01305",
      "01401",
      "01509",
      "01604"
    ],
    [
      "01114",
      "01202",
      "01305",
      "01401",
      "01501",
      "01608"
    ],
    [
      "01121",
      "01209",
      "01301",
      "01405",
      "01501",
      "01608"
    ]
  ],
  "01009": [
    [
      "01120",
      "01212",
      "01308",
      "01408",
      "01508",
      "01603"
    ],
    [
      "01107",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01111",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01123",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01102",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01122",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01118",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01509",
      "01604"
    ],
    [
      "01109",
      "01201",
      "01305",
      "01401",
      "01509",
      "01604"
    ]
  ],
  "01010": [
    [
      "01120",
      "01212",
      "01308",
      "01408",
      "01508",
      "01603"
    ],
    [
      "01107",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01111",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01123",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01102",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01122",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01118",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01509",
      "01604"
    ],
    [
      "01109",
      "01201",
      "01305",
      "01401",
      "01509",
      "01604"
    ]
  ],
  "01011": [
    [
      "01116",
      "01204",
      "01304",
      "01404",
      "01504",
      "01605"
    ],
    [
      "01112",
      "01203",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01107",
      "01203",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01111",
      "01207",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01123",
      "01211",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01102",
      "01210",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01122",
      "01206",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01118",
      "01202",
      "01305",
      "01401",
      "01509",
      "01604"
    ],
    [
      "01118",
      "01202",
      "01305",
      "01401",
      "01501",
      "01608"
    ],
    [
      "01105",
      "01209",
      "01301",
      "01405",
      "01501",
      "01608"
    ]
  ],
  "01012": [
    [
      "01112",
      "01208",
      "01312",
      "01412",
      "01512",
      "01607"
    ],
    [
      "01111",
      "01207",
      "01311",
      "01403",
      "01511",
      "01612"
    ],
    [
      "01123",
      "01207",
      "01311",
      "01403",
      "01511",
      "01612"
    ],
    [
      "01102",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01122",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01118",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01105",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01109",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01109",
      "01209",
      "01302",
      "01410",
      "01505",
      "01606"
    ],
    [
      "01117",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ]
  ],
  "01013": [
    [
      "01116",
      "01204",
      "01304",
      "01404",
      "01504",
      "01605"
    ],
    [
      "01112",
      "01203",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01107",
      "01203",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01111",
      "01207",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01123",
      "01211",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01102",
      "01210",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01122",
      "01206",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01118",
      "01202",
      "01305",
      "01401",
      "01509",
      "01604"
    ],
    [
      "01118",
      "01202",
      "01305",
      "01401",
      "01501",
      "01608"
    ],
    [
      "01105",
      "01209",
      "01301",
      "01405",
      "01501",
      "01608"
    ]
  ],
  "01014": [
    [
      "01112",
      "01208",
      "01312",
      "01412",
      "01512",
      "01607"
    ],
    [
      "01111",
      "01207",
      "01311",
      "01403",
      "01511",
      "01612"
    ],
    [
      "01123",
      "01207",
      "01311",
      "01403",
      "01511",
      "01612"
    ],
    [
      "01102",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01122",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01118",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01105",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01109",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01109",
      "01209",
      "01302",
      "01410",
      "01505",
      "01606"
    ],
    [
      "01117",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ]
  ],
  "01015": [
    [
      "01116",
      "01204",
      "01304",
      "01404",
      "01504",
      "01605"
    ],
    [
      "01112",
      "01203",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01107",
      "01203",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01111",
      "01207",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01123",
      "01211",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01102",
      "01210",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01122",
      "01206",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01118",
      "01202",
      "01305",
      "01401",
      "01509",
      "01604"
    ],
    [
      "01118",
      "01202",
      "01305",
      "01401",
      "01501",
      "01608"
    ],
    [
      "01105",
      "01209",
      "01301",
      "01405",
      "01501",
      "01608"
    ]
  ],
  "01016": [
    [
      "01120",
      "01212",
      "01308",
      "01408",
      "01508",
      "01603"
    ],
    [
      "01107",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01111",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01123",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01102",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01122",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01118",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01509",
      "01604"
    ],
    [
      "01109",
      "01201",
      "01305",
      "01401",
      "01509",
      "01604"
    ]
  ],
  "01017": [
    [
      "01104",
      "01204",
      "01304",
      "01404",
      "01504",
      "01605"
    ],
    [
      "01108",
      "01203",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01103",
      "01203",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01115",
      "01207",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01119",
      "01211",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01106",
      "01210",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01110",
      "01206",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01114",
      "01202",
      "01305",
      "01401",
      "01509",
      "01604"
    ],
    [
      "01114",
      "01202",
      "01305",
      "01401",
      "01501",
      "01608"
    ],
    [
      "01121",
      "01209",
      "01301",
      "01405",
      "01501",
      "01608"
    ]
  ],
  "01018": [
    [
      "01120",
      "01212",
      "01308",
      "01408",
      "01508",
      "01603"
    ],
    [
      "01107",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01111",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01123",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01102",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01122",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01118",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01509",
      "01604"
    ],
    [
      "01109",
      "01201",
      "01305",
      "01401",
      "01509",
      "01604"
    ]
  ],
  "01019": [
    [
      "01112",
      "01208",
      "01312",
      "01412",
      "01512",
      "01607"
    ],
    [
      "01111",
      "01207",
      "01311",
      "01403",
      "01511",
      "01612"
    ],
    [
      "01123",
      "01207",
      "01311",
      "01403",
      "01511",
      "01612"
    ],
    [
      "01102",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01122",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01118",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01105",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01109",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01109",
      "01209",
      "01302",
      "01410",
      "01505",
      "01606"
    ],
    [
      "01117",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ]
  ],
  "01020": [
    [
      "01112",
      "01208",
      "01312",
      "01412",
      "01512",
      "01607"
    ],
    [
      "01111",
      "01207",
      "01311",
      "01403",
      "01511",
      "01612"
    ],
    [
      "01123",
      "01207",
      "01311",
      "01403",
      "01511",
      "01612"
    ],
    [
      "01102",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01122",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01118",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01105",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01109",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01109",
      "01209",
      "01302",
      "01410",
      "01505",
      "01606"
    ],
    [
      "01117",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ]
  ],
  "01021": [
    [
      "01120",
      "01212",
      "01308",
      "01408",
      "01508",
      "01603"
    ],
    [
      "01107",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01111",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01123",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01102",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01122",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01118",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01509",
      "01604"
    ],
    [
      "01109",
      "01201",
      "01305",
      "01401",
      "01509",
      "01604"
    ]
  ],
  "01022": [
    [
      "01120",
      "01212",
      "01308",
      "01408",
      "01508",
      "01603"
    ],
    [
      "01107",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01111",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01123",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01102",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01122",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01118",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01509",
      "01604"
    ],
    [
      "01109",
      "01201",
      "01305",
      "01401",
      "01509",
      "01604"
    ]
  ],
  "01023": [
    [
      "01108",
      "01208",
      "01312",
      "01412",
      "01512",
      "01607"
    ],
    [
      "01115",
      "01207",
      "01311",
      "01403",
      "01511",
      "01612"
    ],
    [
      "01119",
      "01207",
      "01311",
      "01403",
      "01511",
      "01612"
    ],
    [
      "01106",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01110",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01114",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01121",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01101",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01101",
      "01209",
      "01302",
      "01410",
      "01505",
      "01606"
    ],
    [
      "01113",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ]
  ],
  "01024": [
    [
      "01108",
      "01208",
      "01312",
      "01412",
      "01512",
      "01607"
    ],
    [
      "01115",
      "01207",
      "01311",
      "01403",
      "01511",
      "01612"
    ],
    [
      "01119",
      "01207",
      "01311",
      "01403",
      "01511",
      "01612"
    ],
    [
      "01106",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01110",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01114",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01121",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01101",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01101",
      "01209",
      "01302",
      "01410",
      "01505",
      "01606"
    ],
    [
      "01113",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ]
  ],
  "01025": [
    [
      "01104",
      "01204",
      "01304",
      "01404",
      "01504",
      "01605"
    ],
    [
      "01108",
      "01203",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01103",
      "01203",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01115",
      "01207",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01119",
      "01211",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01106",
      "01210",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01110",
      "01206",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01114",
      "01202",
      "01305",
      "01401",
      "01509",
      "01604"
    ],
    [
      "01114",
      "01202",
      "01305",
      "01401",
      "01501",
      "01608"
    ],
    [
      "01121",
      "01209",
      "01301",
      "01405",
      "01501",
      "01608"
    ]
  ],
  "01026": [
    [
      "01108",
      "01208",
      "01312",
      "01412",
      "01512",
      "01607"
    ],
    [
      "01115",
      "01207",
      "01311",
      "01403",
      "01511",
      "01612"
    ],
    [
      "01119",
      "01207",
      "01311",
      "01403",
      "01511",
      "01612"
    ],
    [
      "01106",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01110",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01114",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01121",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01101",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01101",
      "01209",
      "01302",
      "01410",
      "01505",
      "01606"
    ],
    [
      "01113",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ]
  ],
  "01027": [
    [
      "01104",
      "01204",
      "01304",
      "01404",
      "01504",
      "01605"
    ],
    [
      "01108",
      "01203",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01103",
      "01203",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01115",
      "01207",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01119",
      "01211",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01106",
      "01210",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01110",
      "01206",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01114",
      "01202",
      "01305",
      "01401",
      "01509",
      "01604"
    ],
    [
      "01114",
      "01202",
      "01305",
      "01401",
      "01501",
      "01608"
    ],
    [
      "01121",
      "01209",
      "01301",
      "01405",
      "01501",
      "01608"
    ]
  ],
  "01028": [
    [
      "01120",
      "01212",
      "01308",
      "01408",
      "01508",
      "01603"
    ],
    [
      "01107",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01111",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01123",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01102",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01122",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01118",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01509",
      "01604"
    ],
    [
      "01109",
      "01201",
      "01305",
      "01401",
      "01509",
      "01604"
    ]
  ],
  "01029": [
    [
      "01120",
      "01212",
      "01308",
      "01408",
      "01508",
      "01603"
    ],
    [
      "01107",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01111",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01123",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01102",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01122",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01118",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01509",
      "01604"
    ],
    [
      "01109",
      "01201",
      "01305",
      "01401",
      "01509",
      "01604"
    ]
  ],
  "01030": [
    [
      "01120",
      "01212",
      "01308",
      "01408",
      "01508",
      "01603"
    ],
    [
      "01107",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01111",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01123",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01102",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01122",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01118",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01509",
      "01604"
    ],
    [
      "01109",
      "01201",
      "01305",
      "01401",
      "01509",
      "01604"
    ]
  ],
  "01031": [
    [
      "01124",
      "01212",
      "01308",
      "01408",
      "01508",
      "01603"
    ],
    [
      "01103",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01115",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01119",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01106",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01110",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01114",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01121",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01121",
      "01205",
      "01309",
      "01409",
      "01509",
      "01604"
    ],
    [
      "01101",
      "01201",
      "01305",
      "01401",
      "01509",
      "01604"
    ]
  ],
  "01032": [
    [
      "01120",
      "01212",
      "01308",
      "01408",
      "01508",
      "01603"
    ],
    [
      "01107",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01111",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01123",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01102",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01122",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01118",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01509",
      "01604"
    ],
    [
      "01109",
      "01201",
      "01305",
      "01401",
      "01509",
      "01604"
    ]
  ],
  "01033": [
    [
      "01120",
      "01212",
      "01308",
      "01408",
      "01508",
      "01603"
    ],
    [
      "01107",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01111",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01123",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01102",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01122",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01118",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01509",
      "01604"
    ],
    [
      "01109",
      "01201",
      "01305",
      "01401",
      "01509",
      "01604"
    ]
  ],
  "01034": [
    [
      "01120",
      "01212",
      "01308",
      "01408",
      "01508",
      "01603"
    ],
    [
      "01107",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01111",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01123",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01102",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01122",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01118",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01509",
      "01604"
    ],
    [
      "01109",
      "01201",
      "01305",
      "01401",
      "01509",
      "01604"
    ]
  ],
  "01035": [
    [
      "01120",
      "01212",
      "01308",
      "01408",
      "01508",
      "01603"
    ],
    [
      "01107",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01111",
      "01211",
      "01307",
      "01407",
      "01507",
      "01609"
    ],
    [
      "01123",
      "01210",
      "01303",
      "01411",
      "01503",
      "01602"
    ],
    [
      "01102",
      "01206",
      "01310",
      "01402",
      "01502",
      "01611"
    ],
    [
      "01122",
      "01202",
      "01306",
      "01406",
      "01506",
      "01601"
    ],
    [
      "01118",
      "01209",
      "01302",
      "01410",
      "01510",
      "01610"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01505",
      "01606"
    ],
    [
      "01105",
      "01205",
      "01309",
      "01409",
      "01509",
      "01604"
    ],
    [
      "01109",
      "01201",
      "01305",
      "01401",
      "01509",
      "01604"
    ]
  ]
}
PRODEQUIPCOM = {
  "01101": {
    "gold": 18000,
    "prods": {
      "01005": "10",
      "01102": "1",
      "02001": "25"
    }
  },
  "01102": {
    "gold": 5000,
    "prods": {
      "01002": "10",
      "01103": "1"
    }
  },
  "01103": {
    "gold": 1000,
    "prods": {
      "01104": 5.0
    }
  },
  "01105": {
    "gold": 18000,
    "prods": {
      "01005": "10",
      "01106": "1",
      "02002": "25"
    }
  },
  "01106": {
    "gold": 5000,
    "prods": {
      "01002": "10",
      "01107": "1"
    }
  },
  "01107": {
    "gold": 1000,
    "prods": {
      "01108": 5.0
    }
  },
  "01109": {
    "gold": 18000,
    "prods": {
      "01005": "10",
      "01110": "1",
      "02003": "25"
    }
  },
  "01110": {
    "gold": 5000,
    "prods": {
      "01002": "10",
      "01111": "1"
    }
  },
  "01111": {
    "gold": 1000,
    "prods": {
      "01112": 5.0
    }
  },
  "01113": {
    "gold": 18000,
    "prods": {
      "01005": "10",
      "01114": "1",
      "02004": "25"
    }
  },
  "01114": {
    "gold": 5000,
    "prods": {
      "01002": "10",
      "01115": "1"
    }
  },
  "01115": {
    "gold": 1000,
    "prods": {
      "01116": 5.0
    }
  },
  "01117": {
    "gold": 18000,
    "prods": {
      "01005": "10",
      "01118": "1",
      "02005": "25"
    }
  },
  "01118": {
    "gold": 5000,
    "prods": {
      "01002": "10",
      "01119": "1"
    }
  },
  "01119": {
    "gold": 1000,
    "prods": {
      "01120": 5.0
    }
  },
  "01121": {
    "gold": 18000,
    "prods": {
      "01005": "10",
      "01122": "1",
      "02006": "25"
    }
  },
  "01122": {
    "gold": 5000,
    "prods": {
      "01002": "10",
      "01123": "1"
    }
  },
  "01123": {
    "gold": 1000,
    "prods": {
      "01124": 5.0
    }
  },
  "01201": {
    "gold": 18000,
    "prods": {
      "01006": "20",
      "01202": "1",
      "02007": "50"
    }
  },
  "01202": {
    "gold": 5000,
    "prods": {
      "01003": "10",
      "01203": "1"
    }
  },
  "01203": {
    "gold": 1000,
    "prods": {
      "01204": 5.0
    }
  },
  "01205": {
    "gold": 18000,
    "prods": {
      "01006": "20",
      "01206": "1",
      "02008": "50"
    }
  },
  "01206": {
    "gold": 5000,
    "prods": {
      "01003": "10",
      "01207": "1"
    }
  },
  "01207": {
    "gold": 1000,
    "prods": {
      "01208": 5.0
    }
  },
  "01209": {
    "gold": 18000,
    "prods": {
      "01006": "20",
      "01210": "1",
      "02021": "50"
    }
  },
  "01210": {
    "gold": 5000,
    "prods": {
      "01003": "10",
      "01211": "1"
    }
  },
  "01211": {
    "gold": 1000,
    "prods": {
      "01212": 5.0
    }
  },
  "01301": {
    "gold": 18000,
    "prods": {
      "01004": "20",
      "01302": "1",
      "02009": "50"
    }
  },
  "01302": {
    "gold": 5000,
    "prods": {
      "01001": "10",
      "01303": "1"
    }
  },
  "01303": {
    "gold": 1000,
    "prods": {
      "01304": 5.0
    }
  },
  "01305": {
    "gold": 18000,
    "prods": {
      "01004": "20",
      "01306": "1",
      "02010": "50"
    }
  },
  "01306": {
    "gold": 5000,
    "prods": {
      "01001": "10",
      "01307": "1"
    }
  },
  "01307": {
    "gold": 1000,
    "prods": {
      "01308": 5.0
    }
  },
  "01309": {
    "gold": 18000,
    "prods": {
      "01004": "20",
      "01310": "1",
      "02011": "50"
    }
  },
  "01310": {
    "gold": 5000,
    "prods": {
      "01001": "10",
      "01311": "1"
    }
  },
  "01311": {
    "gold": 1000,
    "prods": {
      "01312": 5.0
    }
  },
  "01401": {
    "gold": 18000,
    "prods": {
      "01004": "20",
      "01402": "1",
      "02012": "50"
    }
  },
  "01402": {
    "gold": 5000,
    "prods": {
      "01001": "10",
      "01403": "1"
    }
  },
  "01403": {
    "gold": 1000,
    "prods": {
      "01404": 5.0
    }
  },
  "01405": {
    "gold": 18000,
    "prods": {
      "01004": "20",
      "01406": "1",
      "02013": "50"
    }
  },
  "01406": {
    "gold": 5000,
    "prods": {
      "01001": "10",
      "01407": "1"
    }
  },
  "01407": {
    "gold": 1000,
    "prods": {
      "01408": 5.0
    }
  },
  "01409": {
    "gold": 18000,
    "prods": {
      "01004": "20",
      "01410": "1",
      "02014": "50"
    }
  },
  "01410": {
    "gold": 5000,
    "prods": {
      "01001": "10",
      "01411": "1"
    }
  },
  "01411": {
    "gold": 1000,
    "prods": {
      "01412": 5.0
    }
  },
  "01501": {
    "gold": 18000,
    "prods": {
      "01005": "20",
      "01502": "1",
      "02020": "50"
    }
  },
  "01502": {
    "gold": 5000,
    "prods": {
      "01002": "10",
      "01503": "1"
    }
  },
  "01503": {
    "gold": 1000,
    "prods": {
      "01504": 5.0
    }
  },
  "01505": {
    "gold": 18000,
    "prods": {
      "01005": "20",
      "01506": "1",
      "02019": "50"
    }
  },
  "01506": {
    "gold": 5000,
    "prods": {
      "01002": "10",
      "01507": "1"
    }
  },
  "01507": {
    "gold": 1000,
    "prods": {
      "01508": 5.0
    }
  },
  "01509": {
    "gold": 18000,
    "prods": {
      "01005": "20",
      "01510": "1",
      "02018": "50"
    }
  },
  "01510": {
    "gold": 5000,
    "prods": {
      "01002": "10",
      "01511": "1"
    }
  },
  "01511": {
    "gold": 1000,
    "prods": {
      "01512": 5.0
    }
  },
  "01601": {
    "gold": 5000,
    "prods": {
      "01003": "10",
      "01602": "1"
    }
  },
  "01602": {
    "gold": 1000,
    "prods": {
      "01603": 5.0
    }
  },
  "01604": {
    "gold": 18000,
    "prods": {
      "01006": "20",
      "01601": "1",
      "02015": "50"
    }
  },
  "01606": {
    "gold": 18000,
    "prods": {
      "01006": "20",
      "01610": "1",
      "02016": "50"
    }
  },
  "01608": {
    "gold": 18000,
    "prods": {
      "01006": "20",
      "01611": "1",
      "02017": "50"
    }
  },
  "01609": {
    "gold": 1000,
    "prods": {
      "01607": 5.0
    }
  },
  "01610": {
    "gold": 5000,
    "prods": {
      "01003": "10",
      "01612": "1"
    }
  },
  "01611": {
    "gold": 5000,
    "prods": {
      "01003": "10",
      "01609": "1"
    }
  },
  "01612": {
    "gold": 1000,
    "prods": {
      "01605": 5.0
    }
  }
}
PRODSELLOUT = {
  "01001": {
    "gold": 300
  },
  "01002": {
    "gold": 300
  },
  "01003": {
    "gold": 300
  },
  "01004": {
    "gold": 300
  },
  "01005": {
    "gold": 300
  },
  "01006": {
    "gold": 300
  },
  "01101": {
    "gold": 8000
  },
  "01102": {
    "gold": 3000
  },
  "01103": {
    "gold": 1500
  },
  "01104": {
    "gold": 300
  },
  "01105": {
    "gold": 8000
  },
  "01106": {
    "gold": 3000
  },
  "01107": {
    "gold": 1500
  },
  "01108": {
    "gold": 300
  },
  "01109": {
    "gold": 8000
  },
  "01110": {
    "gold": 3000
  },
  "01111": {
    "gold": 1500
  },
  "01112": {
    "gold": 300
  },
  "01113": {
    "gold": 8000
  },
  "01114": {
    "gold": 3000
  },
  "01115": {
    "gold": 1500
  },
  "01116": {
    "gold": 300
  },
  "01117": {
    "gold": 8000
  },
  "01118": {
    "gold": 3000
  },
  "01119": {
    "gold": 1500
  },
  "01120": {
    "gold": 300
  },
  "01121": {
    "gold": 8000
  },
  "01122": {
    "gold": 3000
  },
  "01123": {
    "gold": 1500
  },
  "01124": {
    "gold": 300
  },
  "01201": {
    "gold": 8000
  },
  "01202": {
    "gold": 3000
  },
  "01203": {
    "gold": 1500
  },
  "01204": {
    "gold": 300
  },
  "01205": {
    "gold": 8000
  },
  "01206": {
    "gold": 3000
  },
  "01207": {
    "gold": 1500
  },
  "01208": {
    "gold": 300
  },
  "01209": {
    "gold": 8000
  },
  "01210": {
    "gold": 3000
  },
  "01211": {
    "gold": 1500
  },
  "01212": {
    "gold": 300
  },
  "01301": {
    "gold": 8000
  },
  "01302": {
    "gold": 3000
  },
  "01303": {
    "gold": 1500
  },
  "01304": {
    "gold": 300
  },
  "01305": {
    "gold": 8000
  },
  "01306": {
    "gold": 3000
  },
  "01307": {
    "gold": 1500
  },
  "01308": {
    "gold": 300
  },
  "01309": {
    "gold": 8000
  },
  "01310": {
    "gold": 3000
  },
  "01311": {
    "gold": 1500
  },
  "01312": {
    "gold": 300
  },
  "01401": {
    "gold": 8000
  },
  "01402": {
    "gold": 3000
  },
  "01403": {
    "gold": 1500
  },
  "01404": {
    "gold": 300
  },
  "01405": {
    "gold": 8000
  },
  "01406": {
    "gold": 3000
  },
  "01407": {
    "gold": 1500
  },
  "01408": {
    "gold": 300
  },
  "01409": {
    "gold": 8000
  },
  "01410": {
    "gold": 3000
  },
  "01411": {
    "gold": 1500
  },
  "01412": {
    "gold": 300
  },
  "01501": {
    "gold": 8000
  },
  "01502": {
    "gold": 3000
  },
  "01503": {
    "gold": 1500
  },
  "01504": {
    "gold": 300
  },
  "01505": {
    "gold": 8000
  },
  "01506": {
    "gold": 3000
  },
  "01507": {
    "gold": 1500
  },
  "01508": {
    "gold": 300
  },
  "01509": {
    "gold": 8000
  },
  "01510": {
    "gold": 3000
  },
  "01511": {
    "gold": 1500
  },
  "01512": {
    "gold": 300
  },
  "01601": {
    "gold": 3000
  },
  "01602": {
    "gold": 1500
  },
  "01603": {
    "gold": 300
  },
  "01604": {
    "gold": 8000
  },
  "01605": {
    "gold": 300
  },
  "01606": {
    "gold": 8000
  },
  "01607": {
    "gold": 300
  },
  "01608": {
    "gold": 8000
  },
  "01609": {
    "gold": 1500
  },
  "01610": {
    "gold": 3000
  },
  "01611": {
    "gold": 3000
  },
  "01612": {
    "gold": 1500
  },
  "02001": {
    "gold": 2000
  },
  "02002": {
    "gold": 2000
  },
  "02003": {
    "gold": 2000
  },
  "02004": {
    "gold": 2000
  },
  "02005": {
    "gold": 2000
  },
  "02006": {
    "gold": 2000
  },
  "02007": {
    "gold": 2000
  },
  "02008": {
    "gold": 2000
  },
  "02009": {
    "gold": 2000
  },
  "02010": {
    "gold": 2000
  },
  "02011": {
    "gold": 2000
  },
  "02012": {
    "gold": 2000
  },
  "02013": {
    "gold": 2000
  },
  "02014": {
    "gold": 2000
  },
  "02015": {
    "gold": 2000
  },
  "02016": {
    "gold": 2000
  },
  "02017": {
    "gold": 2000
  },
  "02018": {
    "gold": 2000
  },
  "02019": {
    "gold": 2000
  },
  "02020": {
    "gold": 2000
  },
  "02021": {
    "gold": 2000
  },
  "03001": {
    "gold": 4000
  },
  "03002": {
    "gold": 4000
  },
  "03003": {
    "gold": 4000
  },
  "03004": {
    "gold": 4000
  },
  "03005": {
    "gold": 4000
  },
  "03006": {
    "gold": 4000
  },
  "03007": {
    "gold": 4000
  },
  "03008": {
    "gold": 4000
  },
  "03009": {
    "gold": 4000
  },
  "03010": {
    "gold": 4000
  },
  "03011": {
    "gold": 4000
  },
  "03012": {
    "gold": 4000
  },
  "03013": {
    "gold": 4000
  },
  "03014": {
    "gold": 4000
  },
  "03015": {
    "gold": 4000
  },
  "03016": {
    "gold": 4000
  },
  "03017": {
    "gold": 4000
  },
  "03018": {
    "gold": 4000
  },
  "03019": {
    "gold": 4000
  },
  "03020": {
    "gold": 4000
  },
  "03021": {
    "gold": 4000
  },
  "03022": {
    "gold": 4000
  },
  "03023": {
    "gold": 4000
  },
  "03024": {
    "gold": 4000
  },
  "03025": {
    "gold": 4000
  },
  "03026": {
    "gold": 4000
  },
  "03027": {
    "gold": 4000
  },
  "03028": {
    "gold": 4000
  },
  "03029": {
    "gold": 4000
  },
  "03030": {
    "gold": 4000
  },
  "03031": {
    "gold": 4000
  },
  "03032": {
    "gold": 4000
  },
  "03033": {
    "gold": 4000
  },
  "03034": {
    "gold": 4000
  },
  "03035": {
    "gold": 4000
  },
  "04001": {
    "gold": 600
  },
  "04002": {
    "gold": 1000
  },
  "04003": {
    "gold": 0
  },
  "05001": {
    "gold": 0
  },
  "05002": {
    "gold": 0
  },
  "05003": {
    "gold": 0
  },
  "05004": {
    "gold": 0
  },
  "06001": {
    "gold": 0
  },
  "06002": {
    "gold": 0
  }
}
PRODS = [
  "01001",
  "01002",
  "01003",
  "01004",
  "01005",
  "01006",
  "01101",
  "01102",
  "01103",
  "01104",
  "01105",
  "01106",
  "01107",
  "01108",
  "01109",
  "01110",
  "01111",
  "01112",
  "01113",
  "01114",
  "01115",
  "01116",
  "01117",
  "01118",
  "01119",
  "01120",
  "01121",
  "01122",
  "01123",
  "01124",
  "01201",
  "01202",
  "01203",
  "01204",
  "01205",
  "01206",
  "01207",
  "01208",
  "01209",
  "01210",
  "01211",
  "01212",
  "01301",
  "01302",
  "01303",
  "01304",
  "01305",
  "01306",
  "01307",
  "01308",
  "01309",
  "01310",
  "01311",
  "01312",
  "01401",
  "01402",
  "01403",
  "01404",
  "01405",
  "01406",
  "01407",
  "01408",
  "01409",
  "01410",
  "01411",
  "01412",
  "01501",
  "01502",
  "01503",
  "01504",
  "01505",
  "01506",
  "01507",
  "01508",
  "01509",
  "01510",
  "01511",
  "01512",
  "01601",
  "01602",
  "01603",
  "01604",
  "01605",
  "01606",
  "01607",
  "01608",
  "01609",
  "01610",
  "01611",
  "01612",
  "02001",
  "02002",
  "02003",
  "02004",
  "02005",
  "02006",
  "02007",
  "02008",
  "02009",
  "02010",
  "02011",
  "02012",
  "02013",
  "02014",
  "02015",
  "02016",
  "02017",
  "02018",
  "02019",
  "02020",
  "02021",
  "03001",
  "03002",
  "03003",
  "03004",
  "03005",
  "03006",
  "03007",
  "03008",
  "03009",
  "03010",
  "03011",
  "03012",
  "03013",
  "03014",
  "03015",
  "03016",
  "03017",
  "03018",
  "03019",
  "03020",
  "03021",
  "03022",
  "03023",
  "03024",
  "03025",
  "03026",
  "03027",
  "03028",
  "03029",
  "03030",
  "03031",
  "03032",
  "03033",
  "03034",
  "03035",
  "04001",
  "04002",
  "04003",
  "05001",
  "05002",
  "05003",
  "05004",
  "06001",
  "06002"
]
HERO = {
  "01001": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01001",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01002": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01002",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01003": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01003",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01004": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01004",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01005": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01005",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01006": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01006",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01007": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01007",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01008": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01008",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01009": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01009",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01010": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01010",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01011": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01011",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01012": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01012",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01013": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01013",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01014": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01014",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01015": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01015",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01016": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01016",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01017": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01017",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01018": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01018",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01019": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01019",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01020": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01020",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01021": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01021",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01022": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01022",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01023": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01023",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01024": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01024",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01025": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01025",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01026": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01026",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01027": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01027",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01028": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01028",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01029": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01029",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01030": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01030",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01031": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01031",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01032": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01032",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01033": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01033",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01034": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01034",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  },
  "01035": {
    "color": 0,
    "equips": [
      0,
      0,
      0,
      0,
      0,
      0
    ],
    "hid": "01035",
    "skills": [
      0,
      0,
      0,
      0
    ],
    "star": 0,
    "xp": 0
  }
}
#所有武将 新战舰
ALLHEROIDS = [
  "01001",
  "01002",
  "01003",
  "01006",
  "01007",
  "01008",
  "01010",
  "01011",
  "01012",
  "01013",
  "01014",
  "01015",
  "01016",
  "01017",
  "01019",
  "01020",
  "01021",
  "01022",
  "01023",
  "01024",
  "01025",
  "01026",
  "01027",
  "01031"
]

#风云物ALLH品
STORMPROD = {
  "03008": {
    "name": "巨人级航母",
    "num": 1.0
  },
  "03017": {
    "name": "宾夕法尼亚级",
    "num": 1.0
  },
  "03023": {
    "name": "独立级航母",
    "num": 1.0
  },
  "03024": {
    "name": "天鹰级航母",
    "num": 1.0
  },
  "03025": {
    "name": "半人马级航母",
    "num": 1.0
  },
  "03026": {
    "name": "敦刻尔克级",
    "num": 1.0
  },
  "03027": {
    "name": "俾斯麦级",
    "num": 1.0
  },
  "03031": {
    "name": "XXVI型潜艇",
    "num": 1.0
  },
  "06001": {
    "name": "艾瑟",
    "num": 1.0
  },
  "06002": {
    "name": "梅格",
    "num": 1.0
  },
  "06003": {
    "name": "朱丽",
    "num": 1.0
  },
  "06004": {
    "name": "艾玛",
    "num": 1.0
  },
  "06005": {
    "name": "莲恩",
    "num": 1.0
  },
  "06006": {
    "name": "雯丽",
    "num": 1.0
  }
}
LOTTMESSAGE = [u'#3%s3#在战舰召唤中获得了#3极品3#物品:#2%s2#', '%s']
BEAUTYMESSAGE = [u'#3%s3#获得了女团团员:#3%s3#', '%s']
LINGERMESSAGE = [u'#3%s3#升级女团团员#2%s2#，升到了#3%s3#级。', '%s']
ARENATOPMESSAGE = [u'#3%s3##5天下无敌，万人臣服！5#在帝国争霸中战胜了#2%s2#,成为帝国争霸#4第一名4#,快来膜拜吧！', '%s']
ARENA_TOP_10 = [u'#3%s3#勇冠天下,在帝国争霸中战胜了#2%s2#,排名第#5%s5#名', '%s']
ARENA_TOP_50 = [u'#3%s3#霸气初显,在帝国争霸中战胜了#2%s2#,排名第#5%s5#名', '%s']
ARENA_WIN_ELSE = [u'#3%s3#在帝国争霸中战胜了#2%s2#', '%s']
ARENA_LOSE_ELSE = [u'#3%s3#在帝国争霸中挑战#2%s2#,但是失败了,#2%s2#之威不可撼', '%s']
ARENAWINMESSAGE = [u'#3%s3#霸气外露，在帝国争霸中连续获得了#5三场胜利5#', '%s']

VERSUSTOPMESSAGE = [u'#3%s3#成为群雄争霸#4王者4#', '%s']
VERSUSWINMESSAGE = [u'#3%s3#霸气外露，在帝国争霸中连续获得了#5三场胜利5#', '%s']
#get_hero end==========

#get_herostar start==========
HERORECRUIT = {
  "01001": [
    {
      "gold": 0,
      "prods": {
        "03001": 10
      }
    }
  ],
  "01002": [
    {
      "gold": 0,
      "prods": {
        "03002": 10
      }
    }
  ],
  "01003": [
    {
      "gold": 0,
      "prods": {
        "03003": 10
      }
    }
  ],
  "01004": [
    {
      "gold": 0,
      "prods": {
        "03004": 10
      }
    }
  ],
  "01005": [
    {
      "gold": 0,
      "prods": {
        "03005": 10
      }
    }
  ],
  "01006": [
    {
      "gold": 0,
      "prods": {
        "03006": 10
      }
    }
  ],
  "01007": [
    {
      "gold": 0,
      "prods": {
        "03007": 10
      }
    }
  ],
  "01008": [
    {
      "gold": 0,
      "prods": {
        "03008": 10
      }
    }
  ],
  "01009": [
    {
      "gold": 0,
      "prods": {
        "03009": 10
      }
    }
  ],
  "01010": [
    {
      "gold": 0,
      "prods": {
        "03010": 10
      }
    }
  ],
  "01011": [
    {
      "gold": 0,
      "prods": {
        "03011": 10
      }
    }
  ],
  "01012": [
    {
      "gold": 0,
      "prods": {
        "03012": 10
      }
    }
  ],
  "01013": [
    {
      "gold": 0,
      "prods": {
        "03013": 10
      }
    }
  ],
  "01014": [
    {
      "gold": 0,
      "prods": {
        "03014": 10
      }
    }
  ],
  "01015": [
    {
      "gold": 0,
      "prods": {
        "03015": 10
      }
    }
  ],
  "01016": [
    {
      "gold": 0,
      "prods": {
        "03016": 10
      }
    }
  ],
  "01017": [
    {
      "gold": 0,
      "prods": {
        "03017": 10
      }
    }
  ],
  "01018": [
    {
      "gold": 0,
      "prods": {
        "03018": 10
      }
    }
  ],
  "01019": [
    {
      "gold": 0,
      "prods": {
        "03019": 10
      }
    }
  ],
  "01020": [
    {
      "gold": 0,
      "prods": {
        "03020": 10
      }
    }
  ],
  "01021": [
    {
      "gold": 0,
      "prods": {
        "03021": 10
      }
    }
  ],
  "01022": [
    {
      "gold": 0,
      "prods": {
        "03022": 10
      }
    }
  ],
  "01023": [
    {
      "gold": 0,
      "prods": {
        "03023": 10
      }
    }
  ],
  "01024": [
    {
      "gold": 0,
      "prods": {
        "03024": 10
      }
    }
  ],
  "01025": [
    {
      "gold": 0,
      "prods": {
        "03025": 10
      }
    }
  ],
  "01026": [
    {
      "gold": 0,
      "prods": {
        "03026": 10
      }
    }
  ],
  "01027": [
    {
      "gold": 0,
      "prods": {
        "03027": 10
      }
    }
  ],
  "01028": [
    {
      "gold": 0,
      "prods": {
        "03028": 10
      }
    }
  ],
  "01029": [
    {
      "gold": 0,
      "prods": {
        "03029": 10
      }
    }
  ],
  "01030": [
    {
      "gold": 0,
      "prods": {
        "03030": 10
      }
    }
  ],
  "01031": [
    {
      "gold": 0,
      "prods": {
        "03031": 10
      }
    }
  ],
  "01032": [
    {
      "gold": 0,
      "prods": {
        "03032": 10
      }
    }
  ],
  "01033": [
    {
      "gold": 0,
      "prods": {
        "03033": 10
      }
    }
  ],
  "01034": [
    {
      "gold": 0,
      "prods": {
        "03034": 10
      }
    }
  ],
  "01035": [
    {
      "gold": 0,
      "prods": {
        "03035": 10
      }
    }
  ]
}
HEROSTAR = {
  "01001": [
    {
      "gold": 35000,
      "prods": {
        "03001": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03001": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03001": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03001": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03001": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03001": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03001": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03001": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03001": 500
      }
    }
  ],
  "01002": [
    {
      "gold": 35000,
      "prods": {
        "03002": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03002": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03002": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03002": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03002": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03002": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03002": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03002": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03002": 500
      }
    }
  ],
  "01003": [
    {
      "gold": 35000,
      "prods": {
        "03003": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03003": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03003": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03003": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03003": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03003": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03003": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03003": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03003": 500
      }
    }
  ],
  "01004": [
    {
      "gold": 35000,
      "prods": {
        "03004": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03004": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03004": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03004": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03004": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03004": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03004": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03004": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03004": 500
      }
    }
  ],
  "01005": [
    {
      "gold": 35000,
      "prods": {
        "03005": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03005": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03005": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03005": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03005": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03005": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03005": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03005": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03005": 500
      }
    }
  ],
  "01006": [
    {
      "gold": 35000,
      "prods": {
        "03006": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03006": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03006": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03006": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03006": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03006": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03006": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03006": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03006": 500
      }
    }
  ],
  "01007": [
    {
      "gold": 35000,
      "prods": {
        "03007": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03007": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03007": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03007": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03007": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03007": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03007": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03007": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03007": 500
      }
    }
  ],
  "01008": [
    {
      "gold": 35000,
      "prods": {
        "03008": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03008": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03008": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03008": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03008": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03008": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03008": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03008": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03008": 500
      }
    }
  ],
  "01009": [
    {
      "gold": 35000,
      "prods": {
        "03009": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03009": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03009": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03009": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03009": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03009": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03009": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03009": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03009": 500
      }
    }
  ],
  "01010": [
    {
      "gold": 35000,
      "prods": {
        "03010": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03010": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03010": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03010": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03010": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03010": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03010": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03010": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03010": 500
      }
    }
  ],
  "01011": [
    {
      "gold": 35000,
      "prods": {
        "03011": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03011": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03011": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03011": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03011": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03011": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03011": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03011": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03011": 500
      }
    }
  ],
  "01012": [
    {
      "gold": 35000,
      "prods": {
        "03012": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03012": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03012": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03012": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03012": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03012": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03012": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03012": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03012": 500
      }
    }
  ],
  "01013": [
    {
      "gold": 35000,
      "prods": {
        "03013": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03013": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03013": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03013": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03013": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03013": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03013": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03013": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03013": 500
      }
    }
  ],
  "01014": [
    {
      "gold": 35000,
      "prods": {
        "03014": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03014": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03014": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03014": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03014": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03014": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03014": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03014": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03014": 500
      }
    }
  ],
  "01015": [
    {
      "gold": 35000,
      "prods": {
        "03015": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03015": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03015": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03015": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03015": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03015": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03015": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03015": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03015": 500
      }
    }
  ],
  "01016": [
    {
      "gold": 35000,
      "prods": {
        "03016": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03016": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03016": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03016": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03016": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03016": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03016": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03016": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03016": 500
      }
    }
  ],
  "01017": [
    {
      "gold": 35000,
      "prods": {
        "03017": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03017": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03017": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03017": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03017": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03017": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03017": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03017": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03017": 500
      }
    }
  ],
  "01018": [
    {
      "gold": 35000,
      "prods": {
        "03018": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03018": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03018": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03018": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03018": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03018": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03018": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03018": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03018": 500
      }
    }
  ],
  "01019": [
    {
      "gold": 35000,
      "prods": {
        "03019": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03019": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03019": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03019": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03019": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03019": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03019": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03019": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03019": 500
      }
    }
  ],
  "01020": [
    {
      "gold": 35000,
      "prods": {
        "03020": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03020": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03020": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03020": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03020": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03020": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03020": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03020": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03020": 500
      }
    }
  ],
  "01021": [
    {
      "gold": 35000,
      "prods": {
        "03021": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03021": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03021": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03021": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03021": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03021": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03021": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03021": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03021": 500
      }
    }
  ],
  "01022": [
    {
      "gold": 35000,
      "prods": {
        "03022": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03022": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03022": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03022": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03022": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03022": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03022": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03022": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03022": 500
      }
    }
  ],
  "01023": [
    {
      "gold": 35000,
      "prods": {
        "03023": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03023": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03023": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03023": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03023": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03023": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03023": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03023": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03023": 500
      }
    }
  ],
  "01024": [
    {
      "gold": 35000,
      "prods": {
        "03024": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03024": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03024": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03024": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03024": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03024": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03024": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03024": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03024": 500
      }
    }
  ],
  "01025": [
    {
      "gold": 35000,
      "prods": {
        "03025": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03025": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03025": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03025": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03025": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03025": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03025": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03025": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03025": 500
      }
    }
  ],
  "01026": [
    {
      "gold": 35000,
      "prods": {
        "03026": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03026": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03026": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03026": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03026": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03026": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03026": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03026": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03026": 500
      }
    }
  ],
  "01027": [
    {
      "gold": 35000,
      "prods": {
        "03027": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03027": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03027": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03027": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03027": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03027": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03027": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03027": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03027": 500
      }
    }
  ],
  "01028": [
    {
      "gold": 35000,
      "prods": {
        "03028": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03028": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03028": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03028": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03028": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03028": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03028": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03028": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03028": 500
      }
    }
  ],
  "01029": [
    {
      "gold": 35000,
      "prods": {
        "03029": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03029": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03029": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03029": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03029": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03029": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03029": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03029": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03029": 500
      }
    }
  ],
  "01030": [
    {
      "gold": 35000,
      "prods": {
        "03030": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03030": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03030": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03030": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03030": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03030": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03030": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03030": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03030": 500
      }
    }
  ],
  "01031": [
    {
      "gold": 35000,
      "prods": {
        "03031": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03031": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03031": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03031": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03031": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03031": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03031": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03031": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03031": 500
      }
    }
  ],
  "01032": [
    {
      "gold": 35000,
      "prods": {
        "03032": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03032": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03032": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03032": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03032": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03032": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03032": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03032": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03032": 500
      }
    }
  ],
  "01033": [
    {
      "gold": 35000,
      "prods": {
        "03033": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03033": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03033": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03033": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03033": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03033": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03033": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03033": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03033": 500
      }
    }
  ],
  "01034": [
    {
      "gold": 35000,
      "prods": {
        "03034": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03034": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03034": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03034": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03034": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03034": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03034": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03034": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03034": 500
      }
    }
  ],
  "01035": [
    {
      "gold": 35000,
      "prods": {
        "03035": 20
      }
    },
    {
      "gold": 120000,
      "prods": {
        "03035": 50
      }
    },
    {
      "gold": 300000,
      "prods": {
        "03035": 100
      }
    },
    {
      "gold": 800000,
      "prods": {
        "03035": 150
      }
    },
    {
      "gold": 1200000,
      "prods": {
        "03035": 200
      }
    },
    {
      "gold": 3000000,
      "prods": {
        "03035": 300
      }
    },
    {
      "gold": 8000000,
      "prods": {
        "03035": 350
      }
    },
    {
      "gold": 12000000,
      "prods": {
        "03035": 400
      }
    },
    {
      "gold": 20000000,
      "prods": {
        "03035": 500
      }
    }
  ]
}
HEROTRANS = {
  10: 7,
  30: 18,
  80: 30,
  180: 40,
  280: 50
}
#get_herostar end==========

#get_match==========
#普通关卡物品掉落次数
BATT_ITEMS_NUM_MIN = 1
BATT_ITEMS_NUM_MAX = 2
#精英关卡物品掉落次数
HARDBATT_ITEMS_NUM_MIN = 2
HARDBATT_ITEMS_NUM_MAX = 2
#试炼物品掉落次数
INST_ITEMS_NUM = 1

#战役关卡 武将出场
FIRSTBATT = {
  "010101": {
    "feat": 0,
    "gold": 0,
    "prods": {
      "01001": 1
    },
    "rock": 0
  },
  "010102": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010103": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010104": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010105": {
    "feat": 0,
    "gold": 0,
    "prods": {
      "01108": 1,
      "01204": 1,
      "01312": 1,
      "01512": 1,
      "01607": 1
    },
    "rock": 0
  },
  "010106": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010107": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010108": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010109": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010201": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010202": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010203": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010204": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010205": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010206": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010207": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010208": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010209": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010301": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010302": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010303": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010304": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010305": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010306": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010307": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010308": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010309": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010401": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010402": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010403": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010404": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010405": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010406": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010407": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010408": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010409": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010501": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010502": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010503": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010504": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010505": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010506": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010507": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010508": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010509": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010601": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010602": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010603": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010604": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010605": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010606": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010607": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010608": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010609": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010701": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010702": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010703": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010704": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010705": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010706": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010707": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010708": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010709": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010801": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010802": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010803": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010804": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010805": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010806": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010807": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010808": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010809": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010901": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010902": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010903": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010904": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010905": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010906": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010907": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010908": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "010909": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "011001": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "011002": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "011003": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "011004": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "011005": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "011006": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "011007": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "011008": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  },
  "011009": {
    "feat": 0,
    "gold": 0,
    "rock": 0
  }
}
#战役关卡 关卡汇总 关卡奖励
MATCH = {
  "010101": {
    "feat": 60,
    "gold": 600,
    "hp": 6,
    "hxp": 12,
    "label": "010101",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010102": {
    "feat": 0,
    "gold": 600,
    "hp": 6,
    "hxp": 14,
    "label": "010102",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010103": {
    "feat": 60,
    "gold": 610,
    "hp": 6,
    "hxp": 15,
    "label": "010103",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010104": {
    "feat": 0,
    "gold": 610,
    "hp": 6,
    "hxp": 17,
    "label": "010104",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010105": {
    "feat": 120,
    "gold": 620,
    "hp": 6,
    "hxp": 18,
    "label": "010105",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010106": {
    "feat": 0,
    "gold": 620,
    "hp": 6,
    "hxp": 19,
    "label": "010106",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010107": {
    "feat": 120,
    "gold": 630,
    "hp": 6,
    "hxp": 20,
    "label": "010107",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010108": {
    "feat": 0,
    "gold": 630,
    "hp": 6,
    "hxp": 20,
    "label": "010108",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010109": {
    "feat": 120,
    "gold": 640,
    "hp": 6,
    "hxp": 20,
    "label": "010109",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010191": {
    "feat": 120,
    "gold": 1200,
    "hp": 12,
    "hxp": 24,
    "label": "010191",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 12
  },
  "010192": {
    "feat": 120,
    "gold": 1220,
    "hp": 12,
    "hxp": 30,
    "label": "010192",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 12
  },
  "010193": {
    "feat": 240,
    "gold": 1240,
    "hp": 12,
    "hxp": 36,
    "label": "010193",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 12
  },
  "010194": {
    "feat": 240,
    "gold": 1260,
    "hp": 12,
    "hxp": 40,
    "label": "010194",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 12
  },
  "010195": {
    "feat": 240,
    "gold": 1280,
    "hp": 12,
    "hxp": 40,
    "label": "010195",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 12
  },
  "010201": {
    "feat": 120,
    "gold": 700,
    "hp": 6,
    "hxp": 20,
    "label": "010201",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010202": {
    "feat": 0,
    "gold": 700,
    "hp": 6,
    "hxp": 21,
    "label": "010202",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010203": {
    "feat": 120,
    "gold": 710,
    "hp": 6,
    "hxp": 21,
    "label": "010203",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010204": {
    "feat": 0,
    "gold": 710,
    "hp": 6,
    "hxp": 21,
    "label": "010204",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010205": {
    "feat": 120,
    "gold": 720,
    "hp": 6,
    "hxp": 22,
    "label": "010205",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010206": {
    "feat": 0,
    "gold": 720,
    "hp": 6,
    "hxp": 22,
    "label": "010206",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010207": {
    "feat": 120,
    "gold": 730,
    "hp": 6,
    "hxp": 22,
    "label": "010207",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010208": {
    "feat": 0,
    "gold": 730,
    "hp": 6,
    "hxp": 22,
    "label": "010208",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010209": {
    "feat": 120,
    "gold": 740,
    "hp": 6,
    "hxp": 22,
    "label": "010209",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010291": {
    "feat": 240,
    "gold": 1400,
    "hp": 12,
    "hxp": 40,
    "label": "010291",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 12
  },
  "010292": {
    "feat": 240,
    "gold": 1420,
    "hp": 12,
    "hxp": 42,
    "label": "010292",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 12
  },
  "010293": {
    "feat": 240,
    "gold": 1440,
    "hp": 12,
    "hxp": 44,
    "label": "010293",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 12
  },
  "010294": {
    "feat": 240,
    "gold": 1460,
    "hp": 12,
    "hxp": 44,
    "label": "010294",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 12
  },
  "010295": {
    "feat": 240,
    "gold": 1480,
    "hp": 12,
    "hxp": 44,
    "label": "010295",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 12
  },
  "010301": {
    "feat": 120,
    "gold": 830,
    "hp": 6,
    "hxp": 24,
    "label": "010301",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010302": {
    "feat": 0,
    "gold": 830,
    "hp": 6,
    "hxp": 25,
    "label": "010302",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010303": {
    "feat": 120,
    "gold": 840,
    "hp": 6,
    "hxp": 26,
    "label": "010303",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010304": {
    "feat": 0,
    "gold": 840,
    "hp": 6,
    "hxp": 26,
    "label": "010304",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010305": {
    "feat": 120,
    "gold": 850,
    "hp": 6,
    "hxp": 27,
    "label": "010305",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010306": {
    "feat": 0,
    "gold": 850,
    "hp": 6,
    "hxp": 27,
    "label": "010306",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010307": {
    "feat": 120,
    "gold": 860,
    "hp": 6,
    "hxp": 28,
    "label": "010307",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010308": {
    "feat": 0,
    "gold": 860,
    "hp": 6,
    "hxp": 28,
    "label": "010308",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010309": {
    "feat": 120,
    "gold": 870,
    "hp": 6,
    "hxp": 29,
    "label": "010309",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010391": {
    "feat": 240,
    "gold": 1660,
    "hp": 12,
    "hxp": 48,
    "label": "010391",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 12
  },
  "010392": {
    "feat": 240,
    "gold": 1680,
    "hp": 12,
    "hxp": 52,
    "label": "010392",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 12
  },
  "010393": {
    "feat": 240,
    "gold": 1700,
    "hp": 12,
    "hxp": 54,
    "label": "010393",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 12
  },
  "010394": {
    "feat": 240,
    "gold": 1720,
    "hp": 12,
    "hxp": 56,
    "label": "010394",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 12
  },
  "010395": {
    "feat": 240,
    "gold": 1740,
    "hp": 12,
    "hxp": 58,
    "label": "010395",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 12
  },
  "010401": {
    "feat": 180,
    "gold": 980,
    "hp": 6,
    "hxp": 32,
    "label": "010401",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010402": {
    "feat": 0,
    "gold": 980,
    "hp": 6,
    "hxp": 33,
    "label": "010402",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010403": {
    "feat": 180,
    "gold": 990,
    "hp": 6,
    "hxp": 33,
    "label": "010403",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010404": {
    "feat": 0,
    "gold": 990,
    "hp": 6,
    "hxp": 33,
    "label": "010404",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010405": {
    "feat": 180,
    "gold": 1000,
    "hp": 6,
    "hxp": 34,
    "label": "010405",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010406": {
    "feat": 0,
    "gold": 1000,
    "hp": 6,
    "hxp": 35,
    "label": "010406",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010407": {
    "feat": 180,
    "gold": 1010,
    "hp": 6,
    "hxp": 36,
    "label": "010407",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010408": {
    "feat": 0,
    "gold": 1010,
    "hp": 6,
    "hxp": 36,
    "label": "010408",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010409": {
    "feat": 180,
    "gold": 1020,
    "hp": 6,
    "hxp": 37,
    "label": "010409",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010491": {
    "feat": 360,
    "gold": 1960,
    "hp": 12,
    "hxp": 64,
    "label": "010491",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 12
  },
  "010492": {
    "feat": 360,
    "gold": 1980,
    "hp": 12,
    "hxp": 66,
    "label": "010492",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 12
  },
  "010493": {
    "feat": 360,
    "gold": 2000,
    "hp": 12,
    "hxp": 68,
    "label": "010493",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 12
  },
  "010494": {
    "feat": 360,
    "gold": 2020,
    "hp": 12,
    "hxp": 72,
    "label": "010494",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 12
  },
  "010495": {
    "feat": 360,
    "gold": 2040,
    "hp": 12,
    "hxp": 74,
    "label": "010495",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 12
  },
  "010501": {
    "feat": 180,
    "gold": 1300,
    "hp": 6,
    "hxp": 41,
    "label": "010501",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010502": {
    "feat": 0,
    "gold": 1300,
    "hp": 6,
    "hxp": 41,
    "label": "010502",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010503": {
    "feat": 240,
    "gold": 1320,
    "hp": 6,
    "hxp": 43,
    "label": "010503",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010504": {
    "feat": 0,
    "gold": 1320,
    "hp": 6,
    "hxp": 43,
    "label": "010504",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010505": {
    "feat": 240,
    "gold": 1340,
    "hp": 6,
    "hxp": 45,
    "label": "010505",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010506": {
    "feat": 0,
    "gold": 1340,
    "hp": 6,
    "hxp": 46,
    "label": "010506",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010507": {
    "feat": 240,
    "gold": 1360,
    "hp": 6,
    "hxp": 47,
    "label": "010507",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010508": {
    "feat": 0,
    "gold": 1360,
    "hp": 6,
    "hxp": 48,
    "label": "010508",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010509": {
    "feat": 240,
    "gold": 1380,
    "hp": 6,
    "hxp": 49,
    "label": "010509",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010591": {
    "feat": 360,
    "gold": 2600,
    "hp": 16,
    "hxp": 82,
    "label": "010591",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 16
  },
  "010592": {
    "feat": 480,
    "gold": 2640,
    "hp": 16,
    "hxp": 86,
    "label": "010592",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 16
  },
  "010593": {
    "feat": 480,
    "gold": 2680,
    "hp": 16,
    "hxp": 90,
    "label": "010593",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 16
  },
  "010594": {
    "feat": 480,
    "gold": 2720,
    "hp": 16,
    "hxp": 94,
    "label": "010594",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 16
  },
  "010595": {
    "feat": 480,
    "gold": 2760,
    "hp": 16,
    "hxp": 98,
    "label": "010595",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 16
  },
  "010601": {
    "feat": 300,
    "gold": 2600,
    "hp": 6,
    "hxp": 54,
    "label": "010601",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010602": {
    "feat": 0,
    "gold": 2610,
    "hp": 6,
    "hxp": 55,
    "label": "010602",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010603": {
    "feat": 300,
    "gold": 2630,
    "hp": 6,
    "hxp": 56,
    "label": "010603",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010604": {
    "feat": 0,
    "gold": 2640,
    "hp": 6,
    "hxp": 57,
    "label": "010604",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010605": {
    "feat": 300,
    "gold": 2660,
    "hp": 6,
    "hxp": 59,
    "label": "010605",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010606": {
    "feat": 0,
    "gold": 2670,
    "hp": 6,
    "hxp": 60,
    "label": "010606",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010607": {
    "feat": 300,
    "gold": 2690,
    "hp": 6,
    "hxp": 62,
    "label": "010607",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010608": {
    "feat": 0,
    "gold": 2700,
    "hp": 6,
    "hxp": 63,
    "label": "010608",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010609": {
    "feat": 300,
    "gold": 2720,
    "hp": 6,
    "hxp": 65,
    "label": "010609",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010691": {
    "feat": 600,
    "gold": 5200,
    "hp": 16,
    "hxp": 108,
    "label": "010691",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 16
  },
  "010692": {
    "feat": 600,
    "gold": 5260,
    "hp": 16,
    "hxp": 112,
    "label": "010692",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 16
  },
  "010693": {
    "feat": 600,
    "gold": 5320,
    "hp": 16,
    "hxp": 118,
    "label": "010693",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 16
  },
  "010694": {
    "feat": 600,
    "gold": 5380,
    "hp": 16,
    "hxp": 124,
    "label": "010694",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 16
  },
  "010695": {
    "feat": 600,
    "gold": 5440,
    "hp": 16,
    "hxp": 130,
    "label": "010695",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 16
  },
  "010701": {
    "feat": 360,
    "gold": 3910,
    "hp": 6,
    "hxp": 72,
    "label": "010701",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010702": {
    "feat": 0,
    "gold": 3920,
    "hp": 6,
    "hxp": 73,
    "label": "010702",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010703": {
    "feat": 360,
    "gold": 3940,
    "hp": 6,
    "hxp": 75,
    "label": "010703",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010704": {
    "feat": 0,
    "gold": 3950,
    "hp": 6,
    "hxp": 76,
    "label": "010704",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010705": {
    "feat": 420,
    "gold": 3970,
    "hp": 6,
    "hxp": 78,
    "label": "010705",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010706": {
    "feat": 0,
    "gold": 3980,
    "hp": 6,
    "hxp": 79,
    "label": "010706",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010707": {
    "feat": 420,
    "gold": 4000,
    "hp": 6,
    "hxp": 83,
    "label": "010707",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010708": {
    "feat": 0,
    "gold": 4010,
    "hp": 6,
    "hxp": 85,
    "label": "010708",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010709": {
    "feat": 420,
    "gold": 4030,
    "hp": 6,
    "hxp": 87,
    "label": "010709",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 6
  },
  "010791": {
    "feat": 720,
    "gold": 7820,
    "hp": 16,
    "hxp": 144,
    "label": "010791",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 16
  },
  "010792": {
    "feat": 720,
    "gold": 7880,
    "hp": 16,
    "hxp": 150,
    "label": "010792",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 16
  },
  "010793": {
    "feat": 840,
    "gold": 7940,
    "hp": 16,
    "hxp": 156,
    "label": "010793",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 16
  },
  "010794": {
    "feat": 840,
    "gold": 8000,
    "hp": 16,
    "hxp": 166,
    "label": "010794",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 16
  },
  "010795": {
    "feat": 840,
    "gold": 8060,
    "hp": 16,
    "hxp": 174,
    "label": "010795",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 16
  },
  "010801": {
    "feat": 480,
    "gold": 5200,
    "hp": 8,
    "hxp": 95,
    "label": "010801",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 8
  },
  "010802": {
    "feat": 0,
    "gold": 5210,
    "hp": 8,
    "hxp": 96,
    "label": "010802",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 8
  },
  "010803": {
    "feat": 480,
    "gold": 5230,
    "hp": 8,
    "hxp": 98,
    "label": "010803",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 8
  },
  "010804": {
    "feat": 0,
    "gold": 5240,
    "hp": 8,
    "hxp": 99,
    "label": "010804",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 8
  },
  "010805": {
    "feat": 480,
    "gold": 5260,
    "hp": 8,
    "hxp": 101,
    "label": "010805",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 8
  },
  "010806": {
    "feat": 0,
    "gold": 5270,
    "hp": 8,
    "hxp": 102,
    "label": "010806",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 8
  },
  "010807": {
    "feat": 540,
    "gold": 5290,
    "hp": 8,
    "hxp": 104,
    "label": "010807",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 8
  },
  "010808": {
    "feat": 0,
    "gold": 5300,
    "hp": 8,
    "hxp": 104,
    "label": "010808",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 8
  },
  "010809": {
    "feat": 540,
    "gold": 5320,
    "hp": 8,
    "hxp": 105,
    "label": "010809",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 8
  },
  "010891": {
    "feat": 960,
    "gold": 10400,
    "hp": 20,
    "hxp": 190,
    "label": "010891",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 20
  },
  "010892": {
    "feat": 960,
    "gold": 10460,
    "hp": 20,
    "hxp": 196,
    "label": "010892",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 20
  },
  "010893": {
    "feat": 960,
    "gold": 10520,
    "hp": 20,
    "hxp": 202,
    "label": "010893",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 20
  },
  "010894": {
    "feat": 1080,
    "gold": 10580,
    "hp": 20,
    "hxp": 208,
    "label": "010894",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 20
  },
  "010895": {
    "feat": 1080,
    "gold": 10640,
    "hp": 20,
    "hxp": 210,
    "label": "010895",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 20
  },
  "010901": {
    "feat": 540,
    "gold": 6500,
    "hp": 8,
    "hxp": 109,
    "label": "010901",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 8
  },
  "010902": {
    "feat": 0,
    "gold": 6510,
    "hp": 8,
    "hxp": 110,
    "label": "010902",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 8
  },
  "010903": {
    "feat": 540,
    "gold": 6530,
    "hp": 8,
    "hxp": 111,
    "label": "010903",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 8
  },
  "010904": {
    "feat": 0,
    "gold": 6540,
    "hp": 8,
    "hxp": 111,
    "label": "010904",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 8
  },
  "010905": {
    "feat": 540,
    "gold": 6560,
    "hp": 8,
    "hxp": 113,
    "label": "010905",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 8
  },
  "010906": {
    "feat": 0,
    "gold": 6570,
    "hp": 8,
    "hxp": 113,
    "label": "010906",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 8
  },
  "010907": {
    "feat": 600,
    "gold": 6590,
    "hp": 8,
    "hxp": 115,
    "label": "010907",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 8
  },
  "010908": {
    "feat": 0,
    "gold": 6600,
    "hp": 8,
    "hxp": 115,
    "label": "010908",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 8
  },
  "010909": {
    "feat": 600,
    "gold": 6620,
    "hp": 8,
    "hxp": 116,
    "label": "010909",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 8
  },
  "010991": {
    "feat": 1080,
    "gold": 13000,
    "hp": 20,
    "hxp": 218,
    "label": "010991",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 20
  },
  "010992": {
    "feat": 1080,
    "gold": 13060,
    "hp": 20,
    "hxp": 222,
    "label": "010992",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 20
  },
  "010993": {
    "feat": 1080,
    "gold": 13120,
    "hp": 20,
    "hxp": 226,
    "label": "010993",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 20
  },
  "010994": {
    "feat": 1200,
    "gold": 13180,
    "hp": 20,
    "hxp": 230,
    "label": "010994",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 20
  },
  "010995": {
    "feat": 1200,
    "gold": 13240,
    "hp": 20,
    "hxp": 232,
    "label": "010995",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 20
  },
  "011001": {
    "feat": 600,
    "gold": 7800,
    "hp": 10,
    "hxp": 124,
    "label": "011001",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 10
  },
  "011002": {
    "feat": 0,
    "gold": 7810,
    "hp": 10,
    "hxp": 125,
    "label": "011002",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 10
  },
  "011003": {
    "feat": 660,
    "gold": 7830,
    "hp": 10,
    "hxp": 127,
    "label": "011003",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 10
  },
  "011004": {
    "feat": 0,
    "gold": 7840,
    "hp": 10,
    "hxp": 128,
    "label": "011004",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 10
  },
  "011005": {
    "feat": 660,
    "gold": 7860,
    "hp": 10,
    "hxp": 129,
    "label": "011005",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 10
  },
  "011006": {
    "feat": 0,
    "gold": 7870,
    "hp": 10,
    "hxp": 130,
    "label": "011006",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 10
  },
  "011007": {
    "feat": 660,
    "gold": 7890,
    "hp": 10,
    "hxp": 131,
    "label": "011007",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 10
  },
  "011008": {
    "feat": 0,
    "gold": 7900,
    "hp": 10,
    "hxp": 132,
    "label": "011008",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 10
  },
  "011009": {
    "feat": 720,
    "gold": 7920,
    "hp": 10,
    "hxp": 134,
    "label": "011009",
    "maxnum": 2,
    "minnum": 2,
    "prods": [],
    "xp": 10
  },
  "011091": {
    "feat": 1200,
    "gold": 15600,
    "hp": 20,
    "hxp": 248,
    "label": "011091",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 20
  },
  "011092": {
    "feat": 1320,
    "gold": 15660,
    "hp": 20,
    "hxp": 254,
    "label": "011092",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 20
  },
  "011093": {
    "feat": 1320,
    "gold": 15720,
    "hp": 20,
    "hxp": 258,
    "label": "011093",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 20
  },
  "011094": {
    "feat": 1320,
    "gold": 15780,
    "hp": 20,
    "hxp": 262,
    "label": "011094",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 20
  },
  "011095": {
    "feat": 1440,
    "gold": 15840,
    "hp": 20,
    "hxp": 268,
    "label": "011095",
    "maxentry": 3,
    "maxnum": 4,
    "minnum": 4,
    "prods": [],
    "xp": 20
  }
}
BATT = [
  "010101",
  "010102",
  "010103",
  "010104",
  "010105",
  "010106",
  "010107",
  "010108",
  "010109",
  "010201",
  "010202",
  "010203",
  "010204",
  "010205",
  "010206",
  "010207",
  "010208",
  "010209",
  "010301",
  "010302",
  "010303",
  "010304",
  "010305",
  "010306",
  "010307",
  "010308",
  "010309",
  "010401",
  "010402",
  "010403",
  "010404",
  "010405",
  "010406",
  "010407",
  "010408",
  "010409",
  "010501",
  "010502",
  "010503",
  "010504",
  "010505",
  "010506",
  "010507",
  "010508",
  "010509",
  "010601",
  "010602",
  "010603",
  "010604",
  "010605",
  "010606",
  "010607",
  "010608",
  "010609",
  "010701",
  "010702",
  "010703",
  "010704",
  "010705",
  "010706",
  "010707",
  "010708",
  "010709",
  "010801",
  "010802",
  "010803",
  "010804",
  "010805",
  "010806",
  "010807",
  "010808",
  "010809",
  "010901",
  "010902",
  "010903",
  "010904",
  "010905",
  "010906",
  "010907",
  "010908",
  "010909",
  "011001",
  "011002",
  "011003",
  "011004",
  "011005",
  "011006",
  "011007",
  "011008",
  "011009"
]
HARDBATT = [
  "010191",
  "010192",
  "010193",
  "010194",
  "010195",
  "010291",
  "010292",
  "010293",
  "010294",
  "010295",
  "010391",
  "010392",
  "010393",
  "010394",
  "010395",
  "010491",
  "010492",
  "010493",
  "010494",
  "010495",
  "010591",
  "010592",
  "010593",
  "010594",
  "010595",
  "010691",
  "010692",
  "010693",
  "010694",
  "010695",
  "010791",
  "010792",
  "010793",
  "010794",
  "010795",
  "010891",
  "010892",
  "010893",
  "010894",
  "010895",
  "010991",
  "010992",
  "010993",
  "010994",
  "010995",
  "011091",
  "011092",
  "011093",
  "011094",
  "011095"
]
#关卡汇总 试炼 试炼奖励
TRIAL = {
  "020101": {
    "colddown": 0,
    "feat": 0,
    "gold": 13950,
    "hp": 6,
    "hxp": 6,
    "label": "0201",
    "maxentry": 2,
    "playterm": lambda user, label: user['xp'] / 100000 >= 14,
    "opendate": [1, 3, 5, 7], 
    "prods": [
      [
        "01001", 0.25, 5,
      ],
      [
        "01002", 0.25, 5,
      ],
      [
        "01003", 0.25, 5,
      ],
      [
        "01004", 0.12, 2,
      ],
      [
        "01005", 0.13, 2,
      ],    
    ],
    "xp": 6,
    "rand": 1
  },
  "020102": {
    "colddown": 0,
    "feat": 0,
    "gold": 20837,
    "hp": 6,
    "hxp": 6,
    "label": "0201",
    "maxentry": 2,
    "playterm": lambda user, label: user['xp'] / 100000 >= 29,
    "opendate": [1, 3, 5, 7], 
    "prods": [
      [
        "01001", 0.25, 8,
      ],
      [
        "01002", 0.25, 8,
      ],
      [
        "01003", 0.25, 8,
      ],
      [
        "01004", 0.12, 4,
      ],
      [
        "01005", 0.13, 4,
      ],  
    ],
    "xp": 6,
    "rand": 1
  },
  "020103": {
    "colddown": 0,
    "feat": 0,
    "gold": 27940,
    "hp": 6,
    "hxp": 6,
    "label": "0201",
    "maxentry": 2,
    "playterm": lambda user, label: user['xp'] / 100000 >= 42,
    "opendate": [1, 3, 5, 7], 
    "prods": [
      [
        "01001", 0.25, 11,
      ],
      [
        "01002", 0.25, 11,
      ],
      [
        "01003", 0.25, 11,
      ],
      [
        "01004", 0.12, 6,
      ],
      [
        "01005", 0.13, 6,
      ],  
    ],
    "xp": 6,
    "rand": 1
  },
  "020104": {
    "colddown": 0,
    "feat": 0,
    "gold": 34526,
    "hp": 6,
    "hxp": 6,
    "label": "0201",
    "maxentry": 2,
    "playterm": lambda user, label: user['xp'] / 100000 >= 57,
    "opendate": [1, 3, 5, 7], 
    "prods": [
      [
        "01001", 0.25, 14,
      ],
      [
        "01002", 0.25, 14,
      ],
      [
        "01003", 0.25, 14,
      ],
      [
        "01004", 0.12, 8,
      ],
      [
        "01005", 0.13, 8,
      ],  
    ],
    "xp": 6,
    "rand": 1
  },
  "020105": {
    "colddown": 0,
    "feat": 0,
    "gold": 40251,
    "hp": 6,
    "hxp": 6,
    "label": "0201",
    "maxentry": 2,
    "playterm": lambda user, label: user['xp'] / 100000 >= 72,
    "opendate": [1, 3, 5, 7], 
    "prods": [
      [
        "01001", 0.25, 17,
      ],
      [
        "01002", 0.25, 17,
      ],
      [
        "01003", 0.25, 17,
      ],
      [
        "01004", 0.12, 10,
      ],
      [
        "01005", 0.13, 10,
      ],  
    ],
    "xp": 6,
    "rand": 1
  },
  "020201": {
    "colddown": 0,
    "feat": 1000,
    "gold": 5940,
    "hp": 6,
    "hxp": 6,
    "label": "0202",
    "maxentry": 5,
    "playterm": lambda user, label: user['xp'] / 100000 >= 14,
    "opendate": [2, 4, 6, 7], 
    "prods": [
    ],
    "xp": 6
  },
  "020202": {
    "colddown": 0,
    "feat": 2000,
    "gold": 8873,
    "hp": 6,
    "hxp": 6,
    "label": "0202",
    "maxentry": 5,
    "playterm": lambda user, label: user['xp'] / 100000 >= 32,
    "opendate": [2, 4, 6, 7], 
    "prods": [
    ],
    "xp": 6
  },
  "020203": {
    "colddown": 0,
    "feat": 3000,
    "gold": 11897,
    "hp": 6,
    "hxp": 6,
    "label": "0202",
    "maxentry": 5,
    "playterm": lambda user, label: user['xp'] / 100000 >= 49,
    "opendate": [2, 4, 6, 7], 
    "prods": [
    ],
    "xp": 6
  },
  "020204": {
    "colddown": 0,
    "feat": 4000,
    "gold": 14701,
    "hp": 6,
    "hxp": 6,
    "label": "0202",
    "maxentry": 5,
    "playterm": lambda user, label: user['xp'] / 100000 >= 62,
    "opendate": [2, 4, 6, 7], 
    "prods": [
    ],
    "xp": 6
  },
  "020205": {
    "colddown": 0,
    "feat": 5000,
    "gold": 17139,
    "hp": 6,
    "hxp": 6,
    "label": "0202",
    "maxentry": 5,
    "playterm": lambda user, label: user['xp'] / 100000 >= 74,
    "opendate": [2, 4, 6, 7], 
    "prods": [
    ],
    "xp": 6
  },
  "020301": {
    "colddown": 0,
    "feat": 0,
    "gold": 36200,
    "hp": 6,
    "hxp": 6,
    "label": "0203",
    "maxentry": 2,
    "playterm": lambda user, label: user['xp'] / 100000 >= 14,
    "opendate": [5, 6, 7], 
    "prods": [
    ],
    "xp": 6,
    "rand": 5
  },
  "020302": {
    "colddown": 0,
    "feat": 0,
    "gold": 44198,
    "hp": 6,
    "hxp": 6,
    "label": "0203",
    "maxentry": 2,
    "playterm": lambda user, label: user['xp'] / 100000 >= 38,
    "opendate": [5, 6, 7],
    "prods": [
    ],
    "xp": 6,
    "rand": 8
  },
  "020303": {
    "colddown": 0,
    "feat": 0,
    "gold": 52447,
    "hp": 6,
    "hxp": 6,
    "label": "0203",
    "maxentry": 2,
    "playterm": lambda user, label: user['xp'] / 100000 >= 52,
    "opendate": [5, 6, 7],
    "prods": [
    ],
    "xp": 6,
    "rand": 11
  },
  "020304": {
    "colddown": 0,
    "feat": 0,
    "gold": 60095,
    "hp": 6,
    "hxp": 6,
    "label": "0203",
    "maxentry": 2,
    "playterm": lambda user, label: user['xp'] / 100000 >= 69,
    "opendate": [5, 6, 7],
    "prods": [
    ],
    "xp": 6,
    "rand": 14
  },
  "020305": {
    "colddown": 0,
    "feat": 0,
    "gold": 66743,
    "hp": 6,
    "hxp": 6,
    "label": "0203",
    "maxentry": 2,
    "playterm": lambda user, label: user['xp'] / 100000 >= 76,
    "opendate": [5, 6, 7], 
    "prods": [
    ],
    "xp": 6,
    "rand": 17
  }
}
#get_match end==========
#经济经验汇总 每日任务
WORKS = {   # 每日工作表
    '01001': {  # 每日收税
              'tags': {'TAX': 1},
              'awards': {'xp': 0, 'gold': 0, 'feat':0, 'prods': {}},
              'opendate': [] 
             },
    '01002': {  # 战役完成10次
              'tags': {'BATT': 10},
              'awards': {'xp': 150, 'feat': 30, 'prods': {}},
              'opendate': [1, 2, 3, 4, 5, 6, 7] 
             },
    '01003': {  # 精英关卡扫荡2次
              'tags': {'HARDBATT': 3},
              'awards': {'xp': 150, 'feat': 30, 'prods': {}},
              'opendate': [1, 2, 3, 4, 5, 6, 7] 
             },
    '01004': {  # 完成名将试炼，白门楼2次
             'tags': {'INST1': 2},
             'awards': {'xp': 100, 'gold': 1000, 'prods': {}},
             'opendate': [1, 3, 5, 7] 
             },
    '01005': {  # 完成名将试炼，三江口之战5次
             'tags': {'INST2': 3},
             'awards': {'xp': 100, 'gold': 1000, 'prods': {}},
             'opendate': [2, 4, 6, 7] 
             },
    '01006': {  # 英雄技能升级3次
             'tags': {'SKILLUP': 3},
             'awards': {'xp': 60, 'gold': 2000, 'prods': {}},
             'opendate': [1, 2, 3, 4, 5, 6, 7] 
             },
    '01007': {  # 月卡
             'tags': {'CARD': 1},
             'awards': {'xp': 0, 'rock': 100, 'prods': {}},
             'opendate': [1, 2, 3, 4, 5, 6, 7] 
             },
    '01008': {  # 帝国争霸，在巅峰对决中完成3次挑战
             'tags': {'ARENA': 3},
             'awards': {'xp': 100, 'gold': 2000, 'prods': {}},
             'opendate': [1, 2, 3, 4, 5, 6, 7] 
             },
    '01009': {  # 每日可以领取体力,早餐
             'tags': {'BREAKFAST': 1},
             'awards': {'hp': 60, 'rock': 0, 'prods': {}},
             'opendate': [1, 2, 3, 4, 5, 6, 7] 
             },
    '01010': {  # 每日可以领取体力,午餐
             'tags': {'LUNCH': 1},
             'awards': {'hp': 60, 'rock': 0, 'prods': {}},
             'opendate': [1, 2, 3, 4, 5, 6, 7] 
             },
    '01011': {  # 每日可以领取体力,晚餐
             'tags': {'DINNER': 1},
             'awards': {'hp': 120, 'rock': 0, 'prods': {}},
             'opendate': [1, 2, 3, 4, 5, 6, 7] 
             },
    '01012': {  # 铜雀台之战2次
             'tags': {'INST3': 2},
             'awards': {'xp': 100, 'gold': 1000, 'rock': 0, 'prods': {}},
             'opendate': [5, 6, 7] 
             },
    '01013': {  # 点金手 1次
             'tags': {'GOLD': 1},
             'awards': {'xp': 50, 'gold': 1000, 'rock': 0, 'prods': {}},
             'opendate': [1, 2, 3, 4, 5, 6, 7] 
             },
    '01014': {  # 召唤名将购买任意功勋3次
             'tags': {'CALL': 3},
             'awards': {'xp': 100, 'gold': 0, 'rock': 0, 'prods': {'04002': 1}},
             'opendate': [1, 2, 3, 4, 5, 6, 7] 
             },
    '01015': {  # 和美人缠绵一次
             'tags': {'BEAUTY': 1},
             'awards': {'xp': 100, 'gold': 1000, 'rock': 0, 'prods': {}},
             'opendate': [1, 2, 3, 4, 5, 6, 7] 
             },
    '01016': {  # 使用一次膜拜
             'tags': {'WORSHIP': 1},
             'awards': {'xp': 150, 'gold': 1000, 'rock': 0, 'prods': {}},
             'opendate': [1, 2, 3, 4, 5, 6, 7] 
             },     
    '01017': {  # 在藏宝地穴开采一次
             'tags': {'MINE': 1},
             'awards': {'xp': 150, 'gold': 1000, 'rock': 0, 'prods': {}},
             'opendate': [1, 2, 3, 4, 5, 6, 7] 
             },   
    '01018': {  # 在藏宝地穴掠夺一次
             'tags': {'HUNT': 1},
             'awards': {'xp': 150, 'gold': 1000, 'rock': 0, 'prods': {}},
             'opendate': [1, 2, 3, 4, 5, 6, 7] 
             },   
    '01019': {  # 突飞任意武将一次
             'tags': {'FEAT': 1},
             'awards': {'xp': 50, 'gold': 1000, 'rock': 0, 'prods': {}},
             'opendate': [1, 2, 3, 4, 5, 6, 7] 
             },     
    '01020': {  # 在杂货铺购买任意物品1次
             'tags': {'STORE': 1},
             'awards': {'xp': 60, 'gold': 1000, 'rock': 0, 'prods': {}},
             'opendate': [1, 2, 3, 4, 5, 6, 7] 
             },  
    '01021': {  # 任意武将穿上1件装备
             'tags': {'EQUIP': 1},
             'awards': {'xp': 40, 'gold': 1000, 'rock': 0, 'prods': {}},
             'opendate': [1, 2, 3, 4, 5, 6, 7] 
             },                      
}

#玩家昵称前缀
PREFIX = [
  "猎人.",
  "龙吟.",
  "海豹.",
  "神枪.",
  "孤狼.",
  "霸王.",
  "月语.",
  "霸王.",
  "大帝.",
  "无尘.",
  "猛熊.",
  "巨人.",
  "幽冥.",
  "侠客.",
  "一枪.",
  "阿尔法.",
  "格鲁乌.",
  "信号旗.",
  "黑猫.",
  "梅特.",
  "雄鹰.",
  "三角洲.",
  "贝雷帽.",
  "棕水.",
  "游骑兵.",
  "摩萨德.",
  "灰衣人",
  "宪兵.",
  "猎手.",
  "尖刀.",
  "猛虎.",
  "铁军.",
  "红魔.",
  "救星.",
  "蛟龙.",
  "扁舟.",
  "海狗.",
  "蛙人.",
  "食人鲨.",
  "顺风耳.",
  "多面手.",
  "眼镜蛇.",
  "雷霆.",
  "盾牌.",
  "神话.",
  "英雄.",
  "传奇.",
  "海豚.",
  "飞龙.",
  "战刀.",
  "战神.",
  "狼人.",
  "猎豹.",
  "钢枪.",
  "嗜魂.",
  "铁汉.",
  "恶狼."
]
POSTFIX = [
  "上将",
  "中将",
  "司令",
  "少将",
  "大校",
  "师长",
  "团长",
  "连长",
  "排长",
  "列兵",
  "军长",
  "上校",
  "中校",
  "少校",
  "上尉",
  "中尉",
  "少尉",
  "营长",
  "元帅",
  "军师"
]
ACCOUNTPRE = [
    "luck",
    "peace"
]
AWARDHP = [
  0, 0, 
  1, 40, 
  2, 40, 
  3, 40, 
  4, 40, 
  5, 40, 
  6, 40, 
  7, 40, 
  8, 40, 
  9, 40, 
  10, 40, 
  11, 40, 
  12, 40, 
  13, 40, 
  14, 40, 
  15, 40, 
  16, 40, 
  17, 40, 
  18, 40, 
  19, 40, 
  20, 40, 
  21, 40, 
  22, 40, 
  23, 40, 
  24, 40, 
  25, 40, 
  26, 40, 
  27, 40, 
  28, 40, 
  29, 40, 
  30, 50, 
  31, 50, 
  32, 50, 
  33, 50, 
  34, 50, 
  35, 50, 
  36, 50, 
  37, 50, 
  38, 50, 
  39, 50, 
  40, 70, 
  41, 70, 
  42, 70, 
  43, 70, 
  44, 70, 
  45, 70, 
  46, 70, 
  47, 70, 
  48, 70, 
  49, 70, 
  50, 90, 
  51, 90, 
  52, 90, 
  53, 90, 
  54, 90, 
  55, 90, 
  56, 90, 
  57, 90, 
  58, 90, 
  59, 90, 
  60, 100, 
  61, 100, 
  62, 100, 
  63, 100, 
  64, 100, 
  65, 100, 
  66, 100, 
  67, 100, 
  68, 100, 
  69, 100, 
  70, 110, 
  71, 110, 
  72, 110, 
  73, 110, 
  74, 110, 
  75, 110, 
  76, 110, 
  77, 110, 
  78, 110, 
  79, 110, 
  80, 120, 
  81, 120, 
  82, 120, 
  83, 120, 
  84, 120, 
  85, 120, 
  86, 120, 
  87, 120, 
  88, 120, 
  89, 120, 
]
LOTT = {
    1 :
        {'1': {'gold': 10000}, '10': {'gold': 90000}, 'total_times': 5},
    2 :
        {'1': {'rock': 288}, '10': {'rock': 2590}, 'total_times': 1}
}
#get_lott start==========
#功勋商店 抽奖 概率设定

#功勋商店 抽奖 奖品

#get_lott end==========
#巅峰对决 商店 竞技场
ARENA_OPEN_LIMIT = 9
ARENA_MAIL_LIMIT = (100000, 9)
#巅峰对决 商店出售物品 帝国对决 竞技场 新战舰
ARENAPROD = {
  "03008": {
    "arena_coin": 500,
    "name": "",
    "num": 5
  },
  "03017": {
    "arena_coin": 500,
    "name": "",
    "num": 5
  },
  "03023": {
    "arena_coin": 500,
    "name": "",
    "num": 5
  },
  "03024": {
    "arena_coin": 500,
    "name": "",
    "num": 5
  },
  "03025": {
    "arena_coin": 500,
    "name": "",
    "num": 2
  },
  "03022": {
    "arena_coin": 500,
    "name": "",
    "num": 5
  },
  "03027": {
    "arena_coin": 500,
    "name": "",
    "num": 2
  },
  "04002": {
    "arena_coin": 400,
    "name": "",
    "num": 5
  }
}
ARENAREFRESH = [
  1, 10, 
  2, 20, 
  3, 20, 
  4, 40, 
  5, 40, 
  6, 100, 
  7, 100, 
  8, 200, 
  9, 200, 
  10, 300, 
  11, 300, 
  12, 300, 
  13, 300, 
  14, 300, 
  15, 300, 
  16, 300, 
  17, 600, 
  18, 600,
  19, 600, 
  20, 600, 
]
ARENARESET = [
  1, 50, 
  2, 100, 
  3, 150, 
  4, 200, 
  5, 250, 
  6, 300, 
  7, 350, 
  8, 400, 
  9, 450, 
  10, 500, 
]
ARENARULE = [
  1, 1, 0, 0, 0, 0, 0, 0, 
  2, 2, 1, 1, 0, 0, 0, 0, 
  3, 3, 2, 2, 0, 0, 0, 0, 
  4, 4, 2, 2, 3, 3, 0, 0, 
  5, 5, 2, 2, 3, 3, 4, 4, 
  6, 6, 2, 3, 4, 4, 5, 5, 
  7, 7, 2, 3, 4, 5, 6, 6, 
  8, 8, 2, 3, 4, 5, 6, 7, 
  9, 9, 3, 4, 5, 6, 7, 8, 
  10, 10, 4, 5, 6, 7, 8, 9, 
  11, 20, 6, 7, 8, 9, 10, 19, 
  21, 30, 10, 14, 15, 19, 20, 29, 
  31, 40, 15, 22, 23, 29, 30, 39, 
  41, 50, 20, 28, 29, 39, 40, 49, 
  51, 70, 30, 39, 40, 49, 50, 69, 
  71, 100, 50, 59, 60, 69, 70, 99, 
  101, 200, 60, 79, 80, 99, 100, 199, 
  201, 300, 100, 129, 130, 199, 200, 299, 
  301, 400, 150, 209, 210, 299, 300, 399, 
  401, 500, 250, 299, 300, 349, 350, 499, 
  501, 700, 350, 399, 400, 449, 450, 699, 
  701, 1000, 550, 599, 600, 649, 650, 999, 
  1001, 1500, 800, 899, 900, 999, 1000, 1499, 
  1501, 2000, 1300, 1399, 1400, 1499, 1500, 1999, 
  2001, 2500, 1800, 1899, 1900, 1999, 2000, 2499, 
  2501, 3000, 1900, 1999, 2000, 2499, 2500, 2999, 
  3001, 3500, 2000, 2499, 2500, 2999, 3000, 3499, 
  3501, 4000, 2500, 2999, 3000, 3499, 3500, 3999, 
  4001, 4500, 3000, 3499, 3500, 3999, 4000, 4499, 
  4501, 5000, 3500, 3999, 4000, 4499, 4500, 4999, 
  5001, 5500, 4000, 4499, 4500, 4999, 5000, 5499, 
  5501, 6000, 4500, 4999, 5000, 5499, 5500, 5999, 
  6001, 6500, 5000, 5499, 5500, 5999, 6000, 6499, 
  6501, 7000, 5500, 5999, 6000, 6499, 6500, 6999, 
  7001, 7500, 6000, 6499, 6500, 6999, 7000, 7499, 
  7501, 8000, 6500, 6999, 7000, 7499, 7500, 7999, 
  8001, 8500, 7000, 7499, 7500, 7999, 8000, 8499, 
  8501, 9000, 7500, 7999, 8000, 8499, 8500, 8999, 
  9001, 9500, 8000, 8499, 8500, 8999, 9000, 9499, 
  9501, 10000, 8500, 8999, 9000, 9499, 9500, 9999, 
  10001, 100000, 8000, 8499, 8500, 8999, 9600, 99999, 
]
ARENAHISTORY = [
  1, 2, 550, 1.0, 
  2, 3, 450, 1.0, 
  3, 4, 400, 1.0, 
  4, 5, 300, 1.0, 
  5, 6, 250, 1.0, 
  6, 7, 200, 1.0, 
  7, 8, 160, 1.0, 
  8, 9, 140, 1.0, 
  9, 10, 120, 1.0, 
  10, 11, 100, 1.0, 
  11, 20, 1, 20.0, 
  20, 30, 1, 18.0, 
  30, 40, 1, 16.0, 
  40, 50, 1, 14.0, 
  50, 70, 1, 12.0, 
  70, 100, 1, 10.0, 
  100, 200, 1, 6.0, 
  200, 300, 1, 5.5, 
  300, 400, 1, 4.5, 
  400, 500, 1, 3.5, 
  500, 700, 1, 1.5, 
  700, 1000, 1, 1.0, 
  1000, 2000, 1, 0.8, 
  2000, 3000, 0, 0.0, 
  3000, 4000, 0, 0.0, 
  4000, 5000, 0, 0.0, 
  5000, 7000, 0, 0.0, 
  7000, 10000, 0, 0.0, 
  10000, 100000, 0, 0.0, 
]
ARENADAY = [
  1, 1, 550, 100000, 800, 18000, 
  2, 2, 500, 95000, 775, 15000, 
  3, 3, 450, 90000, 750, 13500, 
  4, 4, 400, 85000, 725, 12000, 
  5, 5, 350, 80000, 700, 10500, 
  6, 6, 340, 75000, 680, 9000, 
  7, 7, 330, 70000, 660, 7500, 
  8, 8, 320, 65000, 640, 6000, 
  9, 9, 310, 60000, 620, 4500, 
  10, 10, 300, 55000, 600, 3000, 
  11, 20, 250, 50000, 590, 2400, 
  21, 30, 200, 45000, 575, 2100, 
  31, 40, 150, 40000, 560, 1800, 
  41, 50, 130, 35000, 545, 1500, 
  51, 70, 110, 30000, 530, 1200, 
  71, 100, 100, 27500, 515, 900, 
  101, 200, 90, 25000, 500, 600, 
  201, 300, 80, 22500, 450, 480, 
  301, 400, 70, 20000, 425, 420, 
  401, 500, 60, 18000, 400, 360, 
  501, 700, 55, 16000, 350, 300, 
  701, 1000, 55, 14000, 300, 240, 
  1001, 2000, 55, 12000, 260, 180, 
  2001, 3000, 50, 10000, 220, 180, 
  3001, 4000, 50, 9000, 180, 120, 
  4001, 5000, 50, 8000, 140, 120, 
  5001, 7000, 45, 7000, 100, 60, 
  7001, 10000, 45, 5000, 50, 60, 
  10001, 100000, 45, 2500, 0, 0, 
]
WORSHIPTYPE = [
 1, 0, 0, 15, 
 2, 30000, 0, 30, 
 3, 0, 150, 100, 
]
WORSHIPAWRAD = [
 1, 1, 1000, 
 1, 2, 1000, 
 1, 3, 1000, 
 1, 4, 1000, 
 1, 5, 1000, 
 1, 6, 1000, 
 1, 7, 1000, 
 1, 8, 1000, 
 1, 9, 1000, 
 1, 10, 1000, 
 1, 11, 1000, 
 1, 12, 1000, 
 1, 13, 1000, 
 1, 14, 1000, 
 1, 15, 1000, 
 1, 16, 1000, 
 1, 17, 1000, 
 1, 18, 1000, 
 1, 19, 1000, 
 1, 20, 1000, 
 1, 21, 100, 
 1, 22, 100, 
 1, 23, 100, 
 1, 24, 100, 
 1, 25, 100, 
 1, 26, 100, 
 1, 27, 100, 
 1, 28, 100, 
 1, 29, 100, 
 1, 30, 100, 
 2, 1, 2000, 
 2, 2, 2000, 
 2, 3, 2000, 
 2, 4, 2000, 
 2, 5, 2000, 
 2, 6, 2000, 
 2, 7, 2000, 
 2, 8, 2000, 
 2, 9, 2000, 
 2, 10, 2000, 
 2, 11, 2000, 
 2, 12, 2000, 
 2, 13, 2000, 
 2, 14, 2000, 
 2, 15, 2000, 
 2, 16, 2000, 
 2, 17, 2000, 
 2, 18, 2000, 
 2, 19, 2000, 
 2, 20, 2000, 
 2, 21, 200, 
 2, 22, 200, 
 2, 23, 200, 
 2, 24, 200, 
 2, 25, 200, 
 2, 26, 200, 
 2, 27, 200, 
 2, 28, 200, 
 2, 29, 200, 
 2, 30, 200, 
 3, 1, 5000, 
 3, 2, 5000, 
 3, 3, 5000, 
 3, 4, 5000, 
 3, 5, 5000, 
 3, 6, 5000, 
 3, 7, 5000, 
 3, 8, 5000, 
 3, 9, 5000, 
 3, 10, 5000, 
 3, 11, 5000, 
 3, 12, 5000, 
 3, 13, 5000, 
 3, 14, 5000, 
 3, 15, 5000, 
 3, 16, 5000, 
 3, 17, 5000, 
 3, 18, 5000, 
 3, 19, 5000, 
 3, 20, 5000, 
 3, 21, 500, 
 3, 22, 500, 
 3, 23, 500, 
 3, 24, 500, 
 3, 25, 500, 
 3, 26, 500, 
 3, 27, 500, 
 3, 28, 500, 
 3, 29, 500, 
 3, 30, 500, 
]
#hunt start==========
HUNTBASE = [
  0, 5, 
  1, 5, 
  2, 5, 
  3, 5, 
  4, 5, 
  5, 5, 
  6, 5, 
  7, 5, 
  8, 5, 
  9, 5, 
  10, 5, 
  11, 5, 
  12, 5, 
  13, 5, 
  14, 5, 
  15, 5, 
  16, 5, 
  17, 5, 
  18, 5, 
  19, 5, 
  20, 5, 
  21, 5, 
  22, 5, 
  23, 5, 
  24, 5, 
  25, 5, 
  26, 5, 
  27, 5, 
  28, 5, 
  29, 5, 
  30, 5, 
  31, 5, 
  32, 5, 
  33, 5, 
  34, 5, 
  35, 5, 
  36, 5, 
  37, 5, 
  38, 5, 
  39, 5, 
  40, 96, 
  41, 96, 
  42, 97, 
  43, 103, 
  44, 104, 
  45, 104, 
  46, 106, 
  47, 106, 
  48, 107, 
  49, 107, 
  50, 113, 
  51, 113, 
  52, 113, 
  53, 120, 
  54, 121, 
  55, 121, 
  56, 123, 
  57, 123, 
  58, 129, 
  59, 130, 
  60, 130, 
  61, 132, 
  62, 132, 
  63, 138, 
  64, 139, 
  65, 139, 
  66, 141, 
  67, 142, 
  68, 142, 
  69, 143, 
  70, 149, 
  71, 149, 
  72, 150, 
  73, 157, 
  74, 158, 
  75, 165, 
  76, 166, 
  77, 173, 
  78, 174, 
  79, 174, 
  80, 175, 
  81, 175, 
  82, 175, 
  83, 175, 
  84, 175, 
  85, 175, 
  86, 175, 
  87, 175, 
  88, 175, 
  89, 175, 
  90, 175, 
  91, 175, 
  92, 175, 
  93, 175, 
  94, 175, 
  95, 175, 
  96, 175, 
  97, 175, 
  98, 175, 
  99, 175, 
  100, 175, 
]
HUNTRATIO = [
  0, 10, 
  1, 10, 
  2, 10, 
  3, 10, 
  4, 10, 
  5, 10, 
  6, 10, 
  7, 10, 
  8, 10, 
  9, 10, 
  10, 10, 
  11, 10, 
  12, 10, 
  13, 10, 
  14, 10, 
  15, 10, 
  16, 10, 
  17, 10, 
  18, 10, 
  19, 10, 
  20, 10, 
  21, 10, 
  22, 10, 
  23, 10, 
  24, 10, 
  25, 10, 
  26, 10, 
  27, 10, 
  28, 10, 
  29, 10, 
  30, 10, 
  31, 10, 
  32, 10, 
  33, 10, 
  34, 10, 
  35, 10, 
  36, 10, 
  37, 10, 
  38, 10, 
  39, 10, 
  40, 14, 
  41, 14, 
  42, 15, 
  43, 15, 
  44, 16, 
  45, 16, 
  46, 16, 
  47, 16, 
  48, 16, 
  49, 16, 
  50, 17, 
  51, 17, 
  52, 17, 
  53, 18, 
  54, 18, 
  55, 18, 
  56, 18, 
  57, 19, 
  58, 19, 
  59, 19, 
  60, 20, 
  61, 20, 
  62, 20, 
  63, 21, 
  64, 21, 
  65, 21, 
  66, 21, 
  67, 21, 
  68, 21, 
  69, 21, 
  70, 22, 
  71, 22, 
  72, 22, 
  73, 24, 
  74, 24, 
  75, 25, 
  76, 25, 
  77, 26, 
  78, 26, 
  79, 26, 
  80, 26, 
  81, 26, 
  82, 26, 
  83, 26, 
  84, 26, 
  85, 26, 
  86, 26, 
  87, 26, 
  88, 26, 
  89, 26, 
  90, 26, 
  91, 26, 
  92, 26, 
  93, 26, 
  94, 26, 
  95, 26, 
  96, 26, 
  97, 26, 
  98, 26, 
  99, 26, 
  100, 26, 
]
HUNTTIMES = [
  0, 1, 1, 
  2, 3, 2, 
  4, 5, 3, 
  6, 7, 4, 
  8, 9, 5, 
  10, 11, 6, 
  12, 13, 7, 
  14, 15, 8, 
  16, 17, 9, 
  18, 19, 10, 
  20, 21, 1, 
  22, 23, 2, 
  24, 25, 3, 
  26, 27, 4, 
  28, 29, 5, 
  30, 31, 6, 
  32, 33, 7, 
  34, 35, 8, 
  36, 37, 9, 
  38, 39, 10, 
  40, 41, 1, 
  42, 43, 2, 
  44, 45, 3, 
  46, 47, 4, 
  48, 49, 5, 
  50, 51, 6, 
  52, 53, 7, 
  54, 55, 8, 
  56, 57, 9, 
  58, 59, 10, 
  60, 61, 1, 
  62, 63, 2, 
  64, 65, 3, 
  66, 67, 4, 
  68, 69, 5, 
  70, 71, 6, 
  72, 73, 7, 
  74, 75, 8, 
  76, 77, 9, 
  78, 100000, 10, 
]
HUNTRAPE = [
  0, 6000, 972, 38, 1, 
  6001, 6100, 988, 38, 1, 
  6101, 6200, 1004, 38, 1, 
  6201, 6300, 1020, 38, 1, 
  6301, 6400, 1036, 38, 1, 
  6401, 6500, 1052, 40, 1, 
  6501, 6600, 1068, 40, 1, 
  6601, 6700, 1084, 40, 1, 
  6701, 6800, 1100, 40, 1, 
  6801, 6900, 1116, 40, 1, 
  6901, 7000, 1132, 40, 1, 
  7001, 7100, 1148, 40, 1, 
  7101, 7200, 1164, 40, 1, 
  7201, 7300, 1180, 42, 1, 
  7301, 7400, 1196, 42, 1, 
  7401, 7500, 1212, 42, 1, 
  7501, 7600, 1228, 42, 1, 
  7601, 7700, 1244, 42, 1, 
  7701, 7800, 1260, 42, 1, 
  7801, 7900, 1276, 42, 1, 
  7901, 8000, 1292, 44, 1, 
  8001, 8100, 1308, 44, 1, 
  8101, 8200, 1324, 44, 1, 
  8201, 8300, 1340, 44, 1, 
  8301, 8400, 1356, 44, 1, 
  8401, 8500, 1372, 44, 1, 
  8501, 8600, 1388, 44, 1, 
  8601, 8700, 1404, 46, 1, 
  8701, 8800, 1420, 46, 1, 
  8801, 8900, 1436, 46, 1, 
  8901, 9000, 1452, 46, 1, 
  9001, 9100, 1468, 46, 1, 
  9101, 9200, 1484, 46, 1, 
  9201, 9300, 1500, 46, 1, 
  9301, 9400, 1516, 48, 1, 
  9401, 9500, 1532, 48, 1, 
  9501, 9600, 1548, 48, 1, 
  9601, 9700, 1564, 48, 1, 
  9701, 9800, 1580, 48, 1, 
  9801, 9900, 1596, 48, 1, 
  9901, 10000, 1612, 48, 1, 
  10001, 10100, 1628, 50, 1, 
  10101, 10200, 1644, 50, 1, 
  10201, 10300, 1660, 50, 1, 
  10301, 10400, 1676, 50, 1, 
  10401, 10500, 1692, 50, 1, 
  10501, 10600, 1708, 50, 1, 
  10601, 10700, 1724, 50, 1, 
  10701, 10800, 1740, 52, 1, 
  10801, 10900, 1756, 52, 1, 
  10901, 11000, 1772, 52, 1, 
  11001, 11100, 1788, 52, 1, 
  11101, 11200, 1804, 52, 1, 
  11201, 11300, 1820, 52, 1, 
  11301, 11400, 1836, 52, 1, 
  11401, 11500, 1852, 54, 1, 
  11501, 11600, 1868, 54, 1, 
  11601, 11700, 1884, 54, 1, 
  11701, 11800, 1900, 54, 1, 
  11801, 11900, 1916, 54, 1, 
  11901, 12000, 1932, 54, 1, 
  12001, 12100, 1948, 54, 1, 
  12101, 12200, 1964, 54, 1, 
  12201, 12300, 1980, 56, 1, 
  12301, 12400, 1996, 56, 1, 
  12401, 12500, 2012, 56, 1, 
  12501, 12600, 2028, 56, 1, 
  12601, 12700, 2044, 56, 1, 
  12701, 12800, 2060, 56, 1, 
  12801, 12900, 2076, 56, 1, 
  12901, 13000, 2092, 58, 1, 
  13001, 13100, 2108, 58, 1, 
  13101, 13200, 2124, 58, 1, 
  13201, 13300, 2140, 58, 1, 
  13301, 13400, 2156, 58, 1, 
  13401, 13500, 2172, 58, 1, 
  13501, 13600, 2188, 58, 1, 
  13601, 13700, 2204, 60, 1, 
  13701, 13800, 2220, 60, 1, 
  13801, 13900, 2236, 60, 1, 
  13901, 14000, 2252, 60, 1, 
  14001, 14100, 2268, 60, 1, 
  14101, 14200, 2284, 60, 1, 
  14201, 14300, 2300, 60, 1, 
  14301, 14400, 2316, 62, 1, 
  14401, 14500, 2332, 62, 1, 
  14501, 14600, 2348, 62, 1, 
  14601, 14700, 2364, 62, 1, 
  14701, 14800, 2380, 62, 1, 
  14801, 14900, 2396, 62, 1, 
  14901, 15000, 2412, 62, 1, 
  15001, 15100, 2428, 64, 1, 
  15101, 15200, 2444, 64, 1, 
  15201, 15300, 2460, 64, 1, 
  15301, 15400, 2476, 64, 1, 
  15401, 15500, 2492, 64, 1, 
  15501, 15600, 2508, 64, 1, 
  15601, 15700, 2524, 64, 1, 
  15701, 15800, 2540, 66, 1, 
  15801, 15900, 2556, 66, 1, 
  15901, 16000, 2572, 66, 1, 
  16001, 16100, 2588, 66, 1, 
  16101, 16200, 2604, 66, 1, 
  16201, 16300, 2620, 66, 1, 
  16301, 16400, 2636, 66, 1, 
  16401, 16500, 2652, 68, 1, 
  16501, 16600, 2668, 68, 1, 
  16601, 16700, 2684, 68, 1, 
  16701, 16800, 2700, 68, 1, 
  16801, 16900, 2716, 68, 1, 
  16901, 17000, 2732, 68, 1, 
  17001, 17100, 2748, 68, 1, 
  17101, 17200, 2764, 68, 1, 
  17201, 17300, 2780, 70, 1, 
  17301, 17400, 2796, 70, 1, 
  17401, 17500, 2812, 70, 1, 
  17501, 17600, 2828, 70, 1, 
  17601, 17700, 2844, 70, 1, 
  17701, 17800, 2860, 70, 1, 
  17801, 17900, 2876, 70, 1, 
  17901, 18000, 2892, 72, 1, 
  18001, 18100, 2908, 72, 1, 
  18101, 18200, 2924, 72, 1, 
  18201, 18300, 2940, 72, 1, 
  18301, 18400, 2956, 72, 1, 
  18401, 18500, 2972, 72, 1, 
  18501, 18600, 2988, 72, 1, 
  18601, 18700, 3004, 74, 1, 
  18701, 18800, 3020, 74, 1, 
  18801, 18900, 3036, 74, 1, 
  18901, 19000, 3052, 74, 1, 
  19001, 19100, 3068, 74, 1, 
  19101, 19200, 3084, 74, 1, 
  19201, 19300, 3100, 74, 1, 
  19301, 19400, 3116, 76, 1, 
  19401, 19500, 3132, 76, 1, 
  19501, 19600, 3148, 76, 1, 
  19601, 19700, 3164, 76, 1, 
  19701, 19800, 3180, 76, 1, 
  19801, 19900, 3196, 76, 1, 
  19901, 20000, 3212, 76, 1, 
  20001, 20100, 3228, 78, 1, 
  20101, 20200, 3244, 78, 1, 
  20201, 20300, 3260, 78, 1, 
  20301, 20400, 3276, 78, 1, 
  20401, 20500, 3292, 78, 1, 
  20501, 20600, 3308, 78, 1, 
  20601, 20700, 3324, 78, 1, 
  20701, 20800, 3340, 80, 1, 
  20801, 20900, 3356, 80, 1, 
  20901, 21000, 3372, 80, 1, 
  21001, 21100, 3388, 80, 1, 
  21101, 21200, 3404, 80, 1, 
  21201, 21300, 3420, 80, 1, 
  21301, 21400, 3436, 80, 1, 
  21401, 21500, 3452, 82, 1, 
  21501, 21600, 3468, 82, 1, 
  21601, 21700, 3484, 82, 1, 
  21701, 21800, 3500, 82, 1, 
  21801, 21900, 3516, 82, 1, 
  21901, 22000, 3532, 82, 1, 
  22001, 22100, 3548, 82, 1, 
  22101, 22200, 3564, 82, 1, 
  22201, 22300, 3580, 84, 1, 
  22301, 22400, 3596, 84, 1, 
  22401, 22500, 3612, 84, 1, 
  22501, 22600, 3628, 84, 1, 
  22601, 22700, 3644, 84, 1, 
  22701, 22800, 3660, 84, 1, 
  22801, 22900, 3676, 84, 1, 
  22901, 23000, 3692, 86, 1, 
  23001, 23100, 3708, 86, 1, 
  23101, 23200, 3724, 86, 1, 
  23201, 23300, 3740, 86, 1, 
  23301, 23400, 3756, 86, 1, 
  23401, 23500, 3772, 86, 1, 
  23501, 23600, 3788, 86, 1, 
  23601, 23700, 3804, 88, 1, 
  23701, 23800, 3820, 88, 1, 
  23801, 23900, 3836, 88, 1, 
  23901, 24000, 3852, 88, 1, 
  24001, 24100, 3868, 88, 1, 
  24101, 24200, 3884, 88, 1, 
  24201, 24300, 3900, 88, 1, 
  24301, 24400, 3916, 90, 1, 
  24401, 24500, 3932, 90, 1, 
  24501, 24600, 3948, 90, 1, 
  24601, 24700, 3964, 90, 1, 
  24701, 24800, 3980, 90, 1, 
  24801, 24900, 3996, 90, 1, 
  24901, 25000, 4012, 90, 1, 
  25001, 25100, 4028, 92, 1, 
  25101, 25200, 4044, 92, 1, 
  25201, 25300, 4060, 92, 1, 
  25301, 25400, 4076, 92, 1, 
  25401, 25500, 4092, 92, 1, 
  25501, 25600, 4108, 92, 1, 
  25601, 25700, 4124, 92, 1, 
  25701, 25800, 4140, 94, 1, 
  25801, 25900, 4156, 94, 1, 
  25901, 26000, 4172, 94, 1, 
  26001, 26100, 4188, 94, 1, 
  26101, 26200, 4204, 94, 1, 
  26201, 26300, 4220, 94, 1, 
  26301, 26400, 4236, 94, 1, 
  26401, 26500, 4252, 96, 1, 
  26501, 26600, 4268, 96, 1, 
  26601, 26700, 4284, 96, 1, 
  26701, 26800, 4300, 96, 1, 
  26801, 26900, 4316, 96, 1, 
  26901, 27000, 4332, 96, 1, 
  27001, 27100, 4348, 96, 1, 
  27101, 27200, 4364, 96, 1, 
  27201, 27300, 4380, 98, 1, 
  27301, 27400, 4396, 98, 1, 
  27401, 27500, 4412, 98, 1, 
  27501, 27600, 4428, 98, 1, 
  27601, 27700, 4444, 98, 1, 
  27701, 27800, 4460, 98, 1, 
  27801, 27900, 4476, 98, 1, 
  27901, 28000, 4492, 100, 1, 
  28001, 28100, 4508, 100, 1, 
  28101, 28200, 4524, 100, 1, 
  28201, 28300, 4540, 100, 1, 
  28301, 28400, 4556, 100, 1, 
  28401, 28500, 4572, 100, 1, 
  28501, 28600, 4588, 100, 1, 
  28601, 28700, 4604, 102, 1, 
  28701, 28800, 4620, 102, 1, 
  28801, 28900, 4636, 102, 1, 
  28901, 29000, 4652, 102, 1, 
  29001, 29100, 4668, 102, 1, 
  29101, 29200, 4684, 102, 1, 
  29201, 29300, 4700, 102, 1, 
  29301, 29400, 4716, 104, 1, 
  29401, 29500, 4732, 104, 1, 
  29501, 29600, 4748, 104, 1, 
  29601, 29700, 4764, 104, 1, 
  29701, 29800, 4780, 104, 1, 
  29801, 29900, 4796, 104, 1, 
  29901, 30000, 4812, 104, 1, 
  30001, 30100, 4828, 106, 1, 
  30101, 30200, 4844, 106, 1, 
  30201, 30300, 4860, 106, 1, 
  30301, 30400, 4876, 106, 1, 
  30401, 30500, 4892, 106, 1, 
  30501, 30600, 4908, 106, 1, 
  30601, 30700, 4924, 106, 1, 
  30701, 30800, 4940, 108, 1, 
  30801, 30900, 4956, 108, 1, 
  30901, 31000, 4972, 108, 1, 
  31001, 31100, 4988, 108, 1, 
  31101, 31200, 5004, 108, 1, 
  31201, 31300, 5020, 108, 1, 
  31301, 31400, 5036, 108, 1, 
  31401, 31500, 5052, 110, 1, 
  31501, 31600, 5068, 110, 1, 
  31601, 31700, 5084, 110, 1, 
  31701, 31800, 5100, 110, 1, 
  31801, 31900, 5116, 110, 1, 
  31901, 32000, 5132, 110, 1, 
  32001, 32100, 5148, 110, 1, 
  32101, 32200, 5164, 110, 1, 
  32201, 32300, 5180, 112, 1, 
  32301, 32400, 5196, 112, 1, 
  32401, 32500, 5212, 112, 1, 
  32501, 32600, 5228, 112, 1, 
  32601, 32700, 5244, 112, 1, 
  32701, 32800, 5260, 112, 1, 
  32801, 32900, 5276, 112, 1, 
  32901, 33000, 5292, 114, 1, 
  33001, 33100, 5308, 114, 1, 
  33101, 33200, 5324, 114, 1, 
  33201, 33300, 5340, 114, 1, 
  33301, 33400, 5356, 114, 1, 
  33401, 33500, 5372, 114, 1, 
  33501, 33600, 5388, 114, 1, 
  33601, 33700, 5404, 116, 1, 
  33701, 33800, 5420, 116, 1, 
  33801, 33900, 5436, 116, 1, 
  33901, 34000, 5452, 116, 1, 
  34001, 34100, 5468, 116, 1, 
  34101, 34200, 5484, 116, 1, 
  34201, 34300, 5500, 116, 1, 
  34301, 34400, 5516, 118, 1, 
  34401, 34500, 5532, 118, 1, 
  34501, 34600, 5548, 118, 1, 
  34601, 34700, 5564, 118, 1, 
  34701, 34800, 5580, 118, 1, 
  34801, 34900, 5596, 118, 1, 
  34901, 35000, 5612, 118, 1, 
  35001, 35100, 5628, 120, 2, 
  35101, 35200, 5644, 120, 2, 
  35201, 35300, 5660, 120, 2, 
  35301, 35400, 5676, 120, 2, 
  35401, 35500, 5692, 120, 2, 
  35501, 35600, 5708, 120, 2, 
  35601, 35700, 5724, 120, 2, 
  35701, 35800, 5740, 122, 2, 
  35801, 35900, 5756, 122, 2, 
  35901, 36000, 5772, 122, 2, 
  36001, 36100, 5788, 122, 2, 
  36101, 36200, 5804, 122, 2, 
  36201, 36300, 5820, 122, 2, 
  36301, 36400, 5836, 122, 2, 
  36401, 36500, 5852, 124, 2, 
  36501, 36600, 5868, 124, 2, 
  36601, 36700, 5884, 124, 2, 
  36701, 36800, 5900, 124, 2, 
  36801, 36900, 5916, 124, 2, 
  36901, 37000, 5932, 124, 2, 
  37001, 37100, 5948, 124, 2, 
  37101, 37200, 5964, 124, 2, 
  37201, 37300, 5980, 126, 2, 
  37301, 37400, 5996, 126, 2, 
  37401, 37500, 6012, 126, 2, 
  37501, 37600, 6028, 126, 2, 
  37601, 37700, 6044, 126, 2, 
  37701, 37800, 6060, 126, 2, 
  37801, 37900, 6076, 126, 2, 
  37901, 38000, 6092, 128, 2, 
  38001, 38100, 6108, 128, 2, 
  38101, 38200, 6124, 128, 2, 
  38201, 38300, 6140, 128, 2, 
  38301, 38400, 6156, 128, 2, 
  38401, 38500, 6172, 128, 2, 
  38501, 38600, 6188, 128, 2, 
  38601, 38700, 6204, 130, 2, 
  38701, 38800, 6220, 130, 2, 
  38801, 38900, 6236, 130, 2, 
  38901, 39000, 6252, 130, 2, 
  39001, 39100, 6268, 130, 2, 
  39101, 39200, 6284, 130, 2, 
  39201, 39300, 6300, 130, 2, 
  39301, 39400, 6316, 132, 2, 
  39401, 39500, 6332, 132, 2, 
  39501, 39600, 6348, 132, 2, 
  39601, 39700, 6364, 132, 2, 
  39701, 39800, 6380, 132, 2, 
  39801, 39900, 6396, 132, 2, 
  39901, 40000, 6412, 132, 2, 
  40001, 40100, 6428, 134, 2, 
  40101, 40200, 6444, 134, 2, 
  40201, 40300, 6460, 134, 2, 
  40301, 40400, 6476, 134, 2, 
  40401, 40500, 6492, 134, 2, 
  40501, 40600, 6508, 134, 2, 
  40601, 40700, 6524, 134, 2, 
  40701, 40800, 6540, 136, 2, 
  40801, 40900, 6556, 136, 2, 
  40901, 41000, 6572, 136, 2, 
  41001, 41100, 6588, 136, 2, 
  41101, 41200, 6604, 136, 2, 
  41201, 41300, 6620, 136, 2, 
  41301, 41400, 6636, 136, 2, 
  41401, 41500, 6652, 138, 2, 
  41501, 41600, 6668, 138, 2, 
  41601, 41700, 6684, 138, 2, 
  41701, 41800, 6700, 138, 2, 
  41801, 41900, 6716, 138, 2, 
  41901, 42000, 6732, 138, 2, 
  42001, 42100, 6748, 138, 2, 
  42101, 42200, 6764, 138, 2, 
  42201, 42300, 6780, 140, 2, 
  42301, 42400, 6796, 140, 2, 
  42401, 42500, 6812, 140, 2, 
  42501, 42600, 6828, 140, 2, 
  42601, 42700, 6844, 140, 2, 
  42701, 42800, 6860, 140, 2, 
  42801, 42900, 6876, 140, 2, 
  42901, 43000, 6892, 142, 2, 
  43001, 43100, 6908, 142, 2, 
  43101, 43200, 6924, 142, 2, 
  43201, 43300, 6940, 142, 2, 
  43301, 43400, 6956, 142, 2, 
  43401, 43500, 6972, 142, 2, 
  43501, 43600, 6988, 142, 2, 
  43601, 43700, 7004, 144, 2, 
  43701, 43800, 7020, 144, 2, 
  43801, 43900, 7036, 144, 2, 
  43901, 44000, 7052, 144, 2, 
  44001, 44100, 7068, 144, 2, 
  44101, 44200, 7084, 144, 2, 
  44201, 44300, 7100, 144, 2, 
  44301, 44400, 7116, 146, 2, 
  44401, 44500, 7132, 146, 2, 
  44501, 44600, 7148, 146, 2, 
  44601, 44700, 7164, 146, 2, 
  44701, 44800, 7180, 146, 2, 
  44801, 44900, 7196, 146, 2, 
  44901, 45000, 7212, 146, 2, 
  45001, 45100, 7228, 148, 2, 
  45101, 45200, 7244, 148, 2, 
  45201, 45300, 7260, 148, 2, 
  45301, 45400, 7276, 148, 2, 
  45401, 45500, 7292, 148, 2, 
  45501, 45600, 7308, 148, 2, 
  45601, 45700, 7324, 148, 2, 
  45701, 45800, 7340, 150, 2, 
  45801, 45900, 7356, 150, 2, 
  45901, 46000, 7372, 150, 2, 
  46001, 46100, 7388, 150, 2, 
  46101, 46200, 7404, 150, 2, 
  46201, 46300, 7420, 150, 2, 
  46301, 46400, 7436, 150, 2, 
  46401, 46500, 7452, 152, 2, 
  46501, 46600, 7468, 152, 2, 
  46601, 46700, 7484, 152, 2, 
  46701, 46800, 7500, 152, 2, 
  46801, 46900, 7516, 152, 2, 
  46901, 47000, 7532, 152, 2, 
  47001, 47100, 7548, 152, 2, 
  47101, 47200, 7564, 152, 2, 
  47201, 47300, 7580, 154, 2, 
  47301, 47400, 7596, 154, 2, 
  47401, 47500, 7612, 154, 2, 
  47501, 47600, 7628, 154, 2, 
  47601, 47700, 7644, 154, 2, 
  47701, 47800, 7660, 154, 2, 
  47801, 47900, 7676, 154, 2, 
  47901, 48000, 7692, 156, 2, 
  48001, 48100, 7708, 156, 2, 
  48101, 48200, 7724, 156, 2, 
  48201, 48300, 7740, 156, 2, 
  48301, 48400, 7756, 156, 2, 
  48401, 48500, 7772, 156, 2, 
  48501, 48600, 7788, 156, 2, 
  48601, 48700, 7804, 158, 2, 
  48701, 48800, 7820, 158, 2, 
  48801, 48900, 7836, 158, 2, 
  48901, 49000, 7852, 158, 2, 
  49001, 49100, 7868, 158, 2, 
  49101, 49200, 7884, 158, 2, 
  49201, 49300, 7900, 158, 2, 
  49301, 49400, 7916, 160, 2, 
  49401, 49500, 7932, 160, 2, 
  49501, 49600, 7948, 160, 2, 
  49601, 49700, 7964, 160, 2, 
  49701, 49800, 7980, 160, 2, 
  49801, 49900, 7996, 160, 2, 
  49901, 50000, 8012, 160, 2, 
  50001, 50100, 8028, 162, 2, 
  50101, 50200, 8044, 162, 2, 
  50201, 50300, 8060, 162, 2, 
  50301, 50400, 8076, 162, 2, 
  50401, 50500, 8092, 162, 2, 
  50501, 50600, 8108, 162, 2, 
  50601, 50700, 8124, 162, 2, 
  50701, 50800, 8140, 164, 2, 
  50801, 50900, 8156, 164, 2, 
  50901, 51000, 8172, 164, 2, 
  51001, 51100, 8188, 164, 2, 
  51101, 51200, 8204, 164, 2, 
  51201, 51300, 8220, 164, 2, 
  51301, 51400, 8236, 164, 2, 
  51401, 51500, 8252, 166, 2, 
  51501, 51600, 8268, 166, 2, 
  51601, 51700, 8284, 166, 2, 
  51701, 51800, 8300, 166, 2, 
  51801, 51900, 8316, 166, 2, 
  51901, 52000, 8332, 166, 2, 
  52001, 52100, 8348, 166, 2, 
  52101, 52200, 8364, 166, 2, 
  52201, 52300, 8380, 168, 2, 
  52301, 52400, 8396, 168, 2, 
  52401, 52500, 8412, 168, 2, 
  52501, 52600, 8428, 168, 2, 
  52601, 52700, 8444, 168, 2, 
  52701, 52800, 8460, 168, 2, 
  52801, 52900, 8476, 168, 2, 
  52901, 53000, 8492, 170, 2, 
  53001, 53100, 8508, 170, 2, 
  53101, 53200, 8524, 170, 2, 
  53201, 53300, 8540, 170, 2, 
  53301, 53400, 8556, 170, 2, 
  53401, 53500, 8572, 170, 2, 
  53501, 53600, 8588, 170, 2, 
  53601, 53700, 8604, 172, 2, 
  53701, 53800, 8620, 172, 2, 
  53801, 53900, 8636, 172, 2, 
  53901, 54000, 8652, 172, 2, 
  54001, 54100, 8668, 172, 2, 
  54101, 54200, 8684, 172, 2, 
  54201, 54300, 8700, 172, 2, 
  54301, 54400, 8716, 174, 2, 
  54401, 54500, 8732, 174, 2, 
  54501, 54600, 8748, 174, 2, 
  54601, 54700, 8764, 174, 2, 
  54701, 54800, 8780, 174, 2, 
  54801, 54900, 8796, 174, 2, 
  54901, 55000, 8812, 174, 2, 
  55001, 55100, 8828, 176, 2, 
  55101, 55200, 8844, 176, 2, 
  55201, 55300, 8860, 176, 2, 
  55301, 55400, 8876, 176, 2, 
  55401, 55500, 8892, 176, 2, 
  55501, 55600, 8908, 176, 2, 
  55601, 55700, 8924, 176, 2, 
  55701, 55800, 8940, 178, 2, 
  55801, 55900, 8956, 178, 2, 
  55901, 56000, 8972, 178, 2, 
  56001, 56100, 8988, 178, 2, 
  56101, 56200, 9004, 178, 2, 
  56201, 56300, 9020, 178, 2, 
  56301, 56400, 9036, 178, 2, 
  56401, 56500, 9052, 180, 2, 
  56501, 56600, 9068, 180, 2, 
  56601, 56700, 9084, 180, 2, 
  56701, 56800, 9100, 180, 2, 
  56801, 56900, 9116, 180, 2, 
  56901, 57000, 9132, 180, 2, 
  57001, 57100, 9148, 180, 2, 
  57101, 57200, 9164, 180, 2, 
  57201, 57300, 9180, 182, 2, 
  57301, 57400, 9196, 182, 2, 
  57401, 57500, 9212, 182, 2, 
  57501, 57600, 9228, 182, 2, 
  57601, 57700, 9244, 182, 2, 
  57701, 57800, 9260, 182, 2, 
  57801, 57900, 9276, 182, 2, 
  57901, 58000, 9292, 184, 2, 
  58001, 58100, 9308, 184, 2, 
  58101, 58200, 9324, 184, 2, 
  58201, 58300, 9340, 184, 2, 
  58301, 58400, 9356, 184, 2, 
  58401, 58500, 9372, 184, 2, 
  58501, 58600, 9388, 184, 2, 
  58601, 58700, 9404, 186, 2, 
  58701, 58800, 9420, 186, 2, 
  58801, 58900, 9436, 186, 2, 
  58901, 59000, 9452, 186, 2, 
  59001, 59100, 9468, 186, 2, 
  59101, 59200, 9484, 186, 2, 
  59201, 59300, 9500, 186, 2, 
  59301, 59400, 9516, 188, 2, 
  59401, 59500, 9532, 188, 2, 
  59501, 59600, 9548, 188, 2, 
  59601, 59700, 9564, 188, 2, 
  59701, 59800, 9580, 188, 2, 
  59801, 59900, 9596, 188, 2, 
  59901, 60000, 9612, 188, 2, 
  60001, 60100, 9628, 190, 2, 
  60100, 9000000, 0, 190, 2, 
]
MINE = [
  0, 0, 3600,
  0, 1, 10800,
  0, 2, 36000,
  1, 0, 3600,
  1, 1, 10800,
  1, 2, 36000,
]
MINELOCKTIME = 1800
# MINE = [
#   0, 0, 10,
#   0, 1, 10,
#   0, 2, 10,
#   1, 0, 10,
#   1, 1, 10,
#   1, 2, 10,
# ]
GOLDOUTPUT = [
 0, 6000, 690, 1, 
 6001, 6100, 1363, 1, 
 6101, 6200, 1385, 1, 
 6201, 6300, 1407, 1, 
 6301, 6400, 1430, 1, 
 6401, 6500, 1452, 1, 
 6501, 6600, 1475, 1, 
 6601, 6700, 1497, 1, 
 6701, 6800, 1519, 1, 
 6801, 6900, 1542, 1, 
 6901, 7000, 1564, 1, 
 7001, 7100, 1587, 1, 
 7101, 7200, 1609, 1, 
 7201, 7300, 1631, 1, 
 7301, 7400, 1654, 1, 
 7401, 7500, 1676, 1, 
 7501, 7600, 1699, 1, 
 7601, 7700, 1721, 1, 
 7701, 7800, 1743, 1, 
 7801, 7900, 1766, 1, 
 7901, 8000, 1788, 1, 
 8001, 8100, 1811, 1, 
 8101, 8200, 1833, 1, 
 8201, 8300, 1855, 1, 
 8301, 8400, 1878, 1, 
 8401, 8500, 1900, 1, 
 8501, 8600, 1923, 1, 
 8601, 8700, 1945, 1, 
 8701, 8800, 1967, 1, 
 8801, 8900, 1990, 1, 
 8901, 9000, 2012, 1, 
 9001, 9100, 2035, 1, 
 9101, 9200, 2057, 1, 
 9201, 9300, 2079, 1, 
 9301, 9400, 2102, 1, 
 9401, 9500, 2124, 1, 
 9501, 9600, 2147, 1, 
 9601, 9700, 2169, 1, 
 9701, 9800, 2191, 1, 
 9801, 9900, 2214, 1, 
 9901, 10000, 2236, 1, 
 10001, 10100, 2259, 1, 
 10101, 10200, 2281, 1, 
 10201, 10300, 2303, 1, 
 10301, 10400, 2326, 1, 
 10401, 10500, 2348, 1, 
 10501, 10600, 2371, 1, 
 10601, 10700, 2393, 1, 
 10701, 10800, 2415, 1, 
 10801, 10900, 2438, 1, 
 10901, 11000, 2460, 1, 
 11001, 11100, 2483, 1, 
 11101, 11200, 2505, 1, 
 11201, 11300, 2527, 1, 
 11301, 11400, 2550, 1, 
 11401, 11500, 2572, 1, 
 11501, 11600, 2595, 1, 
 11601, 11700, 2617, 1, 
 11701, 11800, 2639, 1, 
 11801, 11900, 2662, 1, 
 11901, 12000, 2684, 1, 
 12001, 12100, 2707, 1, 
 12101, 12200, 2729, 1, 
 12201, 12300, 2751, 1, 
 12301, 12400, 2774, 1, 
 12401, 12500, 2796, 1, 
 12501, 12600, 2819, 1, 
 12601, 12700, 2841, 1, 
 12701, 12800, 2863, 1, 
 12801, 12900, 2886, 1, 
 12901, 13000, 2908, 1, 
 13001, 13100, 2931, 1, 
 13101, 13200, 2953, 1, 
 13201, 13300, 2975, 1, 
 13301, 13400, 2998, 1, 
 13401, 13500, 3020, 1, 
 13501, 13600, 3043, 1, 
 13601, 13700, 3065, 1, 
 13701, 13800, 3087, 1, 
 13801, 13900, 3110, 1, 
 13901, 14000, 3132, 1, 
 14001, 14100, 3155, 1, 
 14101, 14200, 3177, 1, 
 14201, 14300, 3199, 1, 
 14301, 14400, 3222, 1, 
 14401, 14500, 3244, 1, 
 14501, 14600, 3267, 1, 
 14601, 14700, 3289, 1, 
 14701, 14800, 3311, 1, 
 14801, 14900, 3334, 1, 
 14901, 15000, 3356, 1, 
 15001, 15100, 3379, 1, 
 15101, 15200, 3401, 1, 
 15201, 15300, 3423, 1, 
 15301, 15400, 3446, 1, 
 15401, 15500, 3468, 1, 
 15501, 15600, 3491, 1, 
 15601, 15700, 3513, 1, 
 15701, 15800, 3535, 1, 
 15801, 15900, 3558, 1, 
 15901, 16000, 3580, 1, 
 16001, 16100, 3603, 1, 
 16101, 16200, 3625, 1, 
 16201, 16300, 3647, 1, 
 16301, 16400, 3670, 1, 
 16401, 16500, 3692, 1, 
 16501, 16600, 3715, 1, 
 16601, 16700, 3737, 1, 
 16701, 16800, 3759, 1, 
 16801, 16900, 3782, 1, 
 16901, 17000, 3804, 1, 
 17001, 17100, 3827, 1, 
 17101, 17200, 3849, 1, 
 17201, 17300, 3871, 1, 
 17301, 17400, 3894, 1, 
 17401, 17500, 3916, 1, 
 17501, 17600, 3939, 1, 
 17601, 17700, 3961, 1, 
 17701, 17800, 3983, 1, 
 17801, 17900, 4006, 1, 
 17901, 18000, 4028, 1, 
 18001, 18100, 4051, 1, 
 18101, 18200, 4073, 1, 
 18201, 18300, 4095, 1, 
 18301, 18400, 4118, 1, 
 18401, 18500, 4140, 1, 
 18501, 18600, 4163, 1, 
 18601, 18700, 4185, 1, 
 18701, 18800, 4207, 1, 
 18801, 18900, 4230, 1, 
 18901, 19000, 4252, 1, 
 19001, 19100, 4275, 1, 
 19101, 19200, 4297, 1, 
 19201, 19300, 4319, 1, 
 19301, 19400, 4342, 1, 
 19401, 19500, 4364, 1, 
 19501, 19600, 4387, 1, 
 19601, 19700, 4409, 1, 
 19701, 19800, 4431, 1, 
 19801, 19900, 4454, 1, 
 19901, 20000, 4476, 1, 
 20001, 20100, 4499, 1, 
 20101, 20200, 4521, 1, 
 20201, 20300, 4543, 1, 
 20301, 20400, 4566, 1, 
 20401, 20500, 4588, 1, 
 20501, 20600, 4611, 1, 
 20601, 20700, 4633, 1, 
 20701, 20800, 4655, 1, 
 20801, 20900, 4678, 1, 
 20901, 21000, 4700, 1, 
 21001, 21100, 4723, 1, 
 21101, 21200, 4745, 1, 
 21201, 21300, 4767, 1, 
 21301, 21400, 4790, 1, 
 21401, 21500, 4812, 1, 
 21501, 21600, 4835, 1, 
 21601, 21700, 4857, 1, 
 21701, 21800, 4879, 1, 
 21801, 21900, 4902, 1, 
 21901, 22000, 4924, 1, 
 22001, 22100, 4947, 1, 
 22101, 22200, 4969, 1, 
 22201, 22300, 4991, 1, 
 22301, 22400, 5014, 1, 
 22401, 22500, 5036, 1, 
 22501, 22600, 5059, 1, 
 22601, 22700, 5081, 1, 
 22701, 22800, 5103, 1, 
 22801, 22900, 5126, 1, 
 22901, 23000, 5148, 1, 
 23001, 23100, 5171, 1, 
 23101, 23200, 5193, 1, 
 23201, 23300, 5215, 1, 
 23301, 23400, 5238, 1, 
 23401, 23500, 5260, 1, 
 23501, 23600, 5283, 1, 
 23601, 23700, 5305, 1, 
 23701, 23800, 5327, 1, 
 23801, 23900, 5350, 1, 
 23901, 24000, 5372, 1, 
 24001, 24100, 5395, 1, 
 24101, 24200, 5417, 1, 
 24201, 24300, 5439, 1, 
 24301, 24400, 5462, 1, 
 24401, 24500, 5484, 1, 
 24501, 24600, 5507, 1, 
 24601, 24700, 5529, 1, 
 24701, 24800, 5551, 1, 
 24801, 24900, 5574, 1, 
 24901, 25000, 5596, 1, 
 25001, 25100, 5619, 1, 
 25101, 25200, 5641, 1, 
 25201, 25300, 5663, 1, 
 25301, 25400, 5686, 1, 
 25401, 25500, 5708, 1, 
 25501, 25600, 5731, 1, 
 25601, 25700, 5753, 1, 
 25701, 25800, 5775, 1, 
 25801, 25900, 5798, 1, 
 25901, 26000, 5820, 1, 
 26001, 26100, 5843, 1, 
 26101, 26200, 5865, 1, 
 26201, 26300, 5887, 1, 
 26301, 26400, 5910, 1, 
 26401, 26500, 5932, 1, 
 26501, 26600, 5955, 1, 
 26601, 26700, 5977, 1, 
 26701, 26800, 5999, 1, 
 26801, 26900, 6022, 1, 
 26901, 27000, 6044, 1, 
 27001, 27100, 6067, 1, 
 27101, 27200, 6089, 1, 
 27201, 27300, 6111, 1, 
 27301, 27400, 6134, 1, 
 27401, 27500, 6156, 1, 
 27501, 27600, 6179, 1, 
 27601, 27700, 6201, 1, 
 27701, 27800, 6223, 1, 
 27801, 27900, 6246, 1, 
 27901, 28000, 6268, 1, 
 28001, 28100, 6291, 1, 
 28101, 28200, 6313, 1, 
 28201, 28300, 6335, 1, 
 28301, 28400, 6358, 1, 
 28401, 28500, 6380, 1, 
 28501, 28600, 6403, 1, 
 28601, 28700, 6425, 1, 
 28701, 28800, 6447, 1, 
 28801, 28900, 6470, 1, 
 28901, 29000, 6492, 1, 
 29001, 29100, 6515, 1, 
 29101, 29200, 6537, 1, 
 29201, 29300, 6559, 1, 
 29301, 29400, 6582, 1, 
 29401, 29500, 6604, 1, 
 29501, 29600, 6627, 1, 
 29601, 29700, 6649, 1, 
 29701, 29800, 6671, 1, 
 29801, 29900, 6694, 1, 
 29901, 30000, 6716, 1, 
 30001, 30100, 6739, 1, 
 30101, 30200, 6761, 1, 
 30201, 30300, 6783, 1, 
 30301, 30400, 6806, 1, 
 30401, 30500, 6828, 1, 
 30501, 30600, 6851, 1, 
 30601, 30700, 6873, 1, 
 30701, 30800, 6895, 1, 
 30801, 30900, 6918, 1, 
 30901, 31000, 6940, 1, 
 31001, 31100, 6963, 1, 
 31101, 31200, 6985, 1, 
 31201, 31300, 7007, 1, 
 31301, 31400, 7030, 1, 
 31401, 31500, 7052, 1, 
 31501, 31600, 7075, 1, 
 31601, 31700, 7097, 1, 
 31701, 31800, 7119, 1, 
 31801, 31900, 7142, 1, 
 31901, 32000, 7164, 1, 
 32001, 32100, 7187, 1, 
 32101, 32200, 7209, 1, 
 32201, 32300, 7231, 1, 
 32301, 32400, 7254, 1, 
 32401, 32500, 7276, 1, 
 32501, 32600, 7299, 1, 
 32601, 32700, 7321, 1, 
 32701, 32800, 7343, 1, 
 32801, 32900, 7366, 1, 
 32901, 33000, 7388, 1, 
 33001, 33100, 7411, 1, 
 33101, 33200, 7433, 1, 
 33201, 33300, 7455, 1, 
 33301, 33400, 7478, 1, 
 33401, 33500, 7500, 1, 
 33501, 33600, 7523, 1, 
 33601, 33700, 7545, 1, 
 33701, 33800, 7567, 1, 
 33801, 33900, 7590, 1, 
 33901, 34000, 7612, 1, 
 34001, 34100, 7635, 1, 
 34101, 34200, 7657, 1, 
 34201, 34300, 7679, 1, 
 34301, 34400, 7702, 1, 
 34401, 34500, 7724, 1, 
 34501, 34600, 7747, 1, 
 34601, 34700, 7769, 1, 
 34701, 34800, 7791, 1, 
 34801, 34900, 7814, 1, 
 34901, 35000, 7836, 1, 
 35001, 35100, 7859, 1, 
 35101, 35200, 7881, 1, 
 35201, 35300, 7903, 1, 
 35301, 35400, 7926, 1, 
 35401, 35500, 7948, 1, 
 35501, 35600, 7971, 1, 
 35601, 35700, 7993, 1, 
 35701, 35800, 8015, 1, 
 35801, 35900, 8038, 1, 
 35901, 36000, 8060, 1, 
 36001, 36100, 8083, 1, 
 36101, 36200, 8105, 1, 
 36201, 36300, 8127, 1, 
 36301, 36400, 8150, 1, 
 36401, 36500, 8172, 1, 
 36501, 36600, 8195, 1, 
 36601, 36700, 8217, 1, 
 36701, 36800, 8239, 1, 
 36801, 36900, 8262, 1, 
 36901, 37000, 8284, 1, 
 37001, 37100, 8307, 1, 
 37101, 37200, 8329, 1, 
 37201, 37300, 8351, 1, 
 37301, 37400, 8374, 1, 
 37401, 37500, 8396, 1, 
 37501, 37600, 8419, 1, 
 37601, 37700, 8441, 1, 
 37701, 37800, 8463, 1, 
 37801, 37900, 8486, 1, 
 37901, 38000, 8508, 1, 
 38001, 38100, 8531, 1, 
 38101, 38200, 8553, 1, 
 38201, 38300, 8575, 1, 
 38301, 38400, 8598, 1, 
 38401, 38500, 8620, 1, 
 38501, 38600, 8643, 1, 
 38601, 38700, 8665, 1, 
 38701, 38800, 8687, 1, 
 38801, 38900, 8710, 1, 
 38901, 39000, 8732, 1, 
 39001, 39100, 8755, 1, 
 39101, 39200, 8777, 1, 
 39201, 39300, 8799, 1, 
 39301, 39400, 8822, 1, 
 39401, 39500, 8844, 1, 
 39501, 39600, 8867, 1, 
 39601, 39700, 8889, 1, 
 39701, 39800, 8911, 1, 
 39801, 39900, 8934, 1, 
 39901, 40000, 8956, 1, 
 40001, 40100, 8979, 1, 
 40101, 40200, 9001, 1, 
 40201, 40300, 9023, 1, 
 40301, 40400, 9046, 1, 
 40401, 40500, 9068, 1, 
 40501, 40600, 9091, 1, 
 40601, 40700, 9113, 1, 
 40701, 40800, 9135, 1, 
 40801, 40900, 9158, 1, 
 40901, 41000, 9180, 1, 
 41001, 41100, 9203, 1, 
 41101, 41200, 9225, 1, 
 41201, 41300, 9247, 1, 
 41301, 41400, 9270, 1, 
 41401, 41500, 9292, 1, 
 41501, 41600, 9315, 1, 
 41601, 41700, 9337, 1, 
 41701, 41800, 9359, 1, 
 41801, 41900, 9382, 1, 
 41901, 42000, 9404, 1, 
 42001, 42100, 9427, 1, 
 42101, 42200, 9449, 1, 
 42201, 42300, 9471, 1, 
 42301, 42400, 9494, 1, 
 42401, 42500, 9516, 1, 
 42501, 42600, 9539, 1, 
 42601, 42700, 9561, 1, 
 42701, 42800, 9583, 1, 
 42801, 42900, 9606, 1, 
 42901, 43000, 9628, 1, 
 43001, 43100, 9651, 1, 
 43101, 43200, 9673, 1, 
 43201, 43300, 9695, 1, 
 43301, 43400, 9718, 1, 
 43401, 43500, 9740, 1, 
 43501, 43600, 9763, 1, 
 43601, 43700, 9785, 1, 
 43701, 43800, 9807, 1, 
 43801, 43900, 9830, 1, 
 43901, 44000, 9852, 1, 
 44001, 44100, 9875, 1, 
 44101, 44200, 9897, 1, 
 44201, 44300, 9919, 1, 
 44301, 44400, 9942, 1, 
 44401, 44500, 9964, 1, 
 44501, 44600, 9987, 1, 
 44601, 44700, 10009, 1, 
 44701, 44800, 10031, 1, 
 44801, 44900, 10054, 1, 
 44901, 45000, 10076, 1, 
 45001, 45100, 10099, 1, 
 45101, 45200, 10121, 1, 
 45201, 45300, 10143, 1, 
 45301, 45400, 10166, 1, 
 45401, 45500, 10188, 1, 
 45501, 45600, 10211, 1, 
 45601, 45700, 10233, 1, 
 45701, 45800, 10255, 1, 
 45801, 45900, 10278, 1, 
 45901, 46000, 10300, 1, 
 46001, 46100, 10323, 1, 
 46101, 46200, 10345, 1, 
 46201, 46300, 10367, 1, 
 46301, 46400, 10390, 1, 
 46401, 46500, 10412, 1, 
 46501, 46600, 10435, 1, 
 46601, 46700, 10457, 1, 
 46701, 46800, 10479, 1, 
 46801, 46900, 10502, 1, 
 46901, 47000, 10524, 1, 
 47001, 47100, 10547, 1, 
 47101, 47200, 10569, 1, 
 47201, 47300, 10591, 1, 
 47301, 47400, 10614, 1, 
 47401, 47500, 10636, 1, 
 47501, 47600, 10659, 1, 
 47601, 47700, 10681, 1, 
 47701, 47800, 10703, 1, 
 47801, 47900, 10726, 1, 
 47901, 48000, 10748, 1, 
 48001, 48100, 10771, 1, 
 48101, 48200, 10793, 1, 
 48201, 48300, 10815, 1, 
 48301, 48400, 10838, 1, 
 48401, 48500, 10860, 1, 
 48501, 48600, 10883, 1, 
 48601, 48700, 10905, 1, 
 48701, 48800, 10927, 1, 
 48801, 48900, 10950, 1, 
 48901, 49000, 10972, 1, 
 49001, 49100, 10995, 1, 
 49101, 49200, 11017, 1, 
 49201, 49300, 11039, 1, 
 49301, 49400, 11062, 1, 
 49401, 49500, 11084, 1, 
 49501, 49600, 11107, 1, 
 49601, 49700, 11129, 1, 
 49701, 49800, 11151, 1, 
 49801, 49900, 11174, 1, 
 49901, 50000, 11196, 1, 
 50001, 50100, 11219, 1, 
 50101, 50200, 11241, 1, 
 50201, 50300, 11263, 1, 
 50301, 50400, 11286, 1, 
 50401, 50500, 11308, 1, 
 50501, 50600, 11331, 1, 
 50601, 50700, 11353, 1, 
 50701, 50800, 11375, 1, 
 50801, 50900, 11398, 1, 
 50901, 51000, 11420, 1, 
 51001, 51100, 11443, 1, 
 51101, 51200, 11465, 1, 
 51201, 51300, 11487, 1, 
 51301, 51400, 11510, 1, 
 51401, 51500, 11532, 1, 
 51501, 51600, 11555, 1, 
 51601, 51700, 11577, 1, 
 51701, 51800, 11599, 1, 
 51801, 51900, 11622, 1, 
 51901, 52000, 11644, 1, 
 52001, 52100, 11667, 1, 
 52101, 52200, 11689, 1, 
 52201, 52300, 11711, 1, 
 52301, 52400, 11734, 1, 
 52401, 52500, 11756, 1, 
 52501, 52600, 11779, 1, 
 52601, 52700, 11801, 1, 
 52701, 52800, 11823, 1, 
 52801, 52900, 11846, 1, 
 52901, 53000, 11868, 1, 
 53001, 53100, 11891, 1, 
 53101, 53200, 11913, 1, 
 53201, 53300, 11935, 1, 
 53301, 53400, 11958, 1, 
 53401, 53500, 11980, 1, 
 53501, 53600, 12003, 1, 
 53601, 53700, 12025, 1, 
 53701, 53800, 12047, 1, 
 53801, 53900, 12070, 1, 
 53901, 54000, 12092, 1, 
 54001, 54100, 12115, 1, 
 54101, 54200, 12137, 1, 
 54201, 54300, 12159, 1, 
 54301, 54400, 12182, 1, 
 54401, 54500, 12204, 1, 
 54501, 54600, 12227, 1, 
 54601, 54700, 12249, 1, 
 54701, 54800, 12271, 1, 
 54801, 54900, 12294, 1, 
 54901, 55000, 12316, 1, 
 55001, 55100, 12339, 1, 
 55101, 55200, 12361, 1, 
 55201, 55300, 12383, 1, 
 55301, 55400, 12406, 1, 
 55401, 55500, 12428, 1, 
 55501, 55600, 12451, 1, 
 55601, 55700, 12473, 1, 
 55701, 55800, 12495, 1, 
 55801, 55900, 12518, 1, 
 55901, 56000, 12540, 1, 
 56001, 56100, 12563, 1, 
 56101, 56200, 12585, 1, 
 56201, 56300, 12607, 1, 
 56301, 56400, 12630, 1, 
 56401, 56500, 12652, 1, 
 56501, 56600, 12675, 1, 
 56601, 56700, 12697, 1, 
 56701, 56800, 12719, 1, 
 56801, 56900, 12742, 1, 
 56901, 57000, 12764, 1, 
 57001, 57100, 12787, 1, 
 57101, 57200, 12809, 1, 
 57201, 57300, 12831, 1, 
 57301, 57400, 12854, 1, 
 57401, 57500, 12876, 1, 
 57501, 57600, 12899, 1, 
 57601, 57700, 12921, 1, 
 57701, 57800, 12943, 1, 
 57801, 57900, 12966, 1, 
 57901, 58000, 12988, 1, 
 58001, 58100, 13011, 1, 
 58101, 58200, 13033, 1, 
 58201, 58300, 13055, 1, 
 58301, 58400, 13078, 1, 
 58401, 58500, 13100, 1, 
 58501, 58600, 13123, 1, 
 58601, 58700, 13145, 1, 
 58701, 58800, 13167, 1, 
 58801, 58900, 13190, 1, 
 58901, 59000, 13212, 1, 
 59001, 59100, 13235, 1, 
 59101, 59200, 13257, 1, 
 59201, 59300, 13279, 1, 
 59301, 59400, 13302, 1, 
 59401, 59500, 13324, 1, 
 59501, 59600, 13347, 1, 
 59601, 59700, 13369, 1, 
 59701, 59800, 13391, 1, 
 59801, 59900, 13414, 1, 
 59901, 60000, 13436, 1, 
 60001, 60100, 13459, 1, 
]
FEATOUTPUT = [
 0, 6000, 42, 1, 
 6001, 6100, 54, 1, 
 6101, 6200, 54, 1, 
 6201, 6300, 54, 1, 
 6301, 6400, 54, 1, 
 6401, 6500, 56, 1, 
 6501, 6600, 56, 1, 
 6601, 6700, 56, 1, 
 6701, 6800, 56, 1, 
 6801, 6900, 56, 1, 
 6901, 7000, 58, 1, 
 7001, 7100, 58, 1, 
 7101, 7200, 58, 1, 
 7201, 7300, 58, 1, 
 7301, 7400, 58, 1, 
 7401, 7500, 60, 1, 
 7501, 7600, 60, 1, 
 7601, 7700, 60, 1, 
 7701, 7800, 60, 1, 
 7801, 7900, 60, 1, 
 7901, 8000, 62, 1, 
 8001, 8100, 62, 1, 
 8101, 8200, 62, 1, 
 8201, 8300, 62, 1, 
 8301, 8400, 62, 1, 
 8401, 8500, 64, 1, 
 8501, 8600, 64, 1, 
 8601, 8700, 64, 1, 
 8701, 8800, 64, 1, 
 8801, 8900, 64, 1, 
 8901, 9000, 66, 1, 
 9001, 9100, 66, 1, 
 9101, 9200, 66, 1, 
 9201, 9300, 66, 1, 
 9301, 9400, 66, 1, 
 9401, 9500, 68, 1, 
 9501, 9600, 68, 1, 
 9601, 9700, 68, 1, 
 9701, 9800, 68, 1, 
 9801, 9900, 68, 1, 
 9901, 10000, 70, 1, 
 10001, 10100, 70, 1, 
 10101, 10200, 70, 1, 
 10201, 10300, 70, 1, 
 10301, 10400, 70, 1, 
 10401, 10500, 72, 1, 
 10501, 10600, 72, 1, 
 10601, 10700, 72, 1, 
 10701, 10800, 72, 1, 
 10801, 10900, 72, 1, 
 10901, 11000, 74, 1, 
 11001, 11100, 74, 1, 
 11101, 11200, 74, 1, 
 11201, 11300, 74, 1, 
 11301, 11400, 74, 1, 
 11401, 11500, 76, 1, 
 11501, 11600, 76, 1, 
 11601, 11700, 76, 1, 
 11701, 11800, 76, 1, 
 11801, 11900, 76, 1, 
 11901, 12000, 78, 1, 
 12001, 12100, 78, 1, 
 12101, 12200, 78, 1, 
 12201, 12300, 78, 1, 
 12301, 12400, 78, 1, 
 12401, 12500, 80, 1, 
 12501, 12600, 80, 1, 
 12601, 12700, 80, 1, 
 12701, 12800, 80, 1, 
 12801, 12900, 80, 1, 
 12901, 13000, 82, 1, 
 13001, 13100, 82, 1, 
 13101, 13200, 82, 1, 
 13201, 13300, 82, 1, 
 13301, 13400, 82, 1, 
 13401, 13500, 84, 1, 
 13501, 13600, 84, 1, 
 13601, 13700, 84, 1, 
 13701, 13800, 84, 1, 
 13801, 13900, 84, 1, 
 13901, 14000, 86, 1, 
 14001, 14100, 86, 1, 
 14101, 14200, 86, 1, 
 14201, 14300, 86, 1, 
 14301, 14400, 86, 1, 
 14401, 14500, 88, 1, 
 14501, 14600, 88, 1, 
 14601, 14700, 88, 1, 
 14701, 14800, 88, 1, 
 14801, 14900, 88, 1, 
 14901, 15000, 90, 1, 
 15001, 15100, 90, 1, 
 15101, 15200, 90, 1, 
 15201, 15300, 90, 1, 
 15301, 15400, 90, 1, 
 15401, 15500, 92, 1, 
 15501, 15600, 92, 1, 
 15601, 15700, 92, 1, 
 15701, 15800, 92, 1, 
 15801, 15900, 92, 1, 
 15901, 16000, 94, 1, 
 16001, 16100, 94, 1, 
 16101, 16200, 94, 1, 
 16201, 16300, 94, 1, 
 16301, 16400, 94, 1, 
 16401, 16500, 96, 1, 
 16501, 16600, 96, 1, 
 16601, 16700, 96, 1, 
 16701, 16800, 96, 1, 
 16801, 16900, 96, 1, 
 16901, 17000, 98, 1, 
 17001, 17100, 98, 1, 
 17101, 17200, 98, 1, 
 17201, 17300, 98, 1, 
 17301, 17400, 98, 1, 
 17401, 17500, 100, 1, 
 17501, 17600, 100, 1, 
 17601, 17700, 100, 1, 
 17701, 17800, 100, 1, 
 17801, 17900, 100, 1, 
 17901, 18000, 102, 1, 
 18001, 18100, 102, 1, 
 18101, 18200, 102, 1, 
 18201, 18300, 102, 1, 
 18301, 18400, 102, 1, 
 18401, 18500, 104, 1, 
 18501, 18600, 104, 1, 
 18601, 18700, 104, 1, 
 18701, 18800, 104, 1, 
 18801, 18900, 104, 1, 
 18901, 19000, 106, 1, 
 19001, 19100, 106, 1, 
 19101, 19200, 106, 1, 
 19201, 19300, 106, 1, 
 19301, 19400, 106, 1, 
 19401, 19500, 108, 1, 
 19501, 19600, 108, 1, 
 19601, 19700, 108, 1, 
 19701, 19800, 108, 1, 
 19801, 19900, 108, 1, 
 19901, 20000, 110, 1, 
 20001, 20100, 110, 1, 
 20101, 20200, 110, 1, 
 20201, 20300, 110, 1, 
 20301, 20400, 110, 1, 
 20401, 20500, 112, 1, 
 20501, 20600, 112, 1, 
 20601, 20700, 112, 1, 
 20701, 20800, 112, 1, 
 20801, 20900, 112, 1, 
 20901, 21000, 114, 1, 
 21001, 21100, 114, 1, 
 21101, 21200, 114, 1, 
 21201, 21300, 114, 1, 
 21301, 21400, 114, 1, 
 21401, 21500, 116, 1, 
 21501, 21600, 116, 1, 
 21601, 21700, 116, 1, 
 21701, 21800, 116, 1, 
 21801, 21900, 116, 1, 
 21901, 22000, 118, 1, 
 22001, 22100, 118, 1, 
 22101, 22200, 118, 1, 
 22201, 22300, 118, 1, 
 22301, 22400, 118, 1, 
 22401, 22500, 120, 1, 
 22501, 22600, 120, 1, 
 22601, 22700, 120, 1, 
 22701, 22800, 120, 1, 
 22801, 22900, 120, 1, 
 22901, 23000, 122, 1, 
 23001, 23100, 122, 1, 
 23101, 23200, 122, 1, 
 23201, 23300, 122, 1, 
 23301, 23400, 122, 1, 
 23401, 23500, 124, 1, 
 23501, 23600, 124, 1, 
 23601, 23700, 124, 1, 
 23701, 23800, 124, 1, 
 23801, 23900, 124, 1, 
 23901, 24000, 126, 1, 
 24001, 24100, 126, 1, 
 24101, 24200, 126, 1, 
 24201, 24300, 126, 1, 
 24301, 24400, 126, 1, 
 24401, 24500, 128, 1, 
 24501, 24600, 128, 1, 
 24601, 24700, 128, 1, 
 24701, 24800, 128, 1, 
 24801, 24900, 128, 1, 
 24901, 25000, 130, 1, 
 25001, 25100, 130, 1, 
 25101, 25200, 130, 1, 
 25201, 25300, 130, 1, 
 25301, 25400, 130, 1, 
 25401, 25500, 132, 1, 
 25501, 25600, 132, 1, 
 25601, 25700, 132, 1, 
 25701, 25800, 132, 1, 
 25801, 25900, 132, 1, 
 25901, 26000, 134, 1, 
 26001, 26100, 134, 1, 
 26101, 26200, 134, 1, 
 26201, 26300, 134, 1, 
 26301, 26400, 134, 1, 
 26401, 26500, 136, 1, 
 26501, 26600, 136, 1, 
 26601, 26700, 136, 1, 
 26701, 26800, 136, 1, 
 26801, 26900, 136, 1, 
 26901, 27000, 138, 1, 
 27001, 27100, 138, 1, 
 27101, 27200, 138, 1, 
 27201, 27300, 138, 1, 
 27301, 27400, 138, 1, 
 27401, 27500, 140, 1, 
 27501, 27600, 140, 1, 
 27601, 27700, 140, 1, 
 27701, 27800, 140, 1, 
 27801, 27900, 140, 1, 
 27901, 28000, 142, 1, 
 28001, 28100, 142, 1, 
 28101, 28200, 142, 1, 
 28201, 28300, 142, 1, 
 28301, 28400, 142, 1, 
 28401, 28500, 144, 1, 
 28501, 28600, 144, 1, 
 28601, 28700, 144, 1, 
 28701, 28800, 144, 1, 
 28801, 28900, 144, 1, 
 28901, 29000, 146, 1, 
 29001, 29100, 146, 1, 
 29101, 29200, 146, 1, 
 29201, 29300, 146, 1, 
 29301, 29400, 146, 1, 
 29401, 29500, 148, 1, 
 29501, 29600, 148, 1, 
 29601, 29700, 148, 1, 
 29701, 29800, 148, 1, 
 29801, 29900, 148, 1, 
 29901, 30000, 150, 1, 
 30001, 30100, 150, 1, 
 30101, 30200, 150, 1, 
 30201, 30300, 150, 1, 
 30301, 30400, 150, 1, 
 30401, 30500, 152, 1, 
 30501, 30600, 152, 1, 
 30601, 30700, 152, 1, 
 30701, 30800, 152, 1, 
 30801, 30900, 152, 1, 
 30901, 31000, 154, 1, 
 31001, 31100, 154, 1, 
 31101, 31200, 154, 1, 
 31201, 31300, 154, 1, 
 31301, 31400, 154, 1, 
 31401, 31500, 156, 1, 
 31501, 31600, 156, 1, 
 31601, 31700, 156, 1, 
 31701, 31800, 156, 1, 
 31801, 31900, 156, 1, 
 31901, 32000, 158, 1, 
 32001, 32100, 158, 1, 
 32101, 32200, 158, 1, 
 32201, 32300, 158, 1, 
 32301, 32400, 158, 1, 
 32401, 32500, 160, 1, 
 32501, 32600, 160, 1, 
 32601, 32700, 160, 1, 
 32701, 32800, 160, 1, 
 32801, 32900, 160, 1, 
 32901, 33000, 162, 1, 
 33001, 33100, 162, 1, 
 33101, 33200, 162, 1, 
 33201, 33300, 162, 1, 
 33301, 33400, 162, 1, 
 33401, 33500, 164, 1, 
 33501, 33600, 164, 1, 
 33601, 33700, 164, 1, 
 33701, 33800, 164, 1, 
 33801, 33900, 164, 1, 
 33901, 34000, 166, 1, 
 34001, 34100, 166, 1, 
 34101, 34200, 166, 1, 
 34201, 34300, 166, 1, 
 34301, 34400, 166, 1, 
 34401, 34500, 168, 1, 
 34501, 34600, 168, 1, 
 34601, 34700, 168, 1, 
 34701, 34800, 168, 1, 
 34801, 34900, 168, 1, 
 34901, 35000, 170, 1, 
 35001, 35100, 170, 1, 
 35101, 35200, 170, 1, 
 35201, 35300, 170, 1, 
 35301, 35400, 170, 1, 
 35401, 35500, 172, 1, 
 35501, 35600, 172, 1, 
 35601, 35700, 172, 1, 
 35701, 35800, 172, 1, 
 35801, 35900, 172, 1, 
 35901, 36000, 174, 1, 
 36001, 36100, 174, 1, 
 36101, 36200, 174, 1, 
 36201, 36300, 174, 1, 
 36301, 36400, 174, 1, 
 36401, 36500, 176, 1, 
 36501, 36600, 176, 1, 
 36601, 36700, 176, 1, 
 36701, 36800, 176, 1, 
 36801, 36900, 176, 1, 
 36901, 37000, 178, 1, 
 37001, 37100, 178, 1, 
 37101, 37200, 178, 1, 
 37201, 37300, 178, 1, 
 37301, 37400, 178, 1, 
 37401, 37500, 180, 1, 
 37501, 37600, 180, 1, 
 37601, 37700, 180, 1, 
 37701, 37800, 180, 1, 
 37801, 37900, 180, 1, 
 37901, 38000, 182, 1, 
 38001, 38100, 182, 1, 
 38101, 38200, 182, 1, 
 38201, 38300, 182, 1, 
 38301, 38400, 182, 1, 
 38401, 38500, 184, 1, 
 38501, 38600, 184, 1, 
 38601, 38700, 184, 1, 
 38701, 38800, 184, 1, 
 38801, 38900, 184, 1, 
 38901, 39000, 186, 1, 
 39001, 39100, 186, 1, 
 39101, 39200, 186, 1, 
 39201, 39300, 186, 1, 
 39301, 39400, 186, 1, 
 39401, 39500, 188, 1, 
 39501, 39600, 188, 1, 
 39601, 39700, 188, 1, 
 39701, 39800, 188, 1, 
 39801, 39900, 188, 1, 
 39901, 40000, 190, 1, 
 40001, 40100, 190, 1, 
 40101, 40200, 190, 1, 
 40201, 40300, 190, 1, 
 40301, 40400, 190, 1, 
 40401, 40500, 192, 1, 
 40501, 40600, 192, 1, 
 40601, 40700, 192, 1, 
 40701, 40800, 192, 1, 
 40801, 40900, 192, 1, 
 40901, 41000, 194, 1, 
 41001, 41100, 194, 1, 
 41101, 41200, 194, 1, 
 41201, 41300, 194, 1, 
 41301, 41400, 194, 1, 
 41401, 41500, 196, 1, 
 41501, 41600, 196, 1, 
 41601, 41700, 196, 1, 
 41701, 41800, 196, 1, 
 41801, 41900, 196, 1, 
 41901, 42000, 198, 1, 
 42001, 42100, 198, 2, 
 42101, 42200, 198, 2, 
 42201, 42300, 198, 2, 
 42301, 42400, 198, 2, 
 42401, 42500, 200, 2, 
 42501, 42600, 200, 2, 
 42601, 42700, 200, 2, 
 42701, 42800, 200, 2, 
 42801, 42900, 200, 2, 
 42901, 43000, 202, 2, 
 43001, 43100, 202, 2, 
 43101, 43200, 202, 2, 
 43201, 43300, 202, 2, 
 43301, 43400, 202, 2, 
 43401, 43500, 204, 2, 
 43501, 43600, 204, 2, 
 43601, 43700, 204, 2, 
 43701, 43800, 204, 2, 
 43801, 43900, 204, 2, 
 43901, 44000, 206, 2, 
 44001, 44100, 206, 2, 
 44101, 44200, 206, 2, 
 44201, 44300, 206, 2, 
 44301, 44400, 206, 2, 
 44401, 44500, 208, 2, 
 44501, 44600, 208, 2, 
 44601, 44700, 208, 2, 
 44701, 44800, 208, 2, 
 44801, 44900, 208, 2, 
 44901, 45000, 210, 2, 
 45001, 45100, 210, 2, 
 45101, 45200, 210, 2, 
 45201, 45300, 210, 2, 
 45301, 45400, 210, 2, 
 45401, 45500, 212, 2, 
 45501, 45600, 212, 2, 
 45601, 45700, 212, 2, 
 45701, 45800, 212, 2, 
 45801, 45900, 212, 2, 
 45901, 46000, 214, 2, 
 46001, 46100, 214, 2, 
 46101, 46200, 214, 2, 
 46201, 46300, 214, 2, 
 46301, 46400, 214, 2, 
 46401, 46500, 216, 2, 
 46501, 46600, 216, 2, 
 46601, 46700, 216, 2, 
 46701, 46800, 216, 2, 
 46801, 46900, 216, 2, 
 46901, 47000, 218, 2, 
 47001, 47100, 218, 2, 
 47101, 47200, 218, 2, 
 47201, 47300, 218, 2, 
 47301, 47400, 218, 2, 
 47401, 47500, 220, 2, 
 47501, 47600, 220, 2, 
 47601, 47700, 220, 2, 
 47701, 47800, 220, 2, 
 47801, 47900, 220, 2, 
 47901, 48000, 222, 2, 
 48001, 48100, 222, 2, 
 48101, 48200, 222, 2, 
 48201, 48300, 222, 2, 
 48301, 48400, 222, 2, 
 48401, 48500, 224, 2, 
 48501, 48600, 224, 2, 
 48601, 48700, 224, 2, 
 48701, 48800, 224, 2, 
 48801, 48900, 224, 2, 
 48901, 49000, 226, 2, 
 49001, 49100, 226, 2, 
 49101, 49200, 226, 2, 
 49201, 49300, 226, 2, 
 49301, 49400, 226, 2, 
 49401, 49500, 228, 2, 
 49501, 49600, 228, 2, 
 49601, 49700, 228, 2, 
 49701, 49800, 228, 2, 
 49801, 49900, 228, 2, 
 49901, 50000, 230, 2, 
 50001, 50100, 230, 2, 
 50101, 50200, 230, 2, 
 50201, 50300, 230, 2, 
 50301, 50400, 230, 2, 
 50401, 50500, 232, 2, 
 50501, 50600, 232, 2, 
 50601, 50700, 232, 2, 
 50701, 50800, 232, 2, 
 50801, 50900, 232, 2, 
 50901, 51000, 234, 2, 
 51001, 51100, 234, 2, 
 51101, 51200, 234, 2, 
 51201, 51300, 234, 2, 
 51301, 51400, 234, 2, 
 51401, 51500, 236, 2, 
 51501, 51600, 236, 2, 
 51601, 51700, 236, 2, 
 51701, 51800, 236, 2, 
 51801, 51900, 236, 2, 
 51901, 52000, 238, 2, 
 52001, 52100, 238, 2, 
 52101, 52200, 238, 2, 
 52201, 52300, 238, 2, 
 52301, 52400, 238, 2, 
 52401, 52500, 240, 2, 
 52501, 52600, 240, 2, 
 52601, 52700, 240, 2, 
 52701, 52800, 240, 2, 
 52801, 52900, 240, 2, 
 52901, 53000, 242, 2, 
 53001, 53100, 242, 2, 
 53101, 53200, 242, 2, 
 53201, 53300, 242, 2, 
 53301, 53400, 242, 2, 
 53401, 53500, 244, 2, 
 53501, 53600, 244, 2, 
 53601, 53700, 244, 2, 
 53701, 53800, 244, 2, 
 53801, 53900, 244, 2, 
 53901, 54000, 246, 2, 
 54001, 54100, 246, 2, 
 54101, 54200, 246, 2, 
 54201, 54300, 246, 2, 
 54301, 54400, 246, 2, 
 54401, 54500, 248, 2, 
 54501, 54600, 248, 2, 
 54601, 54700, 248, 2, 
 54701, 54800, 248, 2, 
 54801, 54900, 248, 2, 
 54901, 55000, 250, 2, 
 55001, 55100, 250, 2, 
 55101, 55200, 250, 2, 
 55201, 55300, 250, 2, 
 55301, 55400, 250, 2, 
 55401, 55500, 252, 2, 
 55501, 55600, 252, 2, 
 55601, 55700, 252, 2, 
 55701, 55800, 252, 2, 
 55801, 55900, 252, 2, 
 55901, 56000, 254, 2, 
 56001, 56100, 254, 2, 
 56101, 56200, 254, 2, 
 56201, 56300, 254, 2, 
 56301, 56400, 254, 2, 
 56401, 56500, 256, 2, 
 56501, 56600, 256, 2, 
 56601, 56700, 256, 2, 
 56701, 56800, 256, 2, 
 56801, 56900, 256, 2, 
 56901, 57000, 258, 2, 
 57001, 57100, 258, 2, 
 57101, 57200, 258, 2, 
 57201, 57300, 258, 2, 
 57301, 57400, 258, 2, 
 57401, 57500, 260, 2, 
 57501, 57600, 260, 2, 
 57601, 57700, 260, 2, 
 57701, 57800, 260, 2, 
 57801, 57900, 260, 2, 
 57901, 58000, 262, 2, 
 58001, 58100, 262, 2, 
 58101, 58200, 262, 2, 
 58201, 58300, 262, 2, 
 58301, 58400, 262, 2, 
 58401, 58500, 264, 2, 
 58501, 58600, 264, 2, 
 58601, 58700, 264, 2, 
 58701, 58800, 264, 2, 
 58801, 58900, 264, 2, 
 58901, 59000, 266, 2, 
 59001, 59100, 266, 2, 
 59101, 59200, 266, 2, 
 59201, 59300, 266, 2, 
 59301, 59400, 266, 2, 
 59401, 59500, 268, 2, 
 59501, 59600, 268, 2, 
 59601, 59700, 268, 2, 
 59701, 59800, 268, 2, 
 59801, 59900, 268, 2, 
 59901, 60000, 270, 2, 
 60001, 60100, 270, 2, 
 60101, 1000000, 270, 2, 
]

#end hunt==========
#VIP
HPBUYTIMES = [
  0, 1, 
  1, 2, 
  2, 3, 
  3, 4, 
  4, 6, 
  5, 10, 
  6, 14, 
  7, 20, 
  8, 24, 
  9, 28, 
  10, 34, 
  11, 40, 
  12, 50, 
  13, 70, 
  14, 100, 
  15, 150, 
]
GOLDBUYTIMES = [
  0, 2, 
  1, 5, 
  2, 20, 
  3, 30, 
  4, 40, 
  5, 50, 
  6, 60, 
  7, 70, 
  8, 80, 
  9, 90, 
  10, 100, 
  11, 120, 
  12, 150, 
  13, 200, 
  14, 250, 
  15, 300, 
]
ARENARESETTIMES = [
  0, 0,
  1, 0, 
  2, 0, 
  3, 1, 
  4, 2, 
  5, 3, 
  6, 4, 
  7, 5, 
  8, 6, 
  9, 7, 
  10, 8, 
  11, 9, 
  12, 10, 
  13, 11, 
  14, 12, 
  15, 13, 
]
VIP = [
  0, 0, 
  1, 1, 
  2, 100, 
  3, 300, 
  4, 500, 
  5, 1000, 
  6, 2000, 
  7, 3000, 
  8, 5000, 
  9, 7000, 
  10, 10000, 
  11, 15000, 
  12, 20000, 
  13, 40000, 
  14, 80000, 
  15, 150000, 
]
ROCKSTORE = [
  '08001', '08501', 0, 1, 300, 0, 0, 20, 
  '08011', '08511', 0, 2, 150, 75, 0, 15, 
  '08012', '08512', 0, 2, 60, 30, 0, 6, 
  '08013', '08513', 0, 3, 300, 600, 1, 30, 
  '08014', '08513', 1, 2, 300, 150, 0, 30, 
  '08020', '08020', 0, 3, 2000, 4000, 1, 195, 
  '08021', '08020', 1, 2, 2000, 1000, 0, 198, 
  '08017', '08517', 0, 3, 50, 100, 1, 5, 
  '08018', '08517', 1, 2, 50, 25, 0, 5, 
  '08015', '08515', 0, 3, 100, 200, 1, 10, 
  '08016', '08515', 1, 2, 100, 50, 0, 10, 
  '08022', '08022', 0, 3, 500, 1000, 1, 50, 
  '08023', '08022', 1, 2, 500, 250, 0, 50, 
  '08024', '08024', 0, 3, 1000, 2000, 1, 96, 
  '08025', '08024', 1, 2, 1000, 500, 0, 98, 
  '08026', '08026', 0, 3, 2000, 4000, 1, 196, 
  '08027', '08026', 1, 2, 2000, 1000, 0, 198, 
  '08030', '08030', 0, 3, 3000, 6000, 1, 292, 
  '08031', '08030', 1, 2, 3000, 1500, 0, 298, 
  '08032', '08032', 0, 3, 5000, 10000, 1, 488, 
  '08033', '08032', 1, 2, 5000, 2500, 0, 488, 
  '08034', '08034', 0, 3, 6000, 12000, 1, 578, 
  '08035', '08034', 1, 2, 6000, 3000, 0, 578, 
  '08036', '08036', 0, 3, 20000, 40000, 1, 1920, 
  '08037', '08036', 1, 2, 20000, 10000, 0, 1920, 
  '08038', '08038', 0, 3, 40000, 80000, 1, 3780, 
  '08039', '08038', 1, 2, 40000, 20000, 0, 3780, 
  '08040', '08040', 0, 3, 70000, 140000, 1, 6580, 
  '08041', '08040', 1, 2, 70000, 35000, 0, 6580, 
  '08042', '08042', 0, 3, 1000, 2000, 1, 98, 
  '08043', '08042', 1, 2, 1000, 500, 0, 98, 
  '08044', '08044', 0, 3, 2000, 4000, 1, 198, 
  '08045', '08044', 1, 2, 2000, 1000, 0, 198, 
  '08010', '08510', 0, 2, 1, 1, 0, 1, 
]
HUNTRESETTIMES = [
  0, 0,
  1, 0, 
  2, 0, 
  3, 1, 
  4, 2, 
  5, 3, 
  6, 4, 
  7, 5, 
  8, 6, 
  9, 7, 
  10, 8, 
  11, 9, 
  12, 10, 
  13, 11, 
  14, 12, 
  15, 13, 
]
GAINSTESETTIMES = [
  0, 0,
  1, 0, 
  2, 0, 
  3, 1, 
  4, 2, 
  5, 3, 
  6, 4, 
  7, 5, 
  8, 6, 
  9, 7, 
  10, 8, 
  11, 9, 
  12, 10, 
  13, 11, 
  14, 12, 
  15, 13, 
]
BOOKBUYTIMES = [
  0, 15, 
  1, 20, 
  2, 30, 
  3, 40, 
  4, 50, 
  5, 60, 
  6, 70, 
  7, 80, 
  8, 90, 
  9, 100, 
  10, 110, 
  11, 120, 
  12, 130, 
  13, 140, 
  14, 150, 
  15, 160, 
]
MINELIMIT = [
  0, 2, 
  1, 2, 
  2, 2, 
  3, 2, 
  4, 2, 
  5, 4, 
  6, 4, 
  7, 4, 
  8, 4, 
  9, 4, 
  10, 4, 
  11, 4, 
  12, 4, 
  13, 4, 
  14, 4, 
  15, 4, 
]
SPLIMIT = [
  0, 10, 
  1, 10, 
  2, 10, 
  3, 10, 
  4, 10, 
  5, 20, 
  6, 20, 
  7, 20, 
  8, 20, 
  9, 20, 
  10, 20, 
  11, 20, 
  12, 20, 
  13, 20, 
  14, 20, 
  15, 20, 
]
WORSHIPTIMES = [
  0, 1, 
  1, 1, 
  2, 1, 
  3, 1, 
  4, 1, 
  5, 1, 
  6, 1, 
  7, 1, 
  8, 2, 
  9, 2, 
  10, 2, 
  11, 2, 
  12, 2, 
  13, 3, 
  14, 3, 
  15, 3, 
]
PEARLBUYTIMES = [
  0, 15, 
  1, 20, 
  2, 30, 
  3, 40, 
  4, 50, 
  5, 60, 
  6, 70, 
  7, 80, 
  8, 90, 
  9, 100, 
  10, 110, 
  11, 120, 
  12, 130, 
  13, 140, 
  14, 150, 
  15, 160, 
]
HARDBATTTIMES = [
  0, 0, 
  1, 0, 
  2, 1, 
  3, 2, 
  4, 3, 
  5, 4, 
  6, 5, 
  7, 6, 
  8, 7, 
  9, 8, 
  10, 10, 
  11, 12, 
  12, 15, 
  13, 18, 
  14, 21, 
  15, 25, 
]
HPINCR = [
  0, 0, 
  1, 0, 
  2, 10, 
  3, 20, 
  4, 30, 
  5, 40, 
  6, 50, 
  7, 60, 
  8, 70, 
  9, 80, 
  10, 90, 
  11, 100, 
  12, 110, 
  13, 120, 
  14, 130, 
  15, 140, 
]
BM_PERMANENT = 0
BMRESETTIMES = [
  0, 2, 
  1, 4, 
  2, 6, 
  3, 8, 
  4, 10, 
  5, 12, 
  6, 14, 
  7, 16, 
  8, 18, 
  9, 20, 
  10, 22, 
  11, 24, 
  12, 26, 
  13, 28, 
  14, 30, 
  15, 32, 
]
MARKET_PERMANENT = 0
MARKETRESETTIMES = [
  0, 2, 
  1, 4, 
  2, 6, 
  3, 8, 
  4, 10, 
  5, 12, 
  6, 14, 
  7, 16, 
  8, 18, 
  9, 20, 
  10, 22, 
  11, 24, 
  12, 26, 
  13, 28, 
  14, 30, 
  15, 32, 
]
STORERESETTIMES = [
  0, 2, 
  1, 4, 
  2, 6, 
  3, 8, 
  4, 10, 
  5, 12, 
  6, 14, 
  7, 16, 
  8, 18, 
  9, 20, 
  10, 22, 
  11, 24, 
  12, 26, 
  13, 28, 
  14, 30, 
  15, 32, 
]
HUNTDOUBEL = [
  0, 1,
  1, 1,
  2, 1,
  3, 2,
  4, 3,
  5, 4,
  6, 5,
  7, 6,
  8, 7,
  9, 8,
  10, 9,
  11, 10,
  12, 11,
  13, 12,
  14, 13,
  15, 14,
]

#end VIP
WORSHIPRANK = 10

#start exped
EXPEDPROD = {
  "01001": {
    "exped_coin": 100,
    "name": "木材",
    "num": 5
  },
  "01002": {
    "exped_coin": 150,
    "name": "铸铁",
    "num": 5
  },
  "01003": {
    "exped_coin": 150,
    "name": "铝合金",
    "num": 5
  },
  "01004": {
    "exped_coin": 200,
    "name": "结构钢",
    "num": 5
  },
  "01005": {
    "exped_coin": 300,
    "name": "碳素钢",
    "num": 5
  },
  "01006": {
    "exped_coin": 300,
    "name": "钛合金",
    "num": 5
  },
  "03025": {
    "exped_coin": 500,
    "name": "半人马级航母",
    "num": 1
  },
  "03023": {
    "exped_coin": 500,
    "name": "独立级航母",
    "num": 5
  },
  "03024": {
    "exped_coin": 500,
    "name": "天鹰级航母",
    "num": 5
  },
  "04002": {
    "exped_coin": 400,
    "name": "珍珠",
    "num": 5
  }
}
EXPEDRESETTIMES = [
  0, 1,
  1, 1,
  2, 1,
  3, 1,
  4, 1,
  5, 1,
  6, 1,
  7, 1,
  8, 1,
  9, 1,
  10, 2,
  11, 2,
  12, 2,
  13, 2,
  14, 2,
  15, 2,
]
EXPEDREFRESH = [
  1, 10,
  2, 10,
  3, 20,
  4, 20,
  5, 30,
  6, 30,
  7, 40,
  8, 40,
  9, 50,
  10, 50,
]

#end exped

#start versus
#10V10 商店 竞技场
VERSUS_OPEN_LIMIT = 9
VERSUS_MAIL_LIMIT = (100000, 9)
#10V10 商店出售物品
VERSUSPROD = {
  "01001": {
    "versus_coin": 100,
    "name": "木材",
    "num": 5
  },
  "04002": {
    "versus_coin": 400,
    "name": "珍珠",
    "num": 5
  }
}
VERSUSREFRESH = [
  1, 10, 
  2, 10, 
  3, 20, 
  4, 20, 
  5, 30, 
  6, 30, 
  7, 40, 
  8, 40, 
  9, 50, 
  10, 50, 
]
VERSUSRESET = [
  1, 50, 
  2, 100, 
  3, 150, 
  4, 200, 
  5, 250, 
  6, 300, 
  7, 350, 
  8, 400, 
  9, 450, 
  10, 500, 
]
VERSUSRULE = [
  1, 1, 0, 0, 0, 0, 0, 0, 
  2, 2, 1, 1, 0, 0, 0, 0, 
  3, 3, 2, 2, 0, 0, 0, 0, 
  4, 4, 2, 2, 3, 3, 0, 0, 
  5, 5, 2, 2, 3, 3, 4, 4, 
  6, 6, 2, 3, 4, 4, 5, 5, 
  7, 7, 2, 3, 4, 5, 6, 6, 
  8, 8, 2, 3, 4, 5, 6, 7, 
  9, 9, 3, 4, 5, 6, 7, 8, 
  10, 10, 4, 5, 6, 7, 8, 9, 
  11, 20, 6, 7, 8, 9, 10, 19, 
  21, 30, 10, 14, 15, 19, 20, 29, 
  31, 40, 15, 22, 23, 29, 30, 39, 
  41, 50, 20, 28, 29, 39, 40, 49, 
  51, 70, 30, 39, 40, 49, 50, 69, 
  71, 100, 50, 59, 60, 69, 70, 99, 
  101, 200, 60, 79, 80, 99, 100, 199, 
  201, 300, 100, 129, 130, 199, 200, 299, 
  301, 400, 150, 209, 210, 299, 300, 399, 
  401, 500, 250, 299, 300, 349, 350, 499, 
  501, 700, 350, 399, 400, 449, 450, 699, 
  701, 1000, 550, 599, 600, 649, 650, 999, 
  1001, 1500, 800, 899, 900, 999, 1000, 1499, 
  1501, 2000, 1300, 1399, 1400, 1499, 1500, 1999, 
  2001, 2500, 1800, 1899, 1900, 1999, 2000, 2499, 
  2501, 3000, 1900, 1999, 2000, 2499, 2500, 2999, 
  3001, 3500, 2000, 2499, 2500, 2999, 3000, 3499, 
  3501, 4000, 2500, 2999, 3000, 3499, 3500, 3999, 
  4001, 4500, 3000, 3499, 3500, 3999, 4000, 4499, 
  4501, 5000, 3500, 3999, 4000, 4499, 4500, 4999, 
  5001, 5500, 4000, 4499, 4500, 4999, 5000, 5499, 
  5501, 6000, 4500, 4999, 5000, 5499, 5500, 5999, 
  6001, 6500, 5000, 5499, 5500, 5999, 6000, 6499, 
  6501, 7000, 5500, 5999, 6000, 6499, 6500, 6999, 
  7001, 7500, 6000, 6499, 6500, 6999, 7000, 7499, 
  7501, 8000, 6500, 6999, 7000, 7499, 7500, 7999, 
  8001, 8500, 7000, 7499, 7500, 7999, 8000, 8499, 
  8501, 9000, 7500, 7999, 8000, 8499, 8500, 8999, 
  9001, 9500, 8000, 8499, 8500, 8999, 9000, 9499, 
  9501, 10000, 8500, 8999, 9000, 9499, 9500, 9999, 
  10001, 100000, 8000, 8499, 8500, 8999, 9600, 99999, 
]
VERSUSHISTORY = [
  1, 2, 550, 1.0, 
  2, 3, 450, 1.0, 
  3, 4, 400, 1.0, 
  4, 5, 300, 1.0, 
  5, 6, 250, 1.0, 
  6, 7, 200, 1.0, 
  7, 8, 160, 1.0, 
  8, 9, 140, 1.0, 
  9, 10, 120, 1.0, 
  10, 11, 100, 1.0, 
  11, 20, 1, 20.0, 
  20, 30, 1, 18.0, 
  30, 40, 1, 16.0, 
  40, 50, 1, 14.0, 
  50, 70, 1, 12.0, 
  70, 100, 1, 10.0, 
  100, 200, 1, 6.0, 
  200, 300, 1, 5.5, 
  300, 400, 1, 4.5, 
  400, 500, 1, 3.5, 
  500, 700, 1, 1.5, 
  700, 1000, 1, 1.0, 
  1000, 2000, 1, 0.8, 
  2000, 3000, 0, 0.0, 
  3000, 4000, 0, 0.0, 
  4000, 5000, 0, 0.0, 
  5000, 7000, 0, 0.0, 
  7000, 10000, 0, 0.0, 
  10000, 100000, 0, 0.0, 
]
VERSUSDAY = [
  1, 1, 550, 100000, 800, 18000, 
  2, 2, 500, 95000, 775, 15000, 
  3, 3, 450, 90000, 750, 13500, 
  4, 4, 400, 85000, 725, 12000, 
  5, 5, 350, 80000, 700, 10500, 
  6, 6, 340, 75000, 680, 9000, 
  7, 7, 330, 70000, 660, 7500, 
  8, 8, 320, 65000, 640, 6000, 
  9, 9, 310, 60000, 620, 4500, 
  10, 10, 300, 55000, 600, 3000, 
  11, 20, 250, 50000, 590, 2400, 
  21, 30, 200, 45000, 575, 2100, 
  31, 40, 150, 40000, 560, 1800, 
  41, 50, 130, 35000, 545, 1500, 
  51, 70, 110, 30000, 530, 1200, 
  71, 100, 100, 27500, 515, 900, 
  101, 200, 90, 25000, 500, 600, 
  201, 300, 80, 22500, 450, 480, 
  301, 400, 70, 20000, 425, 420, 
  401, 500, 60, 18000, 400, 360, 
  501, 700, 55, 16000, 350, 300, 
  701, 1000, 55, 14000, 300, 240, 
  1001, 2000, 55, 12000, 260, 180, 
  2001, 3000, 50, 10000, 220, 180, 
  3001, 4000, 50, 9000, 180, 120, 
  4001, 5000, 50, 8000, 140, 120, 
  5001, 7000, 45, 7000, 100, 60, 
  7001, 10000, 45, 5000, 50, 60, 
  10001, 100000, 45, 2500, 0, 0, 
]
VERSUSOUTPUT = [
  1, 1, 30,
  2, 2, 28,
  3, 3, 27,
  4, 4, 26,
  5, 5, 26,
  6, 6, 25,
  7, 7, 25,
  8, 8, 24,
  9, 9, 24,
  10, 10, 23,
  11, 20, 23,
  21, 30, 22,
  31, 40, 22,
  41, 50, 21,
  51, 70, 21,
  71, 100, 20,
  101, 200, 20,
  201, 300, 19,
  301, 400, 18,
  401, 500, 17,
  501, 700, 17,
  701, 1000, 16,
  1001, 2000, 10,
  2001, 3000, 9,
  3001, 4000, 8,
  4001, 5000, 7,
  5001, 7000, 6,
  7001, 10000, 5,
]
VERSUSSTATE = {
  '1': 'core_liangstate',
  '2': 'core_yistate',
  '3': 'core_jingstate',
  '4': 'core_qingstate',
}
VERSUSRESETTIMES = [
  0, 0,
  1, 0,
  2, 0,
  3, 1,
  4, 2,
  5, 3,
  6, 4,
  7, 5,
  8, 6,
  9, 7,
  10, 8,
  11, 9,
  12, 10,
  13, 11,
  14, 12,
  15, 13,
]
#end versus
#start libao
SDLI1 = {
  "sender": "若柳",
  "title": "删档大礼包",
  "content": "尊敬的指挥官大人:\n"
             "    感谢您参与战舰世界的删档测试，您在删档测试中战队等级大于30级，获得了删档大礼包，请您取哦！",
  "jawards": {'rock': 2888, 'feat': 0, 'gold': 0, 'prods':{'03013':30}}
}
SDLI2 = {
  "sender": "若柳",
  "title": "删档礼包之中礼包",
  "content": "尊敬的指挥官大人:\n"
             "    感谢您参与战舰世界的删档测试，您在删档测试中在30到50级之间，获得了中礼包，请您取哦！",
  "jawards": {'rock': 1000, 'feat': 0, 'gold': 0, 'prods':{'03003': 5}}
}
SDLI3 = {
  "sender": "若柳",
  "title": "删档礼包之叫兽礼包",
  "content": "尊敬的指挥官大人:\n"
             "    感谢您参与战舰世界的删档测试，您在删档测试中在50级以上，获得了叫兽礼包，请您取哦！",
  "jawards": {'rock': 3000, 'feat': 0, 'gold': 0, 'prods':{'03003': 5, '03008': 15}}
}
#end libao
MAIL_UPLEVEL = {
  "sender": "若柳",
  "title": "冲级礼包",
  "content": "大人:\n"
             "您已经冲到了%s级！\n"
             "我们获得了附件里面的奖励。"
}
MAIL_LOGIN = {
  "sender": "若柳",
  "title": "登陆礼包",
  "content": "大人:\n"
             "您在%s到%s时间之内，已经登陆了%s天！\n"
             "我们获得了附件里面的登陆奖励。"
}